{"text":{"0":"когда игры с рипов","1":"Это я","2":"и кто тут умеет им пользоваться?)","3":"Ну мало ли. Всем разное надо","4":"Ужасный, хуже быть не может","5":"следов работы чёт не заметил, а что бота прикрутили своего?","6":"Если вдруг она действительно девушка и умеет в ассемблер -- женюсь.","7":"во","8":"Или вбей в хексэдиторе код из дампа (little endian!) И его дизассемблируй обждампом","9":"Хера се набежало!\nВообще, недавно, помнится, около 1к было, сейчас уже 2к.","10":"Да нечего ему показывать.","11":"ща проверю","12":"Кстати, nasm хорошо умеет в x86-64 ? Просто где-то читал, что он поддерживает якобы не все инструкции, но сталкивался ли кто-нибудь с этим на практике?","13":"ахахах и как?","14":"Эти переменные должен юзер задавать, который собирает всю эту дрянь","15":"мы че тут о чем то серьезном говорим?","16":"ибо препод не обьяснил ничего совсем, а информации в интернете нету)","17":"Норм","18":"Майнить биткоины самраз","19":"😂😂😂👍","20":"Я про способы определения длины массива","21":"Да, но в неё всё же вносятся изменения этих более мелких версий.\nМеня интересует, с какой версией fasm была взята исходная справка для перевода?","22":"Как пожаловаться на спам?","23":"А как ты его собираешь?","24":"когда уефи передает управление оси, обработчики прерываний таймеров пустые. затем оси там декларируют свои обработчики. вот при декларировании по сути они переписывают то что в них есть.","25":"Суккк","26":"Да","27":"А это последний зачет","28":"а gcc, возможно и gas тоже, генерируют слишком большие бинарники","29":"try JWasm - https:\/\/github.com\/JWasm\/JWasm","30":"Ну так я не против, но мне для нормальной реализации только и надо, что динамическое выделение памяти","31":"Я только за.","32":"А жизнь проходит","33":"радасм нашевсе)","34":"?","35":"","36":"не тру","37":"мб это не адрес команды, а её ид\/индекс?","38":"а пакеты как упакованы?","39":"))))))))","40":"Да это тоже при допризывной на линуксе запустить","41":"","42":"лет тебе значит <=18","43":"это указатель","44":"ну если так то вполне возможно))","45":"Всем привет хелпаните пожалуйста, мне нужно сделать функцию, допустим: \nvoid calc(float *arr, int) \/\/ буду вызывать ее из Си кода\n—\n1) Правильно ли я понимаю, что для работы над float числами, нужно их сначала записывать в floating point unit (FPU) регистры, то есть в регистаы st0, st1 ... и дальше уже применять всякие операции над ними?\n2) Если так, то как должен выглядеть воркфлоу? Вот я передаю массив флоатов в свою x86 функцию calc, дальше я так понял нужно использовать fld dword [rdi] для записи в st0 и в конце обратно записываю величину в свой массив fst dword [rdi]. Или как-то это иначе все делается?\nNASM, X86_64","46":"Не избавишься. imul самое короткое, что можно изобрести.","47":"yup, just use SVN autobuild","48":"Google защитит паролем целостность прошивки Pixel 2\n\nРазработчики Google сообщили, что смартфоны Pixel 2 получат дополнительную защиту против неавторизованных попыток обновить или подменить прошивку.\n\nhttps:\/\/xakep.ru\/2018\/06\/06\/insider-attack-resistance\/","49":"Стандарт одинаков ко всем ос","50":"Из SPBctf ребята","51":"А там есть dx отладчик ?","52":"а вы перешил во флудилку??","53":"Наверное надо использовать virtalloc","54":"к аудиоархиву )","55":"Эт не я","56":"две старшие единички","57":"Может) не сильно пока разбираюсь)","58":"всмысле только целая часть","59":"На самом деле задача в том, чтобы разместить своё окно в некой области (например, в правой части экрана), и другая прога, разворачиваясь на весь экран, не загораживала это окно.","60":"а чего тут такого?","61":"это перевод вот этого как я понял https:\/\/ftp.gnu.org\/old-gnu\/Manuals\/gas-2.9.1\/html_chapter\/as_toc.html","62":"заражение PE разве сейчас требует наличие уязвимостей?","63":"Че опять то выходишь?) че то тут не прозрачно все :))","64":"Если чото платно станет бесплатно и\/или открыто)","65":"nop разве не 0xFF?","66":"Хорошие, рабочие сиськи тоже не у всех","67":"А ещё есть ARM Cortex-Mx и они контроллеры, причем лучше AVR.","68":"И вопрос по спецификаторам.\nЕсли я использую `fld` \/ `fstp`, какой спецификатор использовать в clobbers?\n`asm(\n   ...\n   \"fld ...\"\n   \"fld ...\"\n   ...\n   \"fstp ...\"\n   \"fstp ...\"\n   ...\n  : \/\/ outputs\n  : \/\/ inputs\n  : \/\/ clobbers\n);`","69":"ахъахах","70":"Но я делаю всё в Винде.","71":"т.е. 5 часов работаешь и ложишься спать","72":"MMU в какой-нибудь минимальной конфигурации - вполне норм","73":"через премьер-министра выбил себе 4ый курс","74":"Ну вот. Найдите отличия в этих картинках :)","75":"ахз, я там нет) тут он дней 5 назад чтоль хвастался что его  повязали и искал того на кого свалить можно будет новое дело)","76":"Базовый, расширения есть разные.","77":"[-] Error open PhysicalDriver0","78":"","79":"вопрос про шиндоус, и для архитектуры x86, и для x64. я запустился в процессе и мне нужно взять пару случайных чисел с потолка.","80":"вот ты будешь подрывателем","81":"типа дай позвонить","82":"*т","83":"anon 05-12-2016 15:25:33\nглавное правильный вброс сделать, а дальше все лавиной пойдет","84":"А есть разница?","85":"У тебя логи со всех чатов в один сливаются?","86":"щас воторую часть надо оформить","87":"стоит ли переходить на sse","88":"вот у заказчика юзерспейс мозга точно","89":"звучит как вызов 😄","90":"Ты написал, что на интеле sysenter, я пишу, что не только на интеле. И где-то тут еще в диалоге проскакивал syscall, я и его вставил в свое сообщение","91":"","92":"хотя там есть POKE для прямого доступа к регистрам порта","93":"Мафтун?","94":"Кстати, 2х10000 = 20 тыс, а не 2. В любом случае это ни о чём вообще.","95":"и кстати да, я был в том чатике - но вышел, за это автобана нет?","96":"MetaWare dev toolkit ниукого не завалялся случаем?) не лайт","97":"посади школьника на с++17 и скажи ему вперед. без литературы, что выйдет?","98":"","99":"пизец бля","100":"Не слышал ни разу такого разговорного :))\n\nВ целом, если не выравнивать, тоже будет работать нормально. Там только при переходе через 0 какой-то косяк, не помню уже что именно происходит. Например, когда sp=1 и делаешь push.","101":"http:\/\/xvilka.me\/tctf_slides.pdf - tak poidet?","102":"на хую вертел","103":"уже начали писать","104":"я лично от кучи 18650 тачку заводил.","105":"wasm.in, так и назвал. только смысла в ней пока нету, мы тут сидим, всё хорошо :)","106":"","107":"Смотрю народа все прибавляется и прибавляется","108":"","109":"Я знаю.","110":"```null joined the group```","111":"темноты и мрака там дохерищща а как ты хотел чтоб на разъёбанной станции марсовой было?","112":"и второй нюанс, если вставляемый тобой код вызывает внешние функции напасанные на си или плюсах, лучше выравнивай как положено","113":"Было бы неплохо. Там есть очень удобный поиск по страницам","114":"Что крутого? Абсолютно непортируемая система","115":"?","116":"я ж ss нигде в проге не использую, или его использует сам биос в моих прерываниях?","117":"LITE версию, 150 страниц","118":"ахахаха","119":"Компилятор с опцией листинга в асм код","120":"Но это ноутовский проц (Ryzen), в синтетике он, в общем-то чуть-чуть шустрее моего Sandy Bridge'а.","121":"there are tons of uml generators, but so far code is crap","122":"Доберусь до ноутбука тока","123":"По-моему единственная такая штука - теневые регистры.","124":"И как такие строки менять, сохраняя старые? У меня кроме объединения есть ещё и другие операции.","125":"Благодарю!","126":"обнова","127":"поэтому на нем алгоритмы и преподавали, чтобы от алгоритмов не отвлекало ничего","128":"кстати сейчас посмотрю","129":"срач?","130":"100-120 бачей","131":"дык допили сам редактор. воткни в него кнопку чтоб вливал по определенному смещению на выбранное устройство )","132":"scaleway.com","133":"Асм проще чем выглядит, я вообще не понимаю всего этого ну рассматривай мнемонику, как функцию которая работает только с двумя переменными. Проблема асма в том, что он знания архитектуры тянет","134":"Intel Advisor","135":"Вообще недавно стал читать \"кодеры за работой\" изменил своё мнение относительно джавы и си. Джава хороша чем то","136":"👍👍","137":"","138":"Да, но вернее Functional stuctures","139":"\/ban","140":"Уже","141":"спасибо, эту не читал","142":"детектят как потенциально не желательный и все","143":"это не тот случай","144":"походу нет 😂","145":"Умножитель","146":"я про аппаратную платформу","147":"ну на циклон думаю 8086 влезет","148":"всего же получается 24 бита","149":"Но никто же не сказал что нейронка не на асме","150":"","151":"зад будет похож на гильзу снаряда, который разорвался в гаубице без воска","152":"но последние чет работают очень плохо","153":"пару секунд работает и terminated","154":"Есть че то","155":"все так говорят :)","156":"Именно","157":"Не, как раз проверено опытным путём, что main берёт аргументы из RDI и RSI — mov'ал туда магические числа и делал return argc и return argv для exitcode","158":"а что если у меня есть флеха и я хочу заставить комп исполнять свой код? что мне для этого нужно?","159":"Кстати, есть какой-то асм, вернее нечто типа препроцессора, запускающего fasm (кажется), реализующий некоторое подобие ооп. Сырая поделка, конечно. Названия не помню.","160":"Но это вымирающий вид","161":"эт..","162":"при полном проекте меньше 500 байт","163":"В ассемблере полный 0","164":"","165":"https:\/\/ru.m.wikipedia.org\/wiki\/Микроархитектура","166":"правда на деле уходит час","167":"Вся нормальная информация на английском. Это как бы стандарт.","168":"В роликах парень демонстрирует как все работает и как установить и настроить","169":"И подключена ли сишная либа?","170":"Ахаахах","171":"ку","172":"http:\/\/www.jbox.dk\/sanos\/source\/sys\/osldr\/bioscall.asm.html","173":"Всем салютище!","174":"Решила переквалифицироваться?","175":"Что означает ошибка компилятора invalid literal constant pool needs to be closer?","176":"За тебя никто писать не будет это раз. \nСканф это си — два.","177":"А gas с at&t синтаксисом не всем приятен","178":"Есть один секрет","179":"А без стд волокет ?","180":"Ребзя, тут есть опытные юзеры radare2?","181":"чекает версию винды пользвателя и тд","182":"с довольной ужравшейся рожи","183":"А что мне этот `GetClassInfo` даст, какую инфу?\nОткуда инфа, что это от Edit атом?","184":"Потому что есть ОС, где любители Си и восьмеричной системы считают это фичей.","185":"вот только надо ещё подумать над тем а умеет ли dos в dma, а точнее более производительные режимы, чем чтение через порты ввода вывода","186":"на программиста","187":"а новостной канал","188":"нет, у меня не пошёл","189":"Просто емнип word изначально подразумевалось под машинным словом для 8086, потом просто оставили как 2 байта и всё на этом. Ну а далее dword - двойное слово, т.к. word уже есть и писать qbyte нелогично.","190":"https:\/\/www.youtube.com\/watch?v=nqn4LUny3zI","191":"нет","192":"😂","193":"Идея в принципе неплохая - протоколы, приоритеты. Но реализация...","194":"Как стало известно ранее, группировка Cozy Bear, предположительно имеющая отношение к спецслужбам РФ, атаковала ряд организаций в США спустя несколько часов после объявления о победе Дональда Трампа.","195":"http:\/\/doctus-stilus.narod.ru\/arch\/arch_img\/dmplex.png","196":"скорее всего","197":"так же как у intel не поддерживаются некоторые amd расширения","198":"Гипертрединг?","199":"\/extra #asmflood Флудилка для асмеров – тут: https:\/\/telegram.me\/joinchat\/BYlFbD-hNV4\\_rsFiBqmKTA","200":"дх при длинной арифметике используется как хранилище для целых чисел или как старшая часть числа","201":"это какой-то очень странный фашизм :)","202":"Как вы считаете стоит?","203":"ну тк.","204":"Если нужно","205":"си это платформонезависимый ассемблер :)","206":"думаю сойдет","207":"Ну как подключить таймер я понял\nОн тикает \nСветодиод мигает\nЯ не могу именно точный интервал выставить \nTCNT0 доходит до 255 переходит в прерывание и в прерывании там уже функция OUT на порт B чтобы диод вкл","208":"и вот","209":"Это на каком шкафу они прогили?","210":"учи матчасть","211":"Типа взял epb+8 и получил свой hwnd","212":"потому что префиксы c4 и c5 это vex и evex они в реалмоде вроде как заняты опкодами les и lds","213":"флаги в отладчике","214":"hd Signed short integer argument.\nhu Unsigned short integer.","215":"а где взять адрес строки? И зачем в коде нужна repne scasb?\nТот код я нашел и модифицировал прост","216":"Кто какие средства вихретокового контроля знает?","217":"Остаётся предполагать, что граб грузит линь каким-то вообще отдельным способом, не подразумевающим multiboot","218":"Писать змейку на асме скучно","219":"эйчар.","220":"Visual Studio","221":"Без драйвера никак. А с драйвером абсолютно фиолетово, откуда `DeviceIoControl()` вызывать, хоть из JavaScript.","222":"мне по заданию так нужно, в стек запихнуть параметры,  и с процедуры в стеке достать параметры","223":"32-bit operands generate a 32-bit result, zero-extended to a 64-bit result in the destination general-purpose register.","224":"😄😄😄😀😀","225":"Это ещё кто? 🤔","226":"Откуда скачки?","227":"https:\/\/github.com\/torvalds\/linux\/blob\/master\/kernel\/relay.c","228":"Спасибо!\nКажется заработало","229":"а простите,я тупой","230":"emu8086 среда","231":"Ну это как уж компилятору Бог на душу положит. Чаще всего - да, два регистра и флаг переноса","232":"Если же нужно ломать то выхода два","233":"потому что это повлечет за собой сдвиг адресов и поломает весь бинарник","234":"Ахах. Я даже не знаю есть ли ide для ассемблера","235":"and make a clean install","236":"Для начала спереть сырцы. Потом переписать.","237":"можно в майкрософт его отослать","238":"А я не так прочитал да","239":"Вот имхо","240":"веракрипт, кстати, так умеет","241":"а в авр студио:подключил и забыл","242":"ага, попробуй дать поиграть молодняку, будет скулить и стонать","243":"я на фасме пишу, для него нет вроде внятного иде со строеным дебагером","244":"бывает что за дающих воспринимают не тех, а тех что нет...ну вы поняли","245":"это ида так умеет?","246":"Можно.","247":"О, я это и искал, спасибо большое","248":"Для души","249":"Тогда тебе ещё нужно знать правила вытеснения.","250":"потом я вспомнил, что бывает ещё и wchar_t :)","251":"ah=35h \/ int 21h получает старый обработчик, ah=25h устанавливает новый.","252":"Скинешь сюда?","253":"Крупник Изучаем Ассемблер. Самая простая для начинающих)) Или что посложнее?","254":"я знаю твой район братишь, так что скоро ты ответишь за свои слова","255":"Был бы он с более классическими формами все было б проще","256":"все вопросы вообще уходят, если посмотреть схему. что из себя представляет ардуина? это платка с мк atmega и usb-usart, стабик питания и всё. там нет магии. есть гугл и даташиты на мк.","257":"Так что моим вопросом никто не интересовался?","258":"Последнее предупреждение про вещества.","259":"Intel MPX которые","260":"ollydbg","261":"вряд ли","262":"https:\/\/www.ozon.ru\/context\/detail\/id\/6151449\/","263":"Хотя","264":"Пожалуйста, не спамь.","265":"It is not omnipresent but common, you can chk Linux sources to see how it works","266":"это нужно учитывать просто и идти против себя же","267":"Привет\nГде пропадала, тебя почти год не было видно","268":"такс такс такс","269":"как мне эти аргументы запушить?","270":"Хорошо))","271":"Hi Arthur, and welcome to **pro.asm**!","272":"А то 100 O_CREAT , нужно было 1 еще добавить O_WRTONLY","273":"ьзш rkfcnth","274":"А курсач еще даже не начал разрабатываться. Плохой курсач","275":"я про простые проги говорил","276":"Блин, я уже совсем подбностей не помню. Проекты не храню практический.","277":"сейчас реклама будет","278":"это его любимый язык","279":"\/warn оффтоп","280":"","281":"почему такое считает за ошибку?","282":"ааааааааааа","283":"самого файла","284":"Ну это да, соглы","285":"уже нашел, а ва какие форматы экспорта он умеет?","286":"Но это другая задача","287":"Зубков и Джордейн","288":"Что?","289":"Повезло","290":"А где там 256b было, не найду что-то на твитче?","291":"efi bios","292":"бит опечатался 64 бит","293":"Вчера спрашивал про linux, btrfs + LUKS возможно?","294":"Необязательно.","295":"> новые условные инструкции для чтения\/записи и сравнения (`cfmovcc`, `setcc.zu`, `ccmp`, `ctest`, а также атомарная инструкция `cmpccxadd`),\nмне одному это напоминает ARM? ещё тот, что до Thumb был","296":"ибо не делали   смд и бат","297":"linux kernel - это действительно неструктурированая монолитная параша без какого-либо даже намёка на модульность","298":"VirtualBox возьми, в нëм есть UEFI","299":"Ну тут да","300":"Ща ищу инфу как раз про это.","301":"секции то тебе зачем, смотри релокации","302":"mov eax","303":"Спека где-т тут валялась на архитектуру и instruction set","304":"Петушки в спермосоусе","305":"начиная с адреса в rsi","306":"А ты их не слушай, пусть и дальше справа налево читают","307":"https:\/\/xakep.ru\/2016\/12\/12\/car-thiefs-used-jammers\/","308":"да, наверное. Я помню интересовался и делал какие-то штуки еще в студенчестве","309":"Значит не правильно понял, извини.","310":"ну стоило 1.5\/7 доллара","311":"Ты уверен, что написал в тот чат?","312":"Управление вручную и через сухарики","313":"```C:\/FASM\/INCLUDE\/win64wx.inc [136] import_user32 [0]:\n{ common macro import_#lib \\{ import lib,functions \\} }\nC:\/FASM\/INCLUDE\/macro\/import64.inc [50] import [24]:\n       label dq RVA _label\nprocessed: ShowCursor dq RVA _label?0A3\nerror: symbol already defined.```","314":"Ахах","315":"Предвпрительно загрузив vmlinuz?","316":"они научат мыслить, искать и находить ответы на возникающие вопросы, если жить на готовых решения, то спецом не стать","317":"ладно я офф","318":"а","319":"делаешь две секции","320":"нет, это нельзя назвать дырой в безопасности","321":"Или так:\n`vperm2f128 ymm0,ymm0,ymm0,0x0\n`Но это всё равно в 2 этапа, дальше всё равно `vshufpd` нужно делать.\nПоищу, может, можно разом всё сделать...","322":"","323":"считай аналог","324":"пришлось посмотреть фасмоский файл","325":"попробуй через эту функцию изменить размер чужого окна с флагом SWP_NOSENDCHANGING. Но я очень не уверен. Но возможно на этот раз он не вернет себе обратно размер","326":"всем привет. у меня подобный вопрос\" как вы их находите?\" у меня тоже есть подозрение что есть вирусня, приходили фишинг-сообщения, но антивирус не ругается а искать хз как","327":"ну вот такой селектор, чтобы прыгать из 32 в 64 и обратно :)","328":"> ссылка — переменная, указывающая на обьект\nЭто называется указатель.","329":"","330":"Мы бережно все перенесли из sourceforge","331":"жилье","332":"ну я понял что траленк","333":"о. попробую.","334":"где у него точка входа вообще?","335":"сохрани в диск, и в свой ствах убери \"только чтение\"","336":"Туннель строят","337":"Хз, в трех чатах не вижу ботов","338":"NtQueueApcThread смотрю не документированные юзаешь ))))","339":"причём как длл, и главная функция - в экспорте","340":"чтобы устал смотреть","341":"вон гугл слил в сетьсплоит по инжекту длл","342":"я по ходу 10 лет проспал","343":"всё просто на примитивном уровне","344":"(python 3 ветки )","345":"джава такая же императивщина внутри","346":"Пожалуйста.\nПару часов и все получится ) 😁","347":"Меня не пускает на тот сайт","348":"Тогда еще на hybrid analis залей по дорожке ^_^","349":"кстати...","350":"старый командер вроде как раз влезал","351":"ti_sysbios_family_arm_m3_Hwi_disableFxn__E(), ti_sysbios_hal_Hwi_HwiProxy_disable__E():\n00010558:   2120                movs       r1, #0x20\n0001055a:   F3EF8011           .word       0x8011f3ef\n0001055e:   F3818811           .word       0x8811f381\n00010562:   4770                bx         lr","352":"Хотя я давно их в ноутах невидел)","353":"Мне бы точно. Так то кажется будто так. Но например почему есть значение этой колонки напротив резервед?","354":"Подробнее пожалуйста.","355":"Лучше к пидарам","356":"Человека который не хочет бегать по утрам ничто не остановит","357":"Да","358":"","359":"[0x0040067a]> dr\nrax = 0x108a3b73686fe700\nrbx = 0x00000000\nrcx = 0x00000000\nrdx = 0x7ffc1bbe6060\nr8 = 0x7fad0b63ec60\nr9 = 0x7fad0b651de0\nr10 = 0x7ffc1bbe5df0\nr11 = 0x7fad0b2b9a50\nr12 = 0x00400540\nr13 = 0x7ffc1bbe6040\nr14 = 0x00000000\nr15 = 0x00000000\nrsi = 0x7ffc1bbe6048\nrdi = 0x7ffc1bbe788e\nrsp = 0x7ffc1bbe5f10\nrbp = 0x7ffc1bbe5f40\nrip = 0x0040068f\nrflags = 0x00000202\norax = 0xffffffffffffffff","360":"аххаха","361":"спс","362":"шрифт сбрасывается","363":"https:\/\/en.m.wikipedia.org\/wiki\/Bitcoin","364":"Джазель вроде умерла давно","365":"Python, C, Assembler, PHP, Scrath.","366":"Кто-то собирает марки","367":"вот тут показано лучше","368":"Он же еще не реализован","369":"Нулл, ты расссказывай","370":"а так ты получается хочешь из обычного юзера перехватить общий setuid() и стать рутом :) нет, если бы так было возможно - это была бы уязвимость","371":"b4h>10h","372":"Слишком громоздко. \nАналоговый калькулятор без единого процессора может уместиться в 5 - 10 корпусов","373":"https:\/\/www.youtube.com\/watch?v=iF8CnG7ee-A","374":"что у тебя там? код, данные?","375":"Суровый опыт:)","376":"кхе-кхе.\nчо за софт васи пупкина? :D","377":"Вроде баян","378":"Так или иначе это слишком просто обходится","379":"Я серьёзно.","380":"","381":"значит использование or оптимальнее для копирования младших частей регистра без порчи старшей","382":"Код в Thumb2 (помесь 16-битных и 32-битных инструкций, все инструкции располагаются по чётным адресам).","383":"Попытался написать DLL на masm\nhttps:\/\/pastebin.com\/1Q6FuARN\nвроде все собирается, но программа на c++ не находит библиотеку.\nПосмотрите пожалуйста, может быть ошибки в коде есть?","384":"","385":"заработало","386":"Приветствую всех","387":"наоборот","388":"тогда хотел бы уточнить, что ты подразумеваешь под словом позволяют? процы себе ничего не могут позволить, это машина. позволяет человек, если он захочет он поделит на ноль, если это программно ноль вычислился, то прогер добавит доп код чтоб избежать краша\/зависа","389":"Да))","390":"А там без разницы, потому что offset - это константа.\nADDR по типу LEA работает","391":"эт с учетом что уменя х32","392":"👆","393":"😞","394":"ща","395":"так что..","396":"Но, каждый выбирает свой инструмент)","397":"нифига","398":"Кто-то пишет на асме что-то пол линукс?","399":"O_O А говорит, что the admins of this group have restricted you from writing here, но понятно)","400":"\"мой\" гугл уже многие годы прокачивается темой асма. а твой?","401":"ааа, это ты с айтити разбираешься","402":"Но прикольная хрень.","403":"да ладно, в чем ж смысл тогда","404":"...\nsomewhere: *","405":"Много.","406":"бля щас напочту напишу","407":"Про mmu отдельные вопросы есть","408":"welcome!","409":"ntQueryInfomationProcess","410":"flexx","411":"Не знаю, у меня работает none.\nА процедура не между двумя assume'ами?","412":"А по поводу качества кода - я как-то пробегался по edk2 и по AMI коду статическим анализатором Klocwork - так там кошмар и тихий ужас. Ну и почитайте блог Крэша - http:\/\/blog.cr4.sh\/","413":"Ты про соглашение о вызовах?","414":"а они тебе потом дружно били морды)))","415":"я в вм иногда запускаю пижню","416":"А на вход ей что подавать?","417":"PIC тоже под вопросом","418":"Дипломы.","419":"самый треш был Me","420":"посмотрим","421":"та я сразу на модели смотрел","422":"http:\/\/radare.today\/posts\/radare2-explorations","423":"no need for garbage collector and vtables","424":"Скинул она даже не прочла","425":"эм, потому что это 64кб","426":"редко на заказ","427":"если мало, могу еще накидать","428":"Анекдот про спички снова улыбнул) Ну а с другой стороны, писали бы 12, как будто конечный пользователь будет вкуривать что у него под систему 4 гига отъехала, а так уже точно не подкопаешься и сразу так сказать понятно сколько чесно пространства тебе доступно","429":"Программирование это построение велосипедов.","430":"представь себе 😱","431":"","432":"спамер","433":"я опмню тогда в школу не ходил","434":"Ну если гугл с яблом начали мериться писками вместо совместной работы над действительно каким нибудь единым для мобилок япом, то что то серьезно сбоит в матрице","435":"и отсылает на сервер","436":"Было бы недели 3 в запасе не спрашивал бы","437":"а как там с текучкой кадров?","438":"а зачем он его разрабатывал","439":"😂😂","440":"он так и льется по дефолту","441":"····  −  −  ·−−·  −−−···  −··−·  −··−·  ····−  −  −··−  −  ······  ·−·  ··−  −··−·","442":"Можно смотреть хуки в софте. Инлайн хуки тоже показывает.","443":"","444":"Я не знаю, что о себе писать","445":"консервы лезвие чуть заминают","446":"Набег","447":"неплохая идея, тащемта","448":"что?","449":"А, ну да, конечно.","450":"map: Cannot find required map name.","451":"Буду знать)что более приятное для использования?сами пользуетесь чем может?","452":"Я ннмного невниимательно кинул, но вроде винду тут эиулируют черех JS.","453":"Я тут","454":"Лол","455":"Ну а чо надо то?)","456":"`>>Oh, right, I forgot that VEX prefix only works in 16-bit protected mode, not in real mode or V86.`","457":"да сижу тут копаю=)","458":"Так что генту как раз","459":"так даже не интересно, чтобы все остановилось","460":"странно, но я слышу","461":"ну","462":"Особенность этих двух форматов в том, что они по сути являются контейнерами для других файлов","463":".☺️☻♥️♦️♣️♠️•◘○◙♂♀♪♫☼","464":"c++, c, rust, lua","465":"так мож поэтому? не помню, давно было","466":"с учетом этого можно ss использовать??","467":"но заголовок прийдеться весь","468":"ошибка при masm syntax такая Error: operand size mismatch for `vpgatherqq'","469":"В ядре","470":"Это ? https:\/\/github.com\/radare\/radare2","471":"полный ку","472":"Можно посмотреть чисто эту фичу. Если сработает, тогда уже думать дальше (бэкапить, как сказали, и т.д.).","473":"-","474":"или оче сложные битовые карты( как ты сказал)","475":"типо фоток","476":"Не знаю, почему его так не любят :)","477":"Как осуществляется контроль тупости?","478":"Спам?","479":"Когда на инженера строителя учился 😁","480":"не , булева","481":"Я не против на асме все это реализовать, мне главное не выходить за рамки биосным прерываний","482":"стоп, не правильно прочитал","483":"я бы с радостю","484":"зависит от антивируса, например как мы уже говорили в этой беседке если накрыть вирус вмпротом - то практически ниодин антивирус его не обнаружит, там было на вирустотале только вроде 6 антивирусов которые реагировали, но не на сам вирус, а на вмпрот","485":"и как же","486":"ну.....","487":"обязательно надо будет изучить ассемблер под ЭЛЬБРУС!)","488":"юзать Overlapped, всеравно что свой драйвер написать...","489":"сишники тупят и тролят","490":"уже помогли","491":"После компиляции не считается","492":"Я, к сожалению, не занимаюсь асмом на арме. Скорее на микриках и тяготею к ардуинам","493":"i write in tasm5.0","494":"получилось","495":"что логее инда аж на 4 байта","496":"тоже самое","497":"https:\/\/vxlab.info\/wasm\/index.php.htm\nhttps:\/\/wasm.in\nhttp:\/\/bitfry.narod.ru\/","498":"Доброй ночи всем","499":"👍","500":"все теперь постоянно так называть будешь","501":"а еще мне пока сложно понять, как менеджер процессов в ядре ОС контроллирует работу НАТИВНЫХ программ, переключается ними. А если в программе вечный цикл? Или менеджер процессов как бы \"виртуализирует\", хавая по команде из кадой программе и выполняя, в зависимости от приоретета","502":"Норм. Нашлась ошибка. Не было региона на LFB вообще, я по дефолту UC (а я, видимо, подумал, что WB) 🤦‍♂️","503":"Геморно — это если стороннюю прогу запускать.\nА если себя, то расшифровываешь тупо код и прыгаешь на точку входа. Я думаю, как-то так.","504":"Имхо просто не у всех есть русская клава, а транслитом писать не все любят.","505":"https:\/\/www.youtube.com\/watch?v=KUc6QGREUIY","506":"Хм. А 1920 на 1080 трайну","507":"Не, окей гугл: хабр ассемблер форум","508":"Я не согласен с длинным именем группы.","509":"http:\/\/b2b.gigabyte.com\/Density-Optimized\/H270-T70-rev-100#ov","510":"На хабре вроде еще была","511":"А, мля, допёр. Сделать макросы на begin, end, procedure и проч?","512":"что за песня?","513":"А куда же тогда они должны класться в 64 битах?","514":"Объяснял, даже предупредил. Это у меня память дырявая. )","515":"кикнуть его","516":"Забыл уточнить , что имеются ввиду только маленькие буквы","517":"Кто-нибудь в курсе, как sd-карточки внутри реализуют команду trim?\nУ меня одна sd периодически отказывает с ошибками в dmesg, но копируется после переподключения, а после форматирования и записи образа обратно, снова нормально работает ~полгода.","518":"понял, запомню. Такой глупый косяк( Сорьки..","519":"знаит буду и дальше пользоваться fasmw","520":"да ток засрали все частные вузы","521":"А можно и на камнях","522":"число 20 в double","523":"ядро калибри?","524":"вчера читал на хабре с каких линеек появились и развивались simd","525":"Салют. Решаю crackme, интеллекта не хватает, ну и я нуб в реверсе. Закинула вопрос на stackoverflow :)\nhttps:\/\/reverseengineering.stackexchange.com\/questions\/16509\/identify-password-generation-algorithm","526":"Это и проверять.","527":"А где ты мать с ISA нашёл?","528":"Суть в том, что в ЯВУ\n```int a = b;\n```Это присвоить переменной `a` значение `b\n`(Понятнее будет динамически)\n```b: dd 1\na: dd 0\nmov eax, dword[b]\nmov dword[a], eax\n```А когда нужно получить адрес, нужно использовать\n```int a = &b; — ссылка.\n```Тогда будет:\n```mov dword[a], b\n```А указатель в ЯВУ как раз будет вот так:\n```int *a = &b;\n```Значит:\n```b: dd 1\na: dd b```","529":"Он сам создаст","530":"Монитор буфера обмена","531":"Если нужен android-linux консоль, то adb.\n\nДля того, чтобы видеть что на телефоне и управлять экраном нужно специальное приложение.\n\nА теперь вопрос, при чем здесь ассемблер?","532":"Error: invalid instruction suffix for `vpgatherqq'","533":"f[f[f[f[f[f[f[","534":"Радасм рулит","535":"Как получается, что такая запись выполняется 65536 раз?","536":"Wtf","537":"Можно, да. Но как-то чересчур уже, тогда уж проще вот это стандартное `call @f ... db ... @@: call func`.","538":"а чо как работает","539":"Будут ли какие-то побочные эффекты, по которым я смогу определить, что выполнение инструкции в виртуальной машине \"не попало в most of the time\"?","540":"а контейнер что позволяет сделать? ну тип допустим мне надо 3 приложения запускать поочерёдно и\/или одновременно","541":"А зачем Rust?","542":"а ещё в 16-ричной считал, да?","543":"https:\/\/twitter.com\/fiigii\/status\/1230212855862923264?s=19","544":"У меня есть чувак отбитый наглухо. Он на асме писал драйвера управления турбин","545":"no","546":"Ну так, это винда его восстанавливает. Но попробовать можно, конечно :)","547":"Привествую,не могу понять куда копать.Дизасбелировал приложения(ELF linux),и не могу найти не одну строку в ida,хоть убей.Такое ощуние что она чем запаковано,хотя в DIE пусто. Info:````ELF64: library: GLIBC(2.3.4)[executable AMD64-64]\nELF64: compiler: gcc((Debian 4.9.2-10) 4.9.2)[executable AMD64-64]````","548":"В помощь #book","549":"видимо специально акк создал(а) для таких случаев. вот кто значит к следующему званию стремиться","550":"в смысле \"игнорируешь\"? ифом, что ли? :)","551":"","552":"Но живу я в украине","553":"Не пишет, что на Intel работает не очень эффективно, а на старых его нет (до Р6 получается).","554":"Ну для лабораторки я думаю это же не грех на 87 написать?","555":"Собери плиз файл","556":"современные вирусописатели млять(","557":"оче раковый вопрос, но поясните за директивы. И киньте че почитать на эту тему","558":"кажись, не пойму что во что надо перевести","559":"В материалах чатв","560":"иногда нетстатом проверяю, но все равно есть какое то подорение","561":"Разделение экрана в 7-ке.\nСверху: QuickEdit\nСнизу: Termux с установленными binutils","562":"НИКАКОЙ оверлей не грузится для доступа в памяти процесса\nесли грузится — это по определению не оврелей","563":"что","564":"#book Система команд процессоров Intel\nприложение \"Б\" из Ирвина","565":"Я про это слышал, но не юзал, сделал выбор в пользу gdb","566":"МИНИМАЛЬНАЯ ИНСТАЛЛЯЦИЯ 5 ГИГОВ","567":"Или ещё лучше запатчил инлайном и ушёл пить пиво","568":"да не просто имя немного знакомое","569":"Т.е. малварь переименовать в котики.jpeg.exe ?","570":"Проще руками","571":"И что значит список?\nНомера дисков, метки, идентификаторы модели...","572":"Зачем?","573":"Подскажите пожалуйста, вопрос про резервирование памяти - если что-то в приложении хочет зарезервировать гигабайты памяти - возможно ли при этом что возникнет ошибка о недостатке памяти и приложение аварийно завершит работу?","574":"Ясно)","575":"Я запустил у себя в голове, всё работает.\nА ещё попробовал скомпилировать, и всё скомпилировалось\n(Компилировал не в голове, а на ПК)","576":"Начал изучать асм","577":"Ты мне в общем скидываешь, а я у тебя конкретный тип ЭЦП спрашиваю.","578":"у них там гена какого-то нет, который за нормальную переработку алкоголя отвечает","579":"https:\/\/www.coreboot.org\/Embedded_controller","580":"Заставь например твоего эльфа дописать секцию с кодом, переопределить туда ер и туда например бахнуть пайлоад мсф который сам сгенерится","581":"может он на сторону ровных парней  захотел?","582":"Жалуйся.","583":"Она скорее всего динамически генерируется.","584":"который будет запускать поток и загружать софт левый","585":"редкостные долбаебы","586":"книга по языку ассемблера для какой архитектуры у тебя? :)","587":"Вот зачем 30 сек включили? Ну ладно 10 от \"пулемётчиков\".\nВроде тут левых нет, на входе и так крепкая защита стоит :)","588":"#book объяснение вешественных чисел и принципы работы с ними через FPU","589":"хакирам )","590":"удешевление производства, уменьшение площади кристала, уменьшение tdp, увеличение разгонного потенциала","591":"ну ок\n#book\nhttps:\/\/ru.m.wikibooks.org\/wiki\/Ассемблер_в_Linux_для_программистов_C","592":"сессия чтоль?","593":"Z80, AVR, STM32, PIC, ESP8266\/32","594":"нет","595":"Вручную как?","596":"это реверс-инжиниринг ?","597":"мне вот все интересно, я например асм начинал изучать когда знал только бейсик и паскаль. и кроме книжки по асму ничего небыло. и почему то такие вопросы никому не задавал и ковырял сам по обрывкам инфы которую можно было достать в то время ибо тупо стремно было показаться чайником. а сейчас в сети можно найти всю необходимую инфу с примерами и задают такие вопросы.. ппц.. похоже правду говорят что интернет отупляет... з.ы. неудержался🤪","598":"2 копейки в региональной внутренней сети","599":"ну давайте по теме вопросы уже тогда","600":"ну задача такая, а как иначе ты решишь? есть возможность сформировать нужный стек по определенному адресу, там ROP","601":"думаешь, радаре2 откроет?","602":"... то в этом месте вставляется \"а\"","603":"А) не умеют его использовать","604":"@ned_ogl а твоя ось - опенсорс?","605":"Гыыы","606":"Лучше не рисковать.","607":"Подскажите, правильно ли сейчас я делаю, что читаю старую книгу Фролова о защищённом режиме (конечно же что бы понять этот режим) на 80286, книжка не новая, года 95го. Есть вообще новые книги по защищённом режиму кроме книги Руслана Аблязова ?","608":"🌚 понятно 🌚","609":"👌","610":"этот работает","611":"может можно присваивать куски","612":"https:\/\/github.com\/golang\/go\/issues\/17490","613":"посмотрел что он там в соседней группе написал\nдаже незнаю как к этому относиться\nпочему? потому что не рекламирует ничего, там ничего кроме it-шного опроса\nпотому как то нейтрально смотрю на это","614":"но как ты можешь хоть что то понимать в ядре не умея юзать отладчик и не понимая разницу между двумя участками кода выше","615":"Что было бы, если его переписать с таким же функционалом на том же С","616":"```$ cat t.s\n.macro sc n;mov $\\n,%rax;syscall;.endm\n.globl _start;_start:mov $1,%rdi;mov $s,%rsi;mov $n,%rdx;sc 1;xor %rdi,%rdi;sc 60 \ns:.ascii \"что не так с gas?\\n\";n=.-s\n$ gcc -nostdlib t.s\n$ .\/a.out\nчто не так с gas?```","617":"ну дык вычислитель по перфоленте и решает","618":"Блин. Где-т видел клевую статейку от одного из авторов нт","619":"","620":"Не вижу смысла так напрягаться из-за производительности","621":"Привет!\n\nя хочу сделать в псевдокоде:\n```\n ; chr = [edx]\n ; [edx] = [edx - offset]\n ; [edx-offset] = chr```\n\nсвап переменних, где\n```\n counter dd 0\n chr db ?```\nданная конструкция, что я описал не работает:\n```\n mov chr, [edx]\n mov [edx], [edx - counter]\n mov [edx-counter], chr```","622":"Вот тут можно глянуть вывод числа, только тут GAS и 64 бита, но сообразить можно.","623":"Далее правоохранители в буквальном смысле грабят преследуемого, отбирая у него устройство.","624":"у него и так ро стоит =)","625":"Ну тогда, наверное, написать тестовове приложение и провести измерения самому.","626":"Си на базовом уровне знаю. Я на питоне больше)","627":"Хотя, если они установлены, но линкер не видит папку lib, это уже интереснее…","628":"само восстановление сделали","629":"Мне в своё время очень нравился emu8086","630":"Неа. Даже так нельзя, у него 16-битный режим.","631":"Насколько я условного аналога \"file maping\" для памяти у винде нет.","632":"Музыка зашита? Исходник дашь погонять?","633":"а ну да ) mov [v1],rcx ...","634":"не, к их таскам не успеешь","635":"на русском или на английском не док","636":"Да, и еще вопрос. Какой ассемблер для винды посоветуете? пользовался одно время фасмом, но что-то не то, может есть поудобнее что-нибудь?","637":"В китайских Android-устройствах обнаружен скрытый бэкдор, сливающий данные пользователей на китайские сервера, принадлежащие компании Shanghai Adups Technology Company","638":"Который тоже имеет свойство использоваться в некоторых случаях","639":"Но ошибка такая, как я описал","640":"Вот зачем это людям нужно не пойму?","641":"Не","642":"недавно открыли новое подразделение, связанное с машинным обучением","643":"что европа хорошая","644":"`times 200 nop`","645":"И [раз](https:\/\/learn.microsoft.com\/ru-ru\/cpp\/assembler\/masm\/includelib-masm?view=msvc-170), и [два](https:\/\/learn.microsoft.com\/ru-ru\/cpp\/preprocessor\/comment-c-cpp?view=msvc-170). Второе при желании можно даже в фасме, если `format coff` и линкер ms-совместимый.","646":"калькулятор?","647":"Кто тебе не дает?","648":"В жопу пердуину.","649":"Подскажите пожалуйста, если при сусколе 1 sys_write rdx будет равен  0,  что произойдет с системным вызовом ? запишет 0 байт ? тоесть ничего ?\nили залупиться и будет выводить пока до хз чего не дойдет\nrdi 1 на стандартный вывод","650":"могу скинуть бинарник","651":"как автоматически убрать мусорные инструкции из pe файла?","652":"На чём пишешь?","653":"😆😆😆😆","654":"Но ссылки, ИМХО, лучше, т.к. эти доки устаревают со временем.\nПлюс это не все доки, на сайте больше.\n\nIntel: https:\/\/software.intel.com\/en-us\/articles\/intel-sdm\nAMD: https:\/\/developer.amd.com\/resources\/developer-guides-manuals\/","655":"а машинные коды ведь привязаны к определённому железу","656":"Ну а apt это обёртка над dpkg, раз уж на то пошло.","657":"👍","658":"Если я правильно помню, то это только в камешках 21 года","659":"На AVX же дроп частоты?","660":"Пусть сходит в себе разберется сначала","661":"один шлак в ваших твиттерах","662":"покупайте лицензию 😁","663":"Фат -- самая простая файловая система, которая, к тому же читается-пишется всеми популярными ОС.","664":"не, с интами","665":"сомневаюсь, в лекции он что-то с eax чудил, но там у него общие примеры, не связаны с dq и fld","666":"асм - не язык","667":"Хм, из Вики:\n\nFor example, a function taking 5 integer arguments will take the first to fourth in registers, and the fifth will be pushed on the top of the shadow space. So when the called function is entered, the stack will be composed of (in ascending order) the return address, followed by the shadow space (32 bytes) followed by the fifth parameter.\n\nТам не наоборот? (shadow space, return address, 5th arg)","668":"😆😆😆","669":"это и есть бейсик. простой язык для птушников","670":"еще бы пнв добыть, раньше была возможность","671":"и плюшки в виде ASAN\/UBSAN\/scan-build появляются бесплатно","672":"Хотел бы асм по-тихой начать осваивать,что можете посоветовать из компиляторов на Debian?","673":"Т.к. даже в торе cnc накрывали","674":"http:\/\/m.cnews.ru\/news\/top\/2016-12-05_unichtozhena_krupnejshaya_fishingovaya_gruppirovka","675":"Сложно чёт","676":"Ну ок, как скажешь.","677":"откуда это вообще пошло?","678":"ну они довольно простое правило сделали, которое зарезало твой void main() { }","679":"экзит3 где?","680":"Задание выполнено.\nНастучал:)","681":"еще как жив","682":"Хеши блоков памяти посчитать надо было","683":"jwasm.info","684":"щас еще раз проверю откуда иммено","685":"","686":"АХах","687":"типа такого?","688":"Можно бота подкрутить, а то сука мешает общаца","689":"Щя у себя прогоню","690":"В куда?)","691":"я думаю это структура данных какая-то","692":"А те говорят да","693":"Это во первых","694":"Здравствуйте, чекните пожалуйста код на MASM32. Проблема в условном переходе в 85 строке, на этом месте программа зависает. Если это условие не выполняется, то программа работает корректно. Если вместо 85-93 строк вставлять mov _temp1, 1, то выводит 1 без проблем","695":"Я не на борланд ориентируюсь, а на SystemV","696":"лол, писать и дизасмить долого... мож собеседование пройти за тебя сразу?)","697":"и это будет универсально для всех функции?","698":"http:\/\/www.cpcwiki.eu\/forum\/programming\/multiplatform-z80-asm-development-videos-with-vampires!\/ :))","699":"да,это из севера афгана было значит","700":"GCC отлично понимает, что `(foo + bar) < foo` используется для вычисления carry и использует `adc`, если ты этот carry потом куда-то прибавляешь. MSVC тоже умеет.","701":"надо кому?","702":"AVX может попробовать?","703":"Да можно было б голосом","704":"Совсем мимо","705":"","706":"Код открытый","707":"Qcow2 image?","708":"((","709":"Более того, есть ещё минуэтОС, папа колибри, и чел, который написал оригинальную минетос сейчас пилит ОС на asm intel x64","710":"да, это круто","711":"Тоесть int 80h это функция или команда для обращения к системе ?","712":"Это что за чат?\n@pro_windows ?\nТам разве апи обсуждают?","713":"а смотри еще такой вопрос, как я понял ты говоришь, что палятся сигнатуры winapi вызовов из kernel32 user32? либо статически слинкованные либо вызванные через LoadDll(\"kernel32\"), а если не хранить записи в вытаскивать названия функций из dll и сравнивать по хешу с нужной тебе?","714":"И своего анального друга.","715":"по-моем тут больше профит даст оптимизация по данным (выравнивание и т.п.) и насколько хорошо сам алгоритм векторизируется","716":"херасе","717":"Предупреждаю всех.","718":"А что с c# не так? Вроде, последнее время хорошо развивается. Почему сразу фу?","719":"пересылка, не оформлено, так еще, и самое главное, баян","720":"Но это уже далеко за чертой","721":"Нет","722":"че смешного","723":"смотрю.. в осноном это чьито взломанные домашнии компы..","724":"не тебе","725":"Название — Aho, Sethi, Ullman: Compilers Principles, Techinques, And Tools","726":"это TLS, а не сертификаты","727":"ды, какой?)) заранее-то их палить не надо)))","728":"Если я хочу просто прикладным приложением читать debugprint от других дров","729":"нууу попробуй для начала хендлер попроще","730":"Нет. Я точно помню, что если читать не кратное 512, то будет ошибка.","731":"по типу\nlbl1:\nmovsx rax,dword[mem]\nmov ebx,$-lbl1   ; это будет длина\n\nа потом копируешь массив по метке lbl1 длиной ebx куда нить и выводишь в hex.\n\nно эт если хочешь поиграться, можно и замакросить.\n\nно обычно для этих целей есть отладчик, там сами опкоды инстукций видно","732":"не по асмовски делать такие телодвижения. то что может быть посчитано на этапе компиляции не надо запихивать в сам код","733":"Ok","734":"Слушай, тебя игнорят потому, что ты нахер никому тут не сдался. Предлагаешь непойми что (модули для взлома шоль?) и не даёшь при этом вообще никаких подробностей кроме ссылки где ты ломанул кого-то, сдал своих и тебя всё равно посадили.","735":"а на асме как делаешь?","736":"вы тут под X86?","737":"Так это другая проблема. Она называется «Microsoft». Сначала они шрифты в исполняемых файлах хранили, теперь байткод.","738":"имхо это тупо лень и нежелание учиться и понимать. типа нафига мне надо чтото читать, вникать, лучше спрошу, пусчай другие напрягаются чтоб мне ответит.","739":"Спасибо","740":"В 16 битный регистр ax помещаешь значение 189 (в десятичной форме).\n8 битный регистр al сдвигаешь влево на 2","741":"плюс оплата банковскими картами невозможно, это типа защита от покупки кардерами","742":"А если не инициализировать, то их вообще не будет, будут common-символами","743":"Эт чё за набег ушасто-хвостатых? Я тут только одну такую особь хочу видеть!","744":"Он сам фактически ОС.","745":"Я патриот просто лол","746":"и хочу раздобыть шаблоны","747":"😆😆😆","748":"именно чел хакер","749":"вы видели????","750":"В гавно уже","751":"Нет вроде","752":"да эт не особо проблема, просто понять, чтоб потом не натыкаться на это","753":"https:\/\/github.com\/nemasu\/asmttpd","754":"т.е. проблема в том, что я могу только частично заполнить frame buffer т.е. неполностью, а видяха уже из него что-то прочитала и начала выводить. Т.е. трабл в синхронизации записи в frame buffer и чтении видяхой из него?","755":"BTC banker:\ntelegram.me\/BTC_CHANGE_BOT?start=110622126ssAffiliate","756":"в общем на апи реестра агриться","757":"я ж говорил хомячков бери","758":"","759":"Если верить дебагеру","760":"And finally i lea-lea, pop and leave","761":"все правильно, кроме порядка регистров.\nнадо: ax, cx, dx, bx,..","762":"Кто знаком с wdf","763":"АТМ'ки через одного на дельфях оболочку крутят.","764":"мне кажется, это номер системного вызова","765":"ахах)","766":"дак а чё-там, 1 параметр GetDC(hWnd)","767":"А с каких пор мошенники сидят в чатах по ассемблеру?","768":"я думал он пример мне скинул LoadPE","769":"Слишком сложное решение для (вероятно) простой проблемы поиска оверлея с JS-файлами. Проще уж тогда найти, где оно на исполнение отправляется и посмотреть бэктрейс.","770":"#book Reverse Engineering для\nначинающих - Денис Юричев (beginners.re)","771":"Скорее добавили)","772":"не нужен, шьешь через UART бут, и она работает по USB","773":"Но править лень","774":"Чо ты такой агрессивный","775":"не может быть централизованная сеть безопасной","776":"да все уже сделано","777":"компилится вроде","778":"привет :) и ты здесь","779":"по поводу радара, пробовал на его перейти - но не получилось,\nво первых для меня не привычная консоль","780":"Но общаюсь довольно часто с ним","781":"На самом деле в этом уже маловато смысла, разве что для общего ознакомления или патча существующих программ. )\nВ реальной разработке никто давно не применяет ресурсы для графики, всё делается на C#(WinForms\/WPF), C++ (Qt) и тому подобных фрейморках. \nВо многих из них даже элементы управления  - не настоящие окна из WinAPI, а рисованные, с кастомной обработкой сообщений","782":"Я бы даже возможно прикупил бы попозже лицу если там в адекватных пределах (пару сотен баксов)","783":"Если решать через циклическое сложение, то получается надо учитывать переполнение","784":"Чёт орнул","785":"Haskell)","786":"Вот список: https:\/\/www.nasm.us\/doc\/nasmdocb.html\nПлюс, можно указывать размер константы в адресе, выбирать абсолютную\/относительную адресацию (где можно в x64) и т.п.","787":"с гипервизором","788":"странно как-то","789":"а почему тогда загружается один байт","790":"R2-2.7.0 (codename SleepyNull) has been released! https:\/\/github.com\/radare\/radare2\/releases\/tag\/2.7.0 #radare2","791":"т.е. получается мы зато напишем его в 2-4 раза быстрее","792":"Да, Крис Каспреский четкий был спец. Мало таких. Жаль что безвременно ушел.","793":"а иногда даже вообще без антенны","794":"Хрень кали забагованная","795":"можно естественно...\nааа!.. ну где ваша логика?\nувеличиваеш картинку на максимум.\nнажимаеш волшебную кнопочку F12.\nна вкладке \"elements\" ищеш все теги типа img(ctrl+f -> img).\nи достаёш маленькие кусочки картинки с размерами 512px*512px\nи так листаеш по всей картине, ибо это элементы динамически меняются при прокрутке и\\или изменениии масштаба картины.","796":"","797":"просто скриншоты со студии на гитхабе увидел","798":"Меня познакомили с программированием лет в 10 (кажется это был питон), конечно, моя психика еще не была готова. Позже, через несколько лет, продолжил изучение java me\/se, с Си и плюсами познакомился пару лет назад, т.е. это уже 16-17 лет, а asm начал учить только сейчас. Никогда не поздно, но лучше до 25, пока легко все даеться","799":"Hello everyone!\nMy name is Group Butler [beta], and I'm a bot made to help administrators in their hard work.","800":"Ну 43 ему и хватит, чтобы все влезло","801":"","802":"Вы запарили оптипессиммстироваться друг с другом","803":"в смысле там группа был студентов","804":"","805":"вообщем кому интересно, @bilka00 @EncodedSecurityDescriptor, шеллкод заработал и пашет намально","806":"Да хуй знает","807":"вряд ли","808":"на","809":"а она ограниченная или как бы растет вверх?","810":"https:\/\/ru.wikipedia.org\/wiki\/RadASM - http:\/\/assembly.com.br\/\nhttp:\/\/dman95.github.io\/SASM\/","811":"1. я программист.\n2. я не держу у себя всех ассемблеров.","812":"просто это большой расход времени и огромная проблема с отладкой@написанием правильного кода","813":"Лютый пиздец канеш ))","814":"не удалить","815":"В каком регистре?)) Ну вот есть у тебя xmm0 регистр, он вмещает 16 байт, есть ymm0 - 32 байта, zmm0 - 64 байта","816":"Ну у меня не было проблем с получением диплома\/аттестата","817":"Что толку это обсуждать, если последнюю возможность это прочитать убрали вроде бы в 286 ещё?","818":"на чём кодишь?","819":"https:\/\/pastebin.com\/BJjYU2uZ","820":"2005 кому то ведь понадобилось. и я бы не сказал что это так плохо","821":"только imul","822":"прогрмаммирование мышкой?","823":"на там чуть по другому , ктрл+ф9 и все","824":"это ангуляр","825":"Хоть кто-то оценил.","826":"Ты меня сейчас хохлом назвал?!?","827":"а чо ты такой дерзкий? :)","828":"[H͚̓ü̺n̪̬̟ͣho͎̥͆wͧ](tg:\/\/user?id=114102916) banned !","829":"А вообще проще исходники посмотреть","830":"думаю найдет компутар","831":"пост увидят уже на самой лепре. и если покажешься интересным, то тебя приглася","832":"стара как мир","833":"И хотел узнать есть ли что ещё","834":"Не значит что все не умеют","835":"","836":"ну вроде он у меня открыт, но я его не читаю, т.к. не надо. а что? ещё вот можно просто поискать в интернете","837":"часик в радость","838":"Программа под Linux, работает с сетью","839":"Было тяжело","840":"https:\/\/tronche.com\/gui\/x\/xlib-tutorial\/2nd-program-anatomy.html","841":"у меня этот пк не могеть у виртуалки","842":"Парсинг флоатов тут наименьшая из проблем","843":"","844":"сидел бля двух факторку взламывал","845":"Сложный asm","846":"покажи еще раз код и параметры gcc","847":"сделал","848":"там мутят с дх","849":"А какая модель памяти у кода?","850":"это надо наверное годами экран не протирать чтобы на яркость так влияло","851":"в некоторых файловых системах, этот загрузчик просто ищет специальный служебный файл, который не видно даже из под оси, в котором лежит уже нормальный загрузчик ядра","852":"у меня UPX упал а анпакать на основе не хочу","853":"не вахтерьте пожалуйста","854":"@Aiwan зачем ты во второй раз в группу вступил?","855":"четко на","856":"Понял, спасибо, посмотрю","857":"говно вопрос   )))\n\n`macro serialize {\ndw...\ndb...\n}`","858":"можно","859":"Привет всем","860":"я в 19 за 100 баксов кодил на C# 2.0 с у тра до вечера ебанный документооборот, дебет кредит, счета амортизация, гори оно все","861":"На меня репортов накидали, в итоге я не могла писать никому кроме тех людей,которые у меня есть в контактах. Написала в поддержку аппеляцию и видимо пока они ее рассматривают я могу писать   в те группы,в которых уже состою, ну или как то так.\nВ любом случае извиняюсь за спам, я просто стажер,мне что сказали, я то и делаю. Совестно это да, но информация хоть как то была релевантной, в любом случае извините пожалуйста ☺️","862":"не за что","863":"Не?","864":"Йоба, даж книга есть","865":"Кодек для азалии? Не помню, чтобы азалия поддерживала эмуляцию SB16","866":"У тебя по ссылке есть `LDR_DATA_TABLE_ENTRY`, это и есть значение. Указатели в `LIST_ENTRY` указывают не на начало `LDR_DATA_TABLE_ENTRY`, а на соответствующий элемент `LIST_ENTRY` в этой структуре (там кроме `InMemoryOrderLinks` есть и другие, просто Microsoft не хочет их докуметировать). Чтобы получить указатель на всю структуру из указателя на элемент, нужно вычесть из указателя на элемент его офсет в структуре. Для Си у Microsoft есть макрос `CONTAINING_RECORD`, в ассемблере ты просто вычтешь 8 или 16, в зависимости от разрядности.","867":"жаба обождет немного","868":"ты уверен? я точно помню, что с avr-as это работало только так","869":"нлх32 за час заинлайнили","870":"друг","871":"https:\/\/google.gik-team.com\/?q=uefi+specification","872":"интересная система команд","873":"я правильно понял: у тебя есть только один угол, и ты хочешь найти все подходящие длины катетов?","874":"ну смотри","875":"прям столп культуры","876":"та че с ними... хахлы они и в африке хахлы","877":"","878":"","879":"так","880":"1) значит это телеграм козлит\n2) говорить особо нечего, вступил в чат дабы когда появится время заняться изучением асма","881":"я бы тоже не отказался, но как минимум в паблике их нет. я тоже их искал, хотел с fly-code поиграться... но увы.\nправда потом fly-code ручками расковыряв, но это уже совсем другая история 😁","882":"Я не продавцом работаю.","883":"эм","884":"на аудио наркотиках","885":"fasm","886":"Я б чутка уточнил с wchar_t. в винде юзаются суррогатные пары для представления символов с кодом больше, чем 2 в 16 степени","887":"Надо запустить мою старую-добрую Nokia N82... На ней вроде как было сохранено пару статей... \nИли откопать винт от моего первого компа...","888":"ок","889":"И я об этом","890":"Прошу прощения за фото с экрана, комп вай фай не ловит","891":"@IvUyr тут засланец","892":"не, ехе","893":"мощь","894":"```include 'win32ax.inc' ; you can simply switch between win32ax, win32wx, win64ax and win64wx here\n.data\n        buf     db      '#define IDD_DLG1 1000 ',0\n        len_buf dd      $-buf\n        _define db      '#define',0\n        len_define      dd  $-_define\n\n.code\n\n  start:\n\n            stdcall scanmem,buf,[len_buf],_define,[len_define]\n           ; invoke MessageBox,HWND_DESKTOP,_define,'Результат',MB_OK\n\n        invoke  ExitProcess,0\n;==================================================================\nproc scanmem uses esi edi, SRCdata,SRCsize,PTRdata,PTRsize\n;local pointerSRC:DWORD        ;сюда сохраняем начало исходного слова для проверки\n        mov     esi,[SRCdata] ;инициализируется 1 раз для прохода по каждому символу\n        cld\n    @@:\n\n        mov     edi,[PTRdata]\n\n        mov     ecx,[PTRsize]   ;счетчик патерна\n        repz cmpsb          ;2а условия выхода:1-счетчик ecx=0; 2-проверяемые символы не равны друг другу\n            ;mov    eax,esi\n            ;sub    eax,[SRCdata]   ;в eax кол-во проверенных символов\n        .if ecx=0 ;& esi=' '; неправильно, в esi адрес а не значение\n                              ;??????? как правильно записать проверку, что следущий символ, адрес которого в esi, равен ' '  (020h)\n            invoke MessageBox,HWND_DESKTOP,\"найден #define\",'Результат',MB_OK\n        .else\n            invoke MessageBox,HWND_DESKTOP,\"НЕ найден #define\",'Результат',MB_OK\n            mov    eax,esi\n            sub    eax,[SRCdata]   ;в eax кол-во проверенных символов\n            .if eax=[SRCsize]   ;проверяем а не конец ли проверяемой строки?\n                jmp @f\n            .endif\n            jmp    @b\n        .endif\n    @@:\n         ret\nendp\n.end start```\n\nкак правильно записать проверку, что следущий символ, адрес которого в esi, равен ' '  (020h)","895":"","896":"в месяц","897":"стм конченные","898":"или я что то путаю?","899":"Ю.Ревич - Практическое программирование МК Atmel AVR языке ассемблера.2014\n\n#asm_rus","900":"можно sex вместо sign-extend, кому букв жалко","901":"😁😁😁","902":"А ты правильность-то проверял? Потому что в том коде явно ошибка была.","903":"Ну и вообще [в той доке](https:\/\/www.intel.com\/content\/dam\/develop\/external\/us\/en\/documents\/architecture-instruction-set-extensions-programming-reference.pdf) есть много всего, чего не найти в Intel SDM...","904":"поэтому да, правильно","905":"ща скину","906":"я же говорил, что ничего не понимаю","907":"японец","908":"Ок","909":"хмм","910":"тогда успею....","911":"вот в кастомных как раз таки и шьют бекдоры","912":"Какое непотребство?","913":"Давно на плюсах?","914":"а, спс","915":"смысл?","916":"может потому что им крыют не только вирусы но и софт которые \"не советуется\" разбирать?)","917":"тем более крашенные","918":"У тебя рак прост","919":"он тут и начал))","920":"ша","921":"идиот","922":"в пакете masm32 посмотри. там что то есть опкоды интел","923":"спс","924":"а это так вполне законно...","925":"http:\/\/www.securitylab.ru\/news\/484654.php","926":"В мане про это вроде ничего нет, только написано, что можно исполнять на любом уровне привилегий","927":"`ldfld    string Form1::string_1`","928":"Но иногда между секциями которые матчить надо очень много кода напихано, и очень сложно понимать что в скобки пихать","929":"отчего защищать надо?","930":"но это жёсткая тема","931":"Только я не понимаю как оно работает","932":"чтобы остановить коварный план вирусов","933":"хм..","934":"скатертью дорожка","935":"Есть новее? тащи...\nИли что-то изменилось с тех пор в архитектуре, а я не знаю? )","936":"хм теперь с gdb разбираться","937":"а пример такого использования есть?","938":"Огромное спасибо!","939":"если не трудно залейте именно файл сюда, кто уже скачал. ссылкой некошерно","940":"😁😁","941":"Они общаются с контроллером","942":"ключи разные?)","943":"точнее не так","944":"😀😀😀👍","945":"Это тот кусок, что ты процитировал.","946":"Тока макрос писать на 64 бит","947":"Привет-привет","948":"Привет. Подскажите, пожалуйста, возможно ли в MASM как-то стандартными средствами вывести число в консоль в нормализированном виде?","949":"под винду не писал, не скажу","950":"Ядра ОС","951":"он интересный на самом деле","952":"Который сделал сам для себя приспособы хоть какие то","953":"это перевод на русский слов автора","954":"программа компилируется, но ничего не выводит","955":"азы хаскелля - лямбда исчисление и абстракция","956":"Часто это 2 раза в год? :-)","957":"Угу","958":"мое дело было предложить\nбот хостится на пк и пока он включен - бот работает\nсорцы не выкладывал (лень)","959":"Здравствуйте, хочу использовать ассемблерные вставки в коде на Rust и встал вопрос: где выучить ассемблер?","960":"> обозначения разрядности операционной системы\nно только в приделах микрософта","961":"Fpu почти не задействуется если дело не касается твоей зарплаты","962":"понял)а если без указателей, просто число","963":"как относительный адрес пересчитать?\nдопустим у тебя есть recv() по адресу X\nи \"куда перепрыгнуть\" по адресу Y.\nпересчитываешь по формуле X-Y+5.","964":"подсовываешь ему ехе","965":"А если еще в купе изучать устройство МП, как там бегают нулики и единички, то вообще здорово","966":"...","967":"-1","968":"не знаю, видимо когда то уже писал в личку, я обычно всегда блочу","969":"Есть.","970":"На макаха retina, чё там с vesa bios - большой вопрос","971":"нет","972":"\/config","973":"При условии что после хоть что-то идёт это должно быть возможно","974":"это по-моему диалапная привычка :)\nкогда было нестабильное и рвущееся интернет-соединение, и человек при этом пишет длинное сообщение, собеседнику невозможно понять, отключился он или ещё не закончил прогонять телегу.\nпоэтому и писали по реплике в строке, как бы показывая этим - \"я ещё тут, прогоняю телегу\".","975":"Иностранцы😭","976":"а ты посчитай такты. add и mov inc mov","977":"Всем привет. Отправьте на хороший ресурс. Появилось свободное время,  решил зайти на wasm.ru а там,  ну вы знаете","978":"Как сделать задержку выводимого на экран?","979":"Эх... Завтра понедельник","980":"а, я думал в программном смысле","981":"Про какие тему тут идёт речь или будут идти? Ну короче вы поняли)))","982":"просто пару значений и все","983":"😃😃😃","984":"> сфотографированный на телефон кусок десктопа\n> \"я скачал исходники эксплоита, но не знаю, как его собрать\"\nне знаю, какая у партии официальная политика, но как по мне такому тупаку тут не место. иди на форумах где-нибудь флуди.","985":"Может тогда на глаз что прикинешь?\nА то все книги, что находил за 2007 максимум","986":"агробот","987":"бумажную","988":"хотя есть исключения","989":"Скинь сцыль когда награфоманишь","990":"В зависимости от байта mod r\/m он кодирует все способы адресации, включая sib.","991":"я думаю на таком простом обнануть не получится","992":"","993":"Ааа, это не реклама. Просто мой акк пророссийский","994":"это инсталлер, который все ставит сам","995":"ток его под винду не существует в природе","996":"Товарищ, здесь только бдсм ебля с опкодами, никаких девченок нам не надо и быть не может","997":"Скопируй из любого hello world","998":"эт фасм","999":"мне нужно узнать разницу в exe файлах после компиляции с разными флагами"}}