{"text":{"0":"гуглить пробовал?))))","1":"Скорее glew, но типа над этими двумя либами","2":"по идее да же","3":"Смысл не в использовании, смысл в работоспособность в msvs","4":"сортировка слабое место, обращений к памяти больше чем прочитать 1 раз всю память","5":"в смысле","6":"Преждевременная оптимизация зло. Не так ли?","7":"Т.е. короче говоря знаковость целых чисел это ещё одна абстракция, получаемая при помощи знаковых и беззнаковых операций над ними.","8":"Но этовсе равно не те таймеры, что на микроконтроллере, даже если на ядро RT патчи наложить настоящей хардкорной реалтаймовости не будеть, только мягкая","9":"Боль","10":"Создаёшь базовую структурку которую помещаешь сверху и кастишь в неё","11":"","12":"в С++ это давняя проблема","13":"Точка с запятой относится к строке, а не к ифу","14":"Компиляторы могут оптимизировать рекурсию, превратив её в цикл? Буду знать","15":"Умные дядьки обычно обьясняют почему","16":"лол. Не завидую твоим коллегам, если они когда-нибудь у тебя будут","17":"эффективность в чем?  для меня эффективность - это не отвлекаясь на редактор начать какой то проект, а не тратить на это время на изучение одного только редактора. есть даже мем про вим - толстый многостраничный том о том как им пользоваться)","18":"Ну на слова надо разбивать текст, да.","19":"Ну у можно и так foo(char *p)","20":"@Ternvein Можешь подсказать пожалуйста?","21":"в Modern C ещё такое написано:\n\nThere are two sorts of names that may interact badly with macros that another programmer writes and which you might not think of immediately:\n\n  - Member names of `struct` and `union`\n  - Parameter names in function interfaces.\n\nThe first point is the reason why the members in standard structures usually have a prefix to their names: `struct timespec` has `tv_sec` as a member name, because an uneducated user might declare a macro `sec` that would interfere in unpredictable way when including `time.h`.\n\nв общем, сейчас это защита от дурака","22":"Пишут на плюсах,но пишут обычно только математическую часть,например алгоритмы оптимизации или для методов обратного распространения ошибок. На картинке tensorflow","23":"Есть реентерантная версия strtok","24":"Не видно ничего","25":"помершел лучше ваших башей","26":"справкк показать?","27":"и вот это верно\nно не вижу противоречий с тем что я написал выше.\n\nа именно \"Значение переменной array является адресом первого элемента массива.\"\nоно ж преобразуется автоматически, значит по другому просто быть не может","28":"компилировать пробовали?","29":"и почему у меня варнинг:\n```   Suspicious usage of 'sizeof(A*)'; pointer to aggregate```","30":"кто пишет","31":"Ну и получается мало мальски заполненная структура будет чуть больше указателя, в большинстве случаев.","32":"мужики, инпут char '2' он равен 50 в decimal, а в бинарной 110010\n\nнужно вывести обратное бинарному (010011) через бит маски и операторы. Это сложно? пока не смотрел видео про бит маски. сейчас собираюсь","33":"Ну да, это - массив указателей на массивы.","34":"Почитай Таненбаума Операционные системы","35":"Ну ютуб уже научился вставлять титры на русском","36":"У питона есть стандарт, на сайте","37":"Почему бесполезно ?\nВедь функцией isprime(n) пользуется много потоков одновременно , и внутри isprime() каждый поток захочет читать\/писать в статический массив  primes этой функции, и поэтому требуется воспользоваться read-write-lock.\nВедь суть в том , что если несколько потоков будут одновременно читать с этого массива prime элементы , в этом проблемы нет. Проблема в том , что когда я захочу изменить массив, я должен удостовериться что никто не читает с этого массива. И поэтому требуется воспользоваться read-write-lock.\n\nЕсли я говорю не правильные вещи, буду рада услышать как правильно.\n\n`rwlock_acquire_writelock(&rwlock); \/\/who is writing to array  do this in before he writes\n rwlock_release_writelock(&rwlock); \/\/close when finished to read from array\nrwlock_acquire_readlock(&rwlock); \/\/who is reading from array  do this in before he reads\nrwlock_release_readlock(&rwlock); \/\/close when finished to read from array`","38":"я в таких ситуациях все равно нахожу для себя выгоду","39":"пасиб","40":"Потому-что есть Vulkan?)","41":"да и вообще не используют","42":"убрал #include \"global.h\" ошибка.","43":"ok","44":"CalsiBot Есть два стула, на одном плюсы точены, на другом сишки дрочены. Правила — https:\/\/t.me\/lame_c\/8812","45":"Пасиба","46":"Наверн потому что я до этого юзал fgetc, да?","47":"Но если ты выйдешь за предел uint8_t, то это будет UB","48":"глава 10","49":"слоник?","50":"берешь структурку из юниона и инта под тэг","51":"Мне нужно просто точное время работы программы(не намного точнее секунд).","52":"Спасибо за советы. Теперь точно работа есть)","53":"variable length array","54":"не спрашивай откуда это в математике, я не знаю))) мб потому что \"i\" - первая буква в слове \"index\"","55":"Ок","56":"strtok все посылают далеко из-за безопасности, нет?","57":"вот","58":"можно и так, но зачем","59":"非常清楚","60":"Правда там постоянно надо делать аллокации и не забывать очищать...","61":"Го ведь и разрабатывался с упором на многопоточку и простоту","62":"127.0.0.1","63":"сравнивая например с программированием на пых, то там наоборот. Он по сути работает только со строками со всеми вытакающими. Там можно сказать всё одним предложением \"внутренняя память в пых сохраняет инт в пчар каждый в 40 байт почти\".\nТо есть по сравнию с пых верно написали. Строк в С не существует. В том виде, как обычно ищут \"работу со строками\" её не найдут, скорее всего. Я пока не нашёл.","64":"Вектор да, но это не массив. :)","65":"и потом, у вас в цикле много `malloc()` и ни одного `free()`","66":"Символ 0.","67":"Я смотрел 2 часа про массивы, но четко про передачу через указатели не ыбло разъяснено","68":"чего? это вроде сленг какойто","69":"Символа EOF нет, это правда, но такая абстракция на уровне ОС есть","70":"Крч лан пойду лучше чайку попью","71":"Для начала скажи что ты пытаешься сделатт","72":"Поэтому сделаем просто, есть Ч нет Ч","73":"Не уверен, что wchar поможет","74":"Что такое поле? Массив ячеек или что?","75":"Поставить перед закрывающей скобкой ещё одну кавычку...","76":"На тех же входных другая версия работает?","77":"И в первом и во втором случае строковый литерал лежит в rodata, во втором случае он просто ещё и копируется в стек","78":"ну и для всех кому будет интересно","79":"Ты явно не понимаешь языка си, и что такое тип данных и структура данных.\nИ не на любую память есть указатель, и не у любой памяти есть адрес.","80":"Сейчас удалю пути, кроме сланга, и попробую.","81":"","82":"продолжете- забаню","83":"Ну во-первых условие в ифе у тебя не совсем корректное, так как операторы сравнения повзращают true\/false","84":"пиздец. так ладно, щас стоит другая задача","85":"6) Не оффтопить, для оффтопа есть https:\/\/t.me\/rsa4096. Всё, что не про базовый Си — оффтоп!","86":"Все ок","87":"я согласен, что есть области где это не нужно","88":"Или указатель на структуру с полями","89":"Он каждый раз вычисляет длину строки.","90":"Да это не важно совершенно","91":"да","92":"чем строки разделяются?","93":"капец ты умный, а что произойдет когда тебе придется искать баг?","94":"Всё, что нужно для этого, есть в стандартной библиотеке Си","95":"меня с тобой спутали и назвали идиотом, ахаха","96":"Какой смысл в тернарном операторе с 1-цей в условии?\n`(1 ? always_selected : never_selected)`","97":"Мне скинули инфу по gdb.exe. Это как раз то, что мне нужно.","98":"https:\/\/habr.com\/ru\/company\/yandex\/blog\/674902\/ вроде-бы...","99":"за explanation","100":"Скоро подтянутся торгаши, покупайте у них логи. Даже на футбольные матчи есть))","101":"бывает))) проверяй значения которое возвращает scanf","102":"В Питоне можно так делать `a = 100_000_000`","103":"https:\/\/en.wikipedia.org\/wiki\/Shakespeare_Programming_Language","104":"Вообще программисты меняют Иде обычно когда им надоело прошлое","105":"как там?","106":"","107":"https:\/\/matematika-club.ru\/pyaterichnaya-sistema-schisleniya","108":"Вроде, да","109":"Дейтел Дейтел, как программировать на С","110":"Я с тобой не дружу больше(","111":"если без строки","112":"uGFX?","113":"формы","114":"Я тут делал задачу в advent of code 1st day. Нашел ответ но там пишет неправильно","115":"шуе что ли","116":"Наверно асм","117":"```__LINE__```","118":"Хотел спросить или я буду получать те же самые элементы, если буду вызвать их через указатель и через указатель на указатель, то есть или буду получать те же самые L-value ячеек памяти.","119":"(4,3+8,5+9,1+7,2+7,6)\/5 = 7,34","120":"есть такое","121":"я часто вижу что msvc хейтят или подшучивают, почему?","122":"Из войда же потом можно сделать например int","123":"Попробуй просто функции разные для тренировки писать.","124":"Дескрипторы пайпа надо открывать в самом началае?\nПри создании они не открыты?","125":"Например если реализовать пользовательский ввод  первого массива и он введён больше чисел чем я задал в голове","126":"большое спасибо","127":"спс","128":"а еще говорили гит тоже будет","129":"ну тут ответ “ you have to do a good deal of work on Unix”","130":"https:\/\/t.me\/embedded_rs","131":"это фигня какая-то: установил этот гроф, дал ему файл, а он совсем ерунду печатает. чего делать то с этими файлами, чтобы они читались нормально?","132":"си для чайников?","133":"это указатель или указатель на функцию?","134":"Только высвободить не забудь тогда","135":"В книге есть такой пример), но хотел пока без него попробовать)","136":"хах","137":"Вот именно, что не эффективно","138":"А, ну для твоих задач вполне норм","139":"atoi будет работать до последнего значении не являющего десятичным символом","140":"чтобы получилось","141":"Ну на gcc и clang под ELF64 вроде не выравнивается.","142":"Ну там про пропустить пробелы было. Да fgetc норм.","143":"msvc кстати говоря не оптимизирует этот цикл, что интересно","144":"скобочка на следующей строке может банально аргументироваться тем, что пишущему нравится, когда скоупы и функции выглядят одинаково","145":"либо ... = *(float*)(...);","146":"Из-за нейминга)","147":"поправка - он использует некоторые фишки C++, но минимально (operator overloading)","148":"В данном случае значит, что буферы не должны пересекаться","149":"Когда уже знаешь можно переводить, но не перед этим, иначе будет ощущение фрустрации и бессмысленности.","150":"Какова цель?","151":"Да и ответ тут причем, если он уже понятен 😐","152":"func(x :int) ->int\n\nпри статической проверке выдаст ошибку, если передать значение другого типа, но при этом будет брать аргумент любого типа в рантайме","153":"#include <stdbool.h>","154":"classic blunder","155":"там уже забота терминала отобразить это на экране","156":"што","157":"Во первых до этого елсе не доходит, а во вторых даже если дойдет, будет также как и без него.","158":"naskalnye risunki","159":"А под какие задачи писал? GUI?","160":"Эээ","161":"И что в таком случае делать?","162":"Будет заменяться же следующий символ после нужного","163":"Самое сложное что я помню это было прикрутить жит к Pawn скриптингу","164":"Я же написал что не знаю других способов","165":"","166":"И там, где начинают свой аллокатор велосипедить, Гц обычно не сильно жалуют :)","167":"Не попасть туда","168":"Массив и есть указатель with extra steps","169":"#define ?","170":"а ещё можно в массивах типа такого делать","171":"Не обиделся","172":"Привет! Ищете проекты или помощь **IT и Digital**-сообщества по другим вопросам ?\n\n**Welcome** в наш [чат](https:\/\/t.me\/+LuXIrQyqMmc3ZmZi), который объединяет фрилансеров и потенциальных работодателей.","173":"ну тут думаю сам понимаешь, что статей в инете не хватит, нужен фундамент хороший, но мб хз","174":"Серьезно?","175":"Ну вот и вопросы: массив чего, какой размер и тд","176":"Вообще без понятия, думайте","177":"Конкретно в этом случае на это никак не повлиять, будут промахи или нет. В rdi (если речь о x86) придет указатель, дальше уже дело техники. Можно и на avx2 кстати соптимизировать, на асме или интринсиками или можно оставить это оптимизирующему компилятору. Тут больше вопрос как поменьше память трогать (l1d если быть точнее). Можно по идее сразу начать с заполнения выходной строки с конца.","178":"указатели на структуру могуть быть обьявлены с трюком forward declaration:\n\n.h:\n\nstruct ptr;\nstruct ptr* get_ptr(void);\n\nв .c:\n\nstruct ptr { int x; int y; };\n\nstruct ptr get_ptr(void) {\n  struct ptr* data = calloc(1, sizeof(struct ptr));\n  return data;\n}","179":"я через size_t решил. На 64 - 8, на 32 - 4","180":"Из-за тебя в пюре запретили стикеры?)","181":"Вернее взятие адреса в памяти","182":"если что, почти все кодеры из разных чатов пересекаются, ведь список всех чатов ведётся 4 людьми. Если не тут, то как минимум в другом чате тебя узнают и захуесосят 👌","183":"даров. надо приготовить пожрать","184":"Да","185":"ну так оба конфигуре и цмакелистс придётся писать только если у тебя крупный проект, когда разница сложности их написания уже ничтожна в сравнении со сложностью всей проделанной работы","186":"У тебя если будет кодогенерация, то ты тратишь меньше усилий... То есть нужен человек который это напишет, сообщество одобрит... ☺️ Тесты, и всё такое....","187":"А вот в других...","188":"аааа не всё нашли обший язык","189":"у для чуть постарше?\n\nпока с псевдографикой задачки придумываю, но мож кто-то уже делал подобное.","190":"Генпратор из исходников или просто рисовалка? Генераторов ни одного хорошего не видел","191":"Либо делай его размера 100, либо маллочь","192":"Мне кажется, что уже одного только опыта использования виеды хватит понять, что лучше не брать с них пример","193":"тогда на 17","194":"list\/vector\/set\/map я так понимаю ты тоже будешь писать с 0 под каждый тип? что-бы кроссязычно","195":"А то что у него для функции get_board_element_by_coord не выделена динамическая память, и он пытается к первому элементу присвоить пробел вас не смущает?","196":"когда привык уже к \"ауцкау\" + \"jhjh\" ....","197":"Я думаю что в си, не зная подобных тонкостей нереально писать хороший код","198":"нет, а почему 7?","199":"Ну судя по авке самый что настоящий))","200":"Window* frames = calloc(100 * sizeof(Window));","201":"нет, нельзя, т.к. `cx` в initializer list определяемой переменной","202":"Или даже не лимит, но реалочить массив почанково","203":"Ага, забыл название. Часть Glib","204":"Так то похуй","205":"визуал студия 2019 с виду","206":"И для Web тоже","207":"А так вопрос, который я задал, его можно рассматривать как отдельный","208":"А скок glibc займет времени на компиляцию?","209":"👌","210":"Привет всем. Есть тут кто занимается сёрфингом трафика приложений? Нужно одно приложение посмотреть какие запросы делает. Точнее только одну функицю. Кто сможет?","211":"да, но это дольше просто","212":"Если что сейчас использую ncurses для своих нужд","213":"Я так и делал, но потом забил, потому что, никто не хочет отвечать почему \"нет\", нет обратной связи","214":"Всё что сказал отладчик — glibc :(","215":"sublime","216":"Та ну, все же знают что метапрога про сферических коней в вакууме, а не применение)))","217":"поч он тогда не такой популярный","218":"Интересно будет прочитать. Спасибо, сохраню.","219":"Ну я сонный но вроде верно.","220":"https:\/\/stackoverflow.com\/questions\/12835360\/whitespace-in-the-format-string-scanf","221":"<ESC>:q!","222":"по такому алгоритму ты сможешь у любой клетки расставить указатели на соседей","223":"ну не знаю)","224":"Разве?\nЯ думал стд либа из херни одной выросла","225":"Stm32g4)","226":"Крч я тут шифрую строку алгоритмом","227":"man strcmp","228":"а implicit int пользовались?","229":"Сижу, ржу и плачу. Лайфтаймы просто вспомнились","230":"сейчас тянут. То есть сейчас пуре С востребован в основном потому, что на нём линукс.","231":"ну ладно, те линки также дал.","232":"","233":"Можешь сделать по-другому:\n`system(\"stty cbreak\");`","234":"Ок","235":"сделать вложенный цикл. \nодин цикл - перебор столбцов\nвнутри него - поиск максимума внутри столбца","236":"Там опечатка, \"санитар сэр\"","237":"да, я написал в Edit, бесят обратные слеши в винде","238":"Передавай привет преподу","239":"в x86 )","240":"А есть что-то похожее и встроенное в си?","241":"Иначе язык Си и не поймёт что ты за фигурными скобками фигню написал. Мб это та самая структура, мб массив странный, или просто левая структура","242":"Ок.","243":"`int i = 0` должно заканчиваться своей` \";\"\nfor(int i = 0;;) if (i++ > 5) break;`","244":"Да.","245":"winapi, создаешь свой текстбокс, настраиваешь шрифт (необязательно), делаешь свой printf с блэкджеком и ...","246":"У меня возник вопрос.\n\n```volatile *pointer;\n\n``` будет означать, что этот указатель сам по себе НЕ изменчив, но указывает на изменчивую переменную.\nА если написать:\n\n```volatile **ppointer;\n\n``` ?\nЭто будет восприниматься, как неизменчивый указатель, указывающий на неизменчивый указатель, указывающий на изменчивую переменную?","247":"и тип должен быиь ptrdiff_t","248":"Ну я мало под винапи еще писал, но первое впечатление ужас","249":"тут лучше стоит задать вопрос о уелесообразности сего действия","250":"так тебе и сказали билиотеки. чем ты не доволен?","251":"Выводи их сишнцми принтами в крестовом коде )","252":"a, я забыл что ты используешь","253":"bool встроенный никому ещё не помешал","254":"Я задаюсь им с осени, когда забросил свою игру на фентези - консоли.","255":"Если ума нет есть комбинаторный способ","256":"а ты запрлавишь мне в этот раз?","257":"Да и причем тут буфер ядра, когда я упомянул о том, что жду разрешение проблемы с тем, что терминальный ввод-вывод непозиционируеммый. При чем тут буфер ядра. Что, как?","258":"Второй случай предполагает:\n\nstruct my_struct ms;\ninit_my_struct(&ms);","259":"нет","260":"Так делать нельзя","261":"А содержимое?","262":"Всем привет, если я читаю файл и задаю динамический массив, как мне узнать какой размер массива задавать, если размер файла произвольный?","263":"Но кода меньше будет","264":"Вуз","265":"Или вам с функцией main ?","266":"Всем привет! Есть немного глупый вопрос: как правильно освободить память в `strct->name`?\n```#include <stdio.h>\n#include <stdlib.h>\n\ntypedef struct\n{\n    char *name;\n} test;\n\nvoid name_struct(test *strct, char *name)\n{\n    strct->name = name;\n}\n\nint main(void)\n{\n    test *strct;\n\n    strct = (test *) malloc(sizeof(test));\n\n    name_struct(strct, \"Billy\\0\");\n\n    printf(\"%s\\n\", strct->name);\n\n    free(strct->name);\n\n    return 0;\n}```","267":"Кажется нет","268":"я правда не знаю.... Я уже всё испробовал что мог... Самый простой код, а у меня не получается","269":"Так, вернемся к руслу. Я где-то ошибаюсь?","270":"","271":"анрил энжин переписывал","272":"сделай **массив а не на стеке","273":"change_value void возвращает, она же по указателю должна менять","274":"а тут 32 кб","275":"Тут я плаваю, кстати","276":"На самом деле, в башке ещё куча идей по способам уменьшения объёмов кода. К примеру, быстрое создание переменных на куче без использования дурацкого malloc.","277":"Не, можно конечно ручками в каждом .c файле делать форвард декларейшен","278":"```#define ALLOCSIZE 10000\n\nstatic char allocbuf[ALLOCSIZE];\nstatic char* allocp = allocbuf;\n\nchar* alloc(int n) {\n    if(allocbuf + ALLOCSIZE - allocp >= n) {\n        allocp += n;\n        return allocp - n;\n    } else {\n        return 0;\n    }\n}```","279":"Собак не ем. А тут я имел ввиду, что без ОС использовать ПК будет очень неудобно. Не всем же писать код из-под шелла, компилировать, а потом на другом ПК тестировать через загрузку с флешки","280":"И обмазывайся гнутыми расширениями ол дей","281":"я пока ещё ни разу free() не пользовался","282":"Нет уж спасибо. Просто вы зацепляетесь за каждое сообщение пытаясь найти повод доебаться. А началось все с того, что вас не устроил вопрос НОВИЧКА о том, можно ли писать бэкэнд на Си...","283":"Если что могу код скинуть","284":"да","285":"Определение функции вызывающей саму себя в другом tu? Что-то новое. Ну и чести ради, LTO никто не отменял","286":"Да, особенно МК","287":"Всем привет, подскажите пожалуйста как сделать следящее, у меня есть пустой массив и мне в него нужно добавить элемент, просто после Питона тяжело находить инфу и понимать некоторые моменты ?","288":"как кому, я бы посоветовал CLion","289":"точную терминологию забыл","290":"В си нет ссылок","291":"Да нет, матчасть и понимание того как работает память в компьютере нужна именно тебе. Сейчас мне цжк впадлу дальше спорить, мб ещё хирролот подтянется, обьяснит тебе что ты ебалай","292":"Ну дебаж значит)","293":"#include <stdio.h>\n\nint main(void)\n{\n    int choice;\n    while (1)\n    {\n        if (!(scanf(\"%d\", &choice)))\n        {\n            printf(\"Wrong Input\\n\");\n            continue;\n        }\n    }\n}\n\nПочему при вводе \"-\" или числа все работает хорошо, а если ввести букву то бексонечно печатает вывод?","294":"А зачем вам тогда си","295":"Дойдет до конца так как ты в условии указал i < 6","296":"? Бесплатно же","297":"Прату возьми","298":"и вообще это небезопасно","299":"?","300":"ага , я его переписывал пол года назад","301":"А как прекратить соеденение на стороне клиента в сокетах?","302":"Ухожу на бизибоксы","303":"Потому что strcat ищет символ конца строки. Строкииии лять. А у тебя там единственный чар и дальше память под что-то другое","304":"сейчас есть около десятка активных контрибуторов","305":"ушом разница","306":"Ты не смотри нa movups","307":"","308":"Vs Code","309":"Там телефонов нет","310":"Но при этом порядок аллокаций критичен, и успех зависит от нечта вне пределов функции.\nА если что то там изменится и у вас вероятность успеха аллокации Б станет мизерной?\n\nВ смысле это как раз тот случай, если вам кажется, что ГОУТУ оправдано и это не ошибка, значит косяк в архитектуре и чистить надо там","311":"Да","312":"И да, тут получится указатель на указатель на int.","313":"вот еще куда-то что-то копировать...\nюнион и норм","314":"Так стоп) а ты не пробовал уроки посмотреть по Си? Хотябы бесплатные?","315":"","316":"Кто-то не любит трапиков?","317":"у меня не получалось, пришлось сделать на буферах \n\nу меня ломалось на моменте, когда надо делать примерно такие вещи:\ncommand 1| command 2 | command 3\n\nА в интернете про коммуникацию пайпов такого рода, чтобы просто циклом запустить и пройтись по всем командам, без костылей не получилось найти (даже больше скажу, command 1 | command 2 еле нашел) )","318":"Зумеры чекать курсы","319":"CalsiBot Есть два стула, на одном плюсы точены, на другом сишки дрочены. Правила — https:\/\/t.me\/lame_c\/8812","320":"как бы он для этого и нужен","321":"Ну так немного руками пошорудить надо","322":"Экзэшник?","323":"Современная графика под Linux с аппаратным ускорением","324":"Дма","325":"Как локализовать на русский язык? Способы в интернете не работают","326":"всемпривет есть у кого на примете хорашая книжка по сокетам? на линукс","327":"Благодаря тебе я напишу шифровщик!","328":"Таких нет в стандарте, другой заголовок их определил","329":"(если перенестись с восьмидесятых в светлые 20)","330":"Это вообще не важно, это чат по си -> пиши на си","331":"о вождении танков тоже читал?","332":"это не чат по лиспу.","333":"лицензия GPL","334":"мне самому интересно стало","335":"Можно на `repl.it` загрузить весь проект.","336":"хорошо. Но этот чат о пуре С.","337":"непомню уже","338":"потыкай ncurses мне прям зашло кста","339":"Добрый ночь.","340":"Удобная штука","341":"проще всего будет изучить С + детали архитектуры, хардварные особенности, ABI, etc. \nпотом если надо - выучишь хоть Питон","342":"Походу","343":"I am struggling to create a function that will find the occurence of string in the first string and separate it with it and returns in the array.?","344":"Помогите 2 дз","345":"чем плох codewars ?","346":"а сори, не увидел что это только для проверки","347":"Какпим образом кресты должны привести его к си","348":"Можешь ради эксперимента попробовать вывести кусок строки за пределами первого \\0","349":"это отключает соответствующие разряды","350":"ну и плюс не факт что fread будет читать байтами т.к. стандарт си ничего не говорит о структуре файлов кроме того что они вроде как есть. Тут кш можно начать говорить об идиотизме стандарта, но важно понимать что стандарт выкатывался в другое время когда не было многих устоявшихся понятий которые есть сейчас","351":"не хотят разбираться) сразу дропают","352":"Речь не о них","353":"В книге PHP 7 в подлиннике ISBN 978-5-9775-3725-4 в начале книги рассматривают именно вариацию \"как отдать хтмл браузеру\". Также есть greencms.\nВ том случае, если вопрос, как создать браузер, то мне кажется логичнее взять готовый, не?","354":"ток стартовый откуда копировать начинаем тоже меняется по идее\nКороче я чет запутался как это красиво сделать :C","355":"","356":"у него будет запускать ядерную ракету","357":"Если коротко, то почитай про юникод и учти, что getchar выдает тебе один байт (8 бит)","358":"CalsiBot Есть два стула, на одном плюсы точены, на другом сишки дрочены. Правила — https:\/\/t.me\/lame_c\/8812","359":"И цикл с `getchar` работает до пробела. Обычно делают до `EOF`.","360":"Мне главное - чтобы текст был","361":"https:\/\/neprivet.ru\/","362":"Что такое restrict?","363":"явно разработчики вложились и хотели заработать","364":"воспринимай фразу про \"массивов нет\" философски","365":"только я то тут при чем ?","366":"выбирай любой без буквы F","367":"да","368":"coreutils, у тя и с этим проблемы с параметрами?","369":"Хвостовая рекурсия называется","370":"Но прикол в том что read не работает","371":"Не о том речь, но ладно, лишаться ног вам, а не мне 😁","372":"В никсах вообще прозрачные окна есть, можно просто отрезайзить окно и вывести графику","373":"Спасибо за инфу !","374":"без Си","375":"Вопросы по плюсам в @supapro","376":"Хехе)","377":"А разыменование?","378":"Народ всем больше спасибо за помощь, одного человека благодарю отдельно, спасибо )","379":"на мой взгляд это не очень правильно","380":"покажи как ты хочешь","381":"намек понял","382":"а ты какую читал?подскажи чтобы я не чиатала","383":"даже иногда на работу приходится выходить","384":"Ая хочу на си","385":"эх...","386":"И эта переменная будет \"жить\" в пределах скобок?","387":"а теперь без клоунства","388":"иди занимайся дедами","389":"да, я тоже слышал что vla нельзя юзать для больших массивов.","390":"подойдет следующее решение? выделить глобальный буфер для каждого потока и писать лог туда. после завершения работы вывести глобальные буферы последовательно","391":"значит тебе нужно предусмотреть механизм завершения ф-и, которая передается в поток","392":"ответ дал, но в флудилке вас нет.","393":"C20 не было, только C17","394":"Позвонил его маме","395":"","396":"http:\/\/forum.ru-board.com\/topic.cgi?forum=33&topic=3174&start=6320#6 вот интересное поведение компилятора...","397":"Конечно. Только из размен импл дефайнд. 2 на вин, 4 на лин","398":"Ты женщина?","399":"Мда, ну давай на всех языках мира здесь писать, удобно, правда?","400":"QBasic","401":"Вы еще условия наших лаб по ооп не видели)))))","402":"Но почему","403":"Спасибо 🙏","404":"в плюсах их только для контейнеров действительно удобно юзать","405":"там если вместо 0 i написать получается треугольник но  с другим угром","406":"это хорошо )))","407":"","408":"как можно написать прыжок в консольной игре? координата игрока записана в массив, при нажатии W он должен прыгать, а потом возвращаться на место , на землю","409":"Так зачем возвращать юзверя? Надо возвращаться что-то типа\n```struct return_type\n{\n    struct user_t user;\n    bool is_valid;\n};```","410":"Преобразование __array to pointer conversion__","411":"это же не читабельно","412":"в C?","413":"Тут как бы чат для совсем начинающих, ты нашел где просить!","414":"Самый вопросительный этап компиляции для меня - трансляция в машинный код. Как это  проходит?","415":"На сегодняшний день использование всех возможностей в чистом виде вообще непопулярно. Повсюду же игровые движки. Не уверен, что все геймдевелоперы знают, что их шейдеры вообще отдельно собираются","416":"инты преобразовываются в указатели.","417":"","418":"Хм, тоже, верно, согласен","419":"подсказка: mp5 это оружие","420":"Изменяешь знаковый бит ?","421":"> И как понять почему я не могу выбрать другие размеры (например 3 бита)? Это ограничение железа или софта?\n\nограничение железа","422":"Я вот думаю, что кто задаёт такие вопросы - грёбаные мудаки.\nЕСЛИ конечно это именно в такой форме задаётся вопрос, с вариантами ответов, а не как повод начать дискуссию на эту тему.","423":"Но это не мешает мне строить поля","424":"```  while (numstr[i] != '\\0') {\n    if (numstr[i] <= '\/' || numstr[i] >= ':') {\n      printf(\"no symbol in number\\n\");\n      return 1;\n    }\n    i++;\n  }\n  i=0;\n```чтото такого рода?","425":"k&r размером и по смыслу с брошюру","426":"Спс за селфи, брат","427":"а как надо?\nЯ входу в цикл, если элемент существует\n`while(stamps_temp != NULL)`\nи после преобразований делаю\n`stamps_temp = stamps_temp->next;`","428":"Зачем?","429":"Там много по проге, но писать в 2 или 3 надо","430":"Не раз слышал о таком методе. Не каждому он подходит. Ну и вопрос бы не об этом, а какой уровень нужен. Что то типа элементари, интермедиат, адвансед. Извините за мой французский","431":"Да ты и когда в любую автоматическую\/статическую переменную что-то пишешь, то тоже обращаешься к адресу (если не брать в расчет оптимизации).","432":"Добрый день, можно ли как-то закаррировать указатель на функцию? тип int (*add5)(int,int) = &add; add5(5); add5(10); ?","433":"а как оно выглядит хотя бы","434":"А, выше уже заметили","435":"Я вот был в питончатах и там просто дикий токс из-за наплыва полностью нулячих людей, которые не уважают время тех, кого они спрашивают и из-за этого у всех сдают нервы.\nПодозреваю, что в JS\/PHP аналогично.","436":"И я думаю о двух вариантах. Либо делать интерфейс для ее закрытия\/открытия. И подгружать когда требуется обновление. Либо подгружать каждый раз.","437":"А смысл писать хуже, чем оно уже есть?","438":"брух так определение функции одноже буит не","439":"ceil","440":"Я уже сделал его 😅😅😅","441":"> только асм отличается тем, что даёт все возможности от ПК программисту\n\nЛюбой компилятор С в среднем оптимизирует код лучше, чем человек-ассемблерщик","442":"дмитрий не знает про variable shadowing или что тут происходит","443":"Есть ООП-подход в си, через структуры","444":"Попытаюсь понять, в чём ошибка","445":"и тут мне пишут","446":"не очень понимаю, ты говоришь про оптимизации?","447":"Либо битовыми сдвигами, либо шириной полей в 1 бит","448":"Си создавался для того чтобы писать юникс","449":"Пацаны","450":"Находит он эту самую длину потому что в конце есть нулевой символ `\\0` или 0x0 в виде байта","451":"Что есть промышленное по?","452":"+","453":"Я имел ввиду то, что невозможно переопределить тип, только значение, отсюда логично что и определение тоже относится к значению, потом я начал гуглить, и челы под переопределением пытаются понимать перегрузку","454":"На размышление даётся 3 секунды","455":"да, для меня это показатель строки, что ты можешь складывать одну строку с другой.","456":"L c 1 перепутал","457":"а приколы вроде \"мы поставили лок файл и его надо убрать, иначе потом программа не запустится снова\"","458":"","459":"с другой стороны, «транслятор» может выступать как обобщенное название для компиляторов\/интерпретаторов.","460":"*не подходишь*","461":"ребят вы часто union юзаете в качестве минимизации памяти?","462":"Сколько у тебя всего оперативки? Вроде как есть экий некий лимит на максимальный кусок который зависит от колва оператмвной памяти","463":"у obj, а после инициализации ptr соответственно","464":"Да, просто в самом задании, сделать с помощью трез вложенных циклов","465":"ну, например ыевшщюр","466":"я про работу","467":"в глаза бросилось\n\nБочков соонального....","468":"Более того, стандартная библиотека как С, так и С++ не имеет функций работы с конкретными кодировками. Поэтому я бы посоветовал вам взять что-то вроде библиотеки [ICU](https:\/\/en.wikipedia.org\/wiki\/International_Components_for_Unicode) (она большая, да).","469":"Так ты же говоришь что разницы нет","470":"тада да компилер не глупой","471":"И да, это экстеншн гну","472":"скорее всего все выполняется, но просто по итогу выполнения закрывается","473":"Я думаю все же можно перейти с си на плюсы, но я думаю не смогу на каком то из них программировать на професональном уровне","474":"Посмотрю, спасибо.","475":"поучи допольнительно Linux, многопоточность (теорию), и pthread в практике, по сетям себя помучай (стек TCP\/IP, модель OSI (её вообще спрашивают сейчас?)), потренируйся в POSIX API, которое сетевые функции предоставляет, посмотри и поупражняйся в C99, C11, почитай стандарты MISRA, CERT-C (в этот особенно стоит вникнуть), освой cmake, make","476":"вход: 5x5, 5*5, cell выход: 5x5, 5*5, cell","477":"а в винде не так?","478":"да я тоже чёт не вдуплил","479":"ко мне не надо","480":"А что конкретно там?","481":"Что используют для юнит тестирования в C?","482":"Вим так же делает.... Просто подписывает с точки чтобы ты не видел... И удаляет их если сохранять (даже после перезапуска)) навигация тоже норм, бинды соглы некоторые устарели, но в виме та жалуешься на раскладку в первый раз? А в емаксе нет.. да и новые фичи просто из емакса в другие редакторы текут в основном","483":"Разве нет?","484":"я почему-то думал что кнут уже не жив…\nа тут книга сравнительно новая","485":"есть оператор , которые меня знак положительного числа на отрицательный в си ?","486":"ничего. ты должен помнить size","487":"Есть uintptr_t для такой наркомании","488":"завтра на сдачу возьму парочку","489":"англичанин завелся тут","490":"я тут нашел через лучи щяс попробую","491":"их там 4","492":"Подскажите пожалуйста , почему такая структура строена (выделил стрелками на скриншоте)","493":"они сами по себе","494":">realloc \nА что случится если передашь строку в стеке","495":"https:\/\/t.me\/lame_c\/100926","496":"Если программа асинхронная, то минус только в ожидании записи лога. А если есть потоки, то это будет очень узким горлышком","497":"https:\/\/www.jetbrains.com\/help\/rider\/Using_Watches.html","498":"Не про это, вот есть абс - для целых, фабс - для чисел с плавающей запятой, вроде всё исключительно логично","499":"Хех,\nВызвать каллок - не\nЗаписать ручками в конец 0 - не\nВызвать мемсет - да!!!😄","500":"а где твой курс","501":"Ещё, сразу извини за идиотский вопрос, а как правильно называются \"маленькие функции\" такие как printf(), scanf(), get_char() и т.д.?","502":"да но это в умных кофемоках. в тупых - по прежнему электромотор. вообще мой вариант","503":"но я считаю что моя идея ос для определенных узких задач имеет смысл. вот к примеру взять линукс, он же слишком сложен и избыточен для такого слабого нетбука","504":"Ну типа можно, но наверное уб-шно, не везде заработает","505":"нет, для начала изучения С не нужно знание никаких других языков.","506":"А еще лучше обоих, у них много примеров + практические задания. Есть как в оригинале, так и на русском","507":"Их никто и не позиционирует как конкурентов. Это своя арха.","508":"заголовки пакетов с флагами удобнее смотреть в hex.\nАнализировать поток данных тоже удобнее в hex","509":"Во имя уба конечно же","510":"как обработать сигнал в дочернем процесе?","511":"после инпута чтобы убедиться что переменная инициализирована","512":"обмаули дурака на 4 кулака","513":"Он повторяется всего 1 раз.","514":"Убираем конкуренцию)","515":"Обнуление лишнее)","516":"0. посмореть, есть ли на ней gcc.","517":"А может быть дело в способе открытия файла, \"rb\" - как бинарный открывать?","518":"Корявый -- напишите лучше\nМедленный -- жду бенчмарки\n\nВы тролль и очень жирный","519":"Как массив создается?","520":"struct  film * array[]  = {s1, s2, s3};\narray[1] = {\"Title\", 10, array[2]};\n?","521":"","522":"мало ли)","523":"Хотя по сути компилю без посредников - сразу через gcc","524":"","525":"На хостинге же не винда","526":"`int a(int a, ...) {\n    return (*ptr_a)(a, ...);\n}`\n\nВ динамической библиотеке имеется функция с любым кол-вом аргументов. Я получаю её адрес. Как теперь её вызвать?","527":"я только что заметил кое-что","528":"я прочитал","529":"У нас есть репутация в чате ?","530":"Основы изучал , участвовал в олимпиадах по спорт программированию","531":"по факту никто","532":"Че","533":"Вроде? У тебя указатель на структуру и ты целиком выделяешь память на неё. Даже если ты удалишь её потом, то память просто в кучу обратно уйдёт, но ссылка всё ещё будет указывать на кусок памяти. Просто оно может взять и исчезнуть если ты ещё раз попробуешь память выделить после","534":"Залипал в тытруб, наткнулся на видео, как чувак строит рисовалку линий в майнкрафте на редстоуне )))","535":"","536":"епть","537":"А выглядит как реклама компании СТЦ и спам её вакансиями, вписанный в контекст диалога","538":"`system();`? 😂","539":"как это","540":"Питон намного легче был","541":"это так","542":"крч, дед. Эта запись верна\nchar** a == char* a[]\nДошло?","543":"да","544":"Меняется раскладка клавиатуры, меняется язык и твоя программа всьо","545":"Где здесь реверс?","546":"У C# уже давно было","547":"Хотя не, с кольцевым буффером меня поплавило конечно, там тоже O(n), но вот хвостик у односвязного списка можно и хранить, вай нот?","548":"Всем привет. Меткой считается только один statement, до первой точки с запятой?","549":"До size_t и макросов я ещё не дошел. А vs code сам предложил ld. Но, спасибо за информацию.","550":"А, разобрался, надо просто а папке сабмодуля сделать чекаут нужного коммита и закоммитить изменения в репозитории верхнего уровня) вдруг кому-то пригодится","551":"Идите в *уй! Я вашим мнением не интересуюсь. Выше люди ответили, без ЧСВ и понтов. Советую поработать над собой. ☺️","552":"Типо не при делах","553":"","554":"","555":"Проходите мимо.","556":"посмотрел решения, там везде через маллок, в этом и была проблема","557":"и да, каст в char* ненужен т.к. void* кастится в указатель на любой тип","558":"вы задаетесь вопросами, зачем нужен тот или иной инструмент в языке, поэтому глупым вас назвать сложно\nможет просто знаний мало, но это решается легко - чтением книг","559":"```int main(void) {\n        int arr[][] = {\n                {0, 1},\n                {2, 3}\n        };\n}\n```\n\nА если я индексы прописывать не хочу, но хочу результат как в первом случае?","560":"?","561":"На одну","562":"сразу замечание: sizeof(arrey) это не размер массива. это размер указателя","563":"ой не нравится мне fast_sqrt в поиске простых чисел","564":"Эх если бы я знал что такое make и Кейт (((","565":"Если я не прав, поправьте пожалуйста","566":"или D","567":"не понял, над указателями void невозможно выполнять арифметику указателей.","568":"А как оно будет работать?","569":"надо 1.0\/3.0, иначе инт делить на инт будет 0","570":"А еще там вроде как s из верхнего for затеняет локальную s, интересно что там на выходе получается, должно быть 0","571":"А чёрт его знает, может показалось)","572":"тип лежит отдельно и известен только на этапе компиляции","573":"мож проще: в горизонталь или вертикаль?","574":"а не проще\nmov ecx, -1  \nxor al. al\nrepz scasb","575":"Вот это я не понимаю, в иф функция < меньше работает так? Она ищет то что меньше всего?","576":"Ребята\nА по С++ кому можно впоросы задать или прям сюда можно?\nвопрос легкого уровня что ли","577":"значит надо отдохнуть","578":"","579":"но ведь в итоге при создании переменной именно RECT указывается, а не tagRECT","580":"можно же передать константный указатель вместо него?","581":"tcc","582":"Ты хочешь вернуть массив из двух строк, у первой будет все буквы будут в верхнем регистре, а во второй - в нижнем?","583":"по ряду причин","584":"да асм тоже люблю, веселуха 🥰","585":"Можно че угодно программировать","586":"при том что ты промпт","587":"Привет всем","588":"Привет! Если ищете проекты или помощь IT и Digital-сообщества по другим вопросам — welcome в наш [чат](https:\/\/ur-l.ru\/juuPo)! У нас нормальный народ, всегда ответят на вопросы. А еще есть канал интересный)","589":"","590":"ты пишешь & чтобы взять адрес\nбыл int** если взять адрес станет int***","591":"чё так сложно что ли","592":"Понятно, спасибо 🙂👍","593":"Я про скорее не про сами библиотеки, а про рабочий кож","594":"Да!","595":"","596":"черт, сложно","597":"Это типо мк были","598":"и где вы там такое увидели?","599":"это считается за ошибку или просто плохая практика?","600":"так вот почему фигурные скобочки ставят на следущую строку","601":"вообщем, как я понимаю, int r[10]; выделяется автоматически и имеет ограниченную область видимости то есть при выходе из области видимости память очищается, в данном случае область видимости функция и ты возвращаешь указатель на очищенну область памяти","602":"Прозрение (Более вдумчивое прочитывание нагугленного)","603":"Я учил си чтоб легче было осваивать си++","604":"Самое простое решение для тебя - установить mingw","605":"Третий символ.","606":"Я чёт не понял. TCC это же jit?","607":"ntpd есть","608":"мож ты скопировал криво?","609":"Я про гаджеты","610":"Сделал через цикл и забил большой болтик на ограничения","611":"Для ясности","612":"```do {\n\/\/ строишь матрицу\n} while(0);```","613":"Используй апи ffmpegа","614":"Как раз, просмотрите все итерации циклов","615":"ЧТо почитать по компиляторам чтобы понято что это, какие виды есть и т.п?","616":"почему ничего не выводится подскажите пожалуйста","617":"Ля. Опять ты?","618":"если он из россии, то ему это не грозит","619":"я пишу код в VSCode и компиллирую MinGW вот и все","620":"т.е. я правильно понимаю, что нормальные разрабы так не делают?","621":"Войдический","622":"Получить свои координаты","623":"~~А где код блокс не понел~~","624":"спасибо, sleep 5 сработал 🤙","625":"(тип) выражение","626":"в блокноте писать код?","627":"то то и оно","628":"sprintf() тут для форматирования строки. он для вызова второстепенен.\n\nнебезопасный способ - system(), более правильный - execve(), и подобные","629":"Да и CMSIS там вроде в бандле есть, емнип","630":"что я собственно и наблюдал последнюю неделю, от чего уже начал опять спиртягу пить. Ибо ну это пиздец","631":"","632":"там правда все по-своему и со своими тараканами сделано","633":"ну вот как этот однобайтовый чар может хранить -128, которому нужно 8 бит на само 128 и ещё одни бит на знак?","634":"Что за книга?","635":"не, надо как то не меняя прототипа","636":"он ведь сказал что C хочет а не objective-C","637":"😳😳😳","638":"ясно","639":"Исходники плиз","640":"Вероятнее всего у человека вопрос по линуксу есть?","641":"спасибо","642":"в этом случае не надо.","643":"Опять-таки, дело вовсе не в пайпе, при любом выводе строки терминирующий ноль не выводится.","644":"не знаю, твое ж задание","645":"На андроид есть одна офигительная чисто онлайн игра, но у нее такое подкапотье, что клиент - полностью самодостаточное приложение, где снрвер выступает только для синхронизации. И там люди выкручивают ее по максимуму. Так как из-за самодостаточного клиента ты без проблем и бесконечно летать можешь, и бессмертный, и любые характеристики можешь подкрутить","646":"значит ты должен вернуть не что то типа char [] а должен вернуть что то типа char*","647":"На сишный фреймворк по описанию похоже","648":"Я знаю. Не был намерен скринить всё окно","649":"#include <stdio.h>\n\nint main(){\n    int a;\n    scanf(\"%d\", &a);\n    \n    if (a\/1000%10 >= 5){\n        printf(\"%d\", a\/1000%10);\n    }\n    if (a\/100%10 >= 5){\n        printf(\"%d\", a\/100%10);\n    }\n    if (a\/10%10 >= 5){\n        printf(\"%d\", a\/10%10);\n    }\n    if (a%10 >= 5){\n        printf(\"%d\", a%10);\n    }\n    else{\n        printf(\" The digit isn't in 5-system of числення\");\n    }\n}","650":"да задача была просто объединить 2 массива в 1","651":"я тут узнал, что в си литералы имеют тип, ладно","652":"Ты втираешь дичь. Файл может содержать любые возможные символы читай байты от 0 до 255","653":"Вот требования:\nFlight, для которого мы сохраним:\n1. Название аэропорта, из которого он вылетает.\n2. Название аэропорта пункта назначения (пунктом назначения не может быть аэропорт, из которого он вылетел).\n3. Данные самолета (структура):\n       а. Тип самолета Варианты: Пассажирский, Грузовой, Военный.\n       б. Код самолета - 4-значный код - только прописные буквы\n4. Дата (структура): \n       день, месяц, год. Проверить правильность даты.\n\nВ пунктах 3 и 4 , я должен объявить только структуры типов самолет и дата или , только их соответсвующие например поля самолет->тип самолета?","654":"Я успел запутаться в коде пять раз","655":"Нет","656":"token у тебя как объявлен?","657":"а вообще всё ищется в гугле. уверен, ответ там уже есть","658":"Давайте чат по си будет чатом по си\nОффтоп есть в @rsa4096","659":"Нет блять\nСмотри я попробую объяснить понятнее\nЕсть массив, там есть 5, 1, 2, 3, 4\nУ ифа задача что если там есть числр меньше 5, то это выводится в экран\nТам все меньше 5, но выводится 1","660":"оно у тебе вообще собирается ?","661":"А если бы у меня был бы какой-то макрос под это дело то я бы хоть как автоматизировал бы это","662":"а что за метод такой?","663":"Можно так:\n\nhttps:\/\/stackoverflow.com\/a\/14474627\/2913477","664":"Спасибо ребята! Оставлю вас с этой темой😅 погнал делать дз","665":"ну да","666":"Тут дело вообще не в коде программы, а в ее запуске","667":"👍","668":"ну так иди работать года через 4 и станешь), не к 19, к 20 точно","669":"Чел прочти тред\nНа С уже все написано, стоит вопрос какой гуй выбрать","670":"Тебе ж как-то говорили","671":")","672":"О, что за клоунада тут опять","673":"моб приложение?\nУх бля там не всн так просто","674":"Благодарю за ответ. Сам только учу С","675":"Без каста заработало.\n\nА как правильно сделать всеже?","676":"ну пусть и делает только вычисляет при выводе а не хранит уже отформатированное","677":"Никак не могу понять switch","678":"Добрый вечер! \n\nвозможно вопрос не по теме чата, второй день уже бьюсь, у меня IDE Astro Nvim, там стоит автокомплишин clang компилятора, и стандартные либы винды не отображаются так как у меня мак м1, а мне нужно что бы не подсвечивало «ошибки», компилирую на windows server, главное что бы подсветка корректно работала на самом маке","679":"Я не помню как подсчет аргов идет","680":"Arr[4][2] - сплошной массив размером в 4 * 2 элементов. Беря первый итератор как a, а второй как b, итерирование происходит по формуле a * 2 + b","681":"запросто, можно расширить сисколы для гуишных функций","682":"Дело в том что нет","683":"теперь точно не поймёшь","684":"Ну хорошо )","685":"ну так тоже ничего не принтит","686":"`implicit declaration`","687":"Так, как там писать, я что-то не понимаю :\/","688":"всм ?","689":"Он почему-то не робит как надо","690":"```int main(void) {\n    char *argv[3];\n}```","691":"А в первом случае не дошёл до конца массива","692":"из контакт-листа","693":"> не оффтопить","694":"мои коммиты пройдут!","695":"Тут signed char","696":"Форк != Горутина","697":"А вам это зачем?","698":"Никаких гарантий(","699":"там в some code может ещё что-то быть, почему нельзя сразу вернуть","700":"Всем привет, не подскажете, почему число вводится дважды? У меня ведь только один вызов функции","701":"Осталось только указать расположение.","702":"видимо, мы говорим о разных стандартах, IEEE и OSSF (https:\/\/openssf.org\/)","703":"для одномерного и двумерного массива это так. для указателя на указатель - нет","704":"Кстати.. а знаете как изменить константу? :DD","705":"Забыл закрыть мютекс, сейчас закрыл и все равно всю работу делает только один поток","706":"А как какать?))))","707":"proshlyj raz eto srabotalo","708":"Ну я не знаю, может это какие-то эмбедед методики","709":"В смысле?","710":"на форте кто нибудь писал? он сейчас применяется где нибудь?","711":"мне надо с другого запущенного X-сервера в терминале дебажить","712":"можно ссылками на рабочие куски кода?🥺👉🏻👈🏻","713":"Минусы?","714":"И в 23-й такая же.","715":"Всем привет! Может кто-то привести примеры из практики, где будет полезно применять знание по решению этой задачи?\n\nhttps:\/\/leetcode.com\/problems\/product-of-array-except-self\/","716":"Как именно происходит \"увеличение размера стека\"? Если потребление стека увеличивается со временем исполнения программы, то это плохо. Если оно просто \"большое\" (что бы это не значило), то может быть по-разному - как плохо, так и приемлемо, но здесь нужно смотреть индивидуально.","717":"Так и живем","718":"Так объявляется указатель на функцию. Имена аргументов указывать не нужно, только типы","719":"Так идея задачи в том, чтобы найти все простые делители, а потом посчитать общее количество делителей (тут уже математика) у p_1^(q_1) * p_2^(q_2)... p_n^(q_n)","720":"","721":"точно. Спасибо","722":"RVCT нужен не для работы \"с sim800h\" а для работы \"на\" нём. Это разное, Наташ.","723":"Ну в основном не делают это из-за ну как бы сказать чтобы не обидеть тех кто это не делает... а Ладно из дремучей ебанутости и е*** дремучести, потому что дед делал так и нам велел, потому что мы любим проектировать API и гордимся тем что умеем проектировать API под е*** чистый си","724":"есть","725":"Спс","726":"загляни в оглавление, думаю может заинтриговать","727":"я понял, это придирка к формулировке) ок, может не вызвать ошибки, но результат непредсказуем","728":"ну заебись же, разве нет","729":"бро, будь добрее","730":"угу, так хардкорней, и есть над чем подумать","731":"Открыты","732":"можно advent of code попробовать порешать, кстати","733":"суть в том, что компилятор допускает ошибки при оптимизациях и результирующая программа делает не то, что было написано","734":"метанит такое себе, cppstudio . com воть что-то получше","735":"Так что это даже не наша вина","736":"согласен.","737":"Тут?","738":"Есть чать по assembly для новичков или хоть какой-то?","739":"нормальный это гуглить","740":"Добро пожаловать в нашу секту😁","741":"Нет, флаш и ревинд у тебя были, фри чтобы не текло, проблема была в чтении в loopcmp, а также неиспользующиеся дескрипторы надо закрывать до цикла, чтобы не было попытки повторного закрытия","742":"What you’re referring to as Linux, is in fact, GNU+systemd+Linux","743":"обе теоремы","744":"Элементы argv нельзя мутировать если что","745":"Спасибо","746":"Скинь код в годболте","747":"Отлично! Есть мне ещё что до 20 округлить тогда...","748":"ок, пушнул","749":"А при чём тут плюсы, если это чат по C?","750":"Тут в книге есть визуализация двумерного массива","751":"Например:\nВопрос №1 как сделать задержку 50 миллисекунд.\nВопрос №2 как получить разницу в миллисекундах.\nВ таком духе.","752":"но у меня горело с работы битмап","753":"Наблюдал с этим глюки в новых версиях компилятора. Попробуй CC=\"gcc-9\"","754":"\"(3-й) класс\"","755":"кто там говорил что си это top down approach","756":"есть нормальные IDE на мак? вскод так сказать не очень работает, бывает подсвечивает ошибку там где её нет, и где то только через минуту перестает подсвечивать ошибку\n\nну крч в некоторых местах по минуте сижу жду думаю может это не ошибка а вскод шалит","757":"Лол тот же код будет медленнее?))","758":"Это бы как минимум усложнило логику сравнения т.е. те же самые cmp, add, test, и любые другие инструкции x86 асма, выстааляющие флаг zf должны были бы для -0 его также выставлять. А ещё вопрос, какую бы двоичную запись имел -0? Все единицы? Или же 1 и все нули? Т.е. по логике он должен быть между -1 и 0, однако это сломает всю арифметику знаковых чисел, а если выбрать второй вариант то для -0 придётся делать костыль, чтобы арифметические операции с ним давали бы тот же результат, что и с обычным нулём.","759":"Погляди в какой области определяется сам kek.","760":"Да, но это все равно linux.\nА то, что нету того что есть в desktop это означает, то что разработчики android видят систему по другому.","761":"я выучил язык С методом проб и ошибок, и это был первый язык программирования, после ALGOL и FORTRAN, который я выучил не только на бумаге или набил в терминале, а изучал с помощью продвинутого редактора Turbo C 1.00, так что не понимаю, в чем проблема изучать язык по справке текстового редактора Turbo C, изучай сам, смотри на ошибки, все будет круто","762":"так как адресация памяти на х86 по селекторам\/paging производится","763":"Добрый день подскажите можно ли в C включить обработку на GPU?","764":"ну и rename и прочие средства рефакторинга в полноценных ide может работать лучше","765":"Указатель на массив","766":"Разбираюсь","767":"😁","768":"Точнее, это в данном случае объявление и определение.","769":"Ну в принципе да, но этого я и хотел избежать, чтобы каждый раз когда нужно скомпилиррвать пакет нужно было переносить в место сборки.\n\nА вот сейчас посоветовали tmpfs настроить, надеюсь это включает и make.","770":"Обиженный чел который С выучить не смог","771":"Спасибо","772":"Меня высокоуровневый си испортил","773":"в однопоточном коде у нас один общий стек, раскладка памяти стандартная\nа какая раскладка в коде, который предусматривает несколько тредов? там же у каждого свой стек должен быть\nполучается, что при увеличении размера стека отдельного треда другие стеки сдвигаются в памяти?","774":"оператор new выделяет память и делает ее(переменную или класс) динамической","775":"Хорошо, по остальным пунктам что можете посоветовать","776":"filename.exe ?","777":"ребят , почему не работает?","778":"нет, я сказал то что хотел сказать\n\nНапример чтобы вернуть массив из функции, нужно делать аллокацию в куче\n\n`char* f() {\n    char buffer[3];\n    buffer[0] = 1337;\n    buffer[1] = 1337;\n    buffer[2] = 1337;\n    return buffer;\n}`\n\nне работает, правильно делать\n\n`char* f() {\n    char buffer[256];\n    buffer[0] = 1337;\n    buffer[1] = 1337;\n    buffer[2] = 1337;\n\n    char* result = malloc(256);\n    memcpy(result, buffer, 256);\n    return result;\n}`","779":"Construct 2","780":"тут .\/test_reverse.exe 2 great gatsb\n.\/test_reverse.exe : The term '.\/test_reverse.exe' is not recognized as the name of \na cmdlet, function, script file, or operable program. Check the spelling of the      \nname, or if a path was included, verify that the path is correct and try again.      \nAt line:1 char:1\n+ .\/test_reverse.exe 2 great gatsb\n+ ~~~~~~~~~~~~~~~~~~\n    + CategoryInfo          : ObjectNotFound: (.\/test_reverse.exe:String) [], Comma  \n   ndNotFoundException\n    + FullyQualifiedErrorId : CommandNotFoundException","781":"Лол, еще раз повторюсь, мне совершенно похуй на твои сомнения, заниматься замерами хуев я не собираюсь, участники этой специальной олимпиады априори победители","782":"Он скорее всего просто побаловаться хочет. Думаю хоть какие то инструменты должны быть","783":"почему этот код выводит ответ сразу после первого ввода, если я объявил 2 функции сканф:","784":"\"пока файл не закрыт\"\n\nно тут нет никакого файла","785":"гений","786":"отладчик в руки и погнал","787":"устанавливать будем","788":"```minimal_strace_edit.c:75:4: error: invalid type argument of unary ‘*’ (have ‘long long unsigned int’)\n   75 |    *regs.rdi,\n      |    ^~~~~~~~~```","789":"Это не определение","790":"ты один файл скомпиль со статичным main","791":"Ну это путь усложнения компилятора.","792":"Сарказма не было... REGISTER так редко используется (я не использовал НИКОГДА за 20+ лет опыта) что я лично не знаю такие нюансы...","793":"я поправил немного, вот примерно так я бы в репу записал но с матюгами все равно","794":"Я MS не пользуюсь","795":"Хиролот хуйни не скажет","796":"вроде того","797":"Ну если он у тебя автоматический, то просто = {}\nЕсли маллочил, то либо каллоч, либо мемсет после маллока","798":"Чекните что не не так пожалуйста\n\nhttps:\/\/pastebin.com\/UuguDQRE\n\nпрототип задан. Гласная - это одна из букв a, e, i, o, u (достаточно просто заменить строчные символы). Функция принимает строку и заменяет все гласные заданным символом ch. \nФункция возвращает количество выполненных замен. Если гласная заменена тем же символом,\nэто все равно считается заменой.","799":"@hirrolot писал годный гайд на хабре","800":"Размер arr чтоли?","801":"пардон","802":"И занулять выделенную память, если вы потом её на `NULL` проверяете. Хотя эта проверка не нужна по факту.","803":"монетку подбрасывает","804":"А это теоретический","805":"Спасибо","806":"Я имею ввиду другие риск","807":"?","808":"Зачем это?","809":"Символьный массив, созданный через литерал, может находиться в любой области памяти. Это замечательная особенность Си - сами данные не зависят от типа памяти, в которой они расположены","810":"https:\/\/godbolt.org\/z\/LdD67T\nСанитайзер ловит на изи","811":"пишите сразу вопрос","812":"раз удалил продублирую:\n\n@Nevelook, с каких пор VS code стал компилем?","813":"Ток это неправда и цифра в 1кб взята с потолка.\nЕсли бы речь шла о строках < 64 или 128 байт, тогда бы можно было поверить, а так нет","814":"с таким темпом он примет ислам","815":"https:\/\/rextester.com\/AGX8951","816":"Дмитрий смешной поц. Еще и в блокноте на сишке пишет. Мне даже страшно если его поделка будет где-то в коммерции использоваться","817":"тоже можно пилить gui, хоть и текстовый","818":"и в другие \"целочисленные\" типы","819":"как подсчитать количество слов в бинарном файле?","820":"так скомпиль и посмотри","821":"Деанонит что???","822":"ну, мне вот нравится саблайм\nмногострочное редактирование очень упрощает жизнь. как и плагины под языки типа verilog","823":">>?","824":"спасибо я разберусь ))","825":"Добрый день! Посоветуйте материалы по языку С\/C++. Это могут быть книги, курсы, лекции.(для начинающего)","826":"ага, ну да\n\nhttps:\/\/w3techs.com\/technologies\/comparison\/os-bsd,os-linux","827":"+++","828":"Подскажите плиз, как на си сделать статический полиморфизм?","829":"дело в том, что у меня уже есть рабочий алго, на 8ми битной арифметике со всеми итерациями","830":"ну или просто уехать не через диплом)) ну и для визы o1 диплом не нужен, только деньги","831":"Интересно, в какой сфере вы делаете проекты на Си","832":"это тоже способности, другого плана, но да, есть талант у некоторых","833":"не мешай","834":"В общем ещё раз, функция ничего не делает полезного.\nМесто ей в посойке","835":"Я на жс щас прогаю","836":"Алсо адресация до size-1 же","837":"Я об этом и говорю.","838":"В чём классический вим, обвешанный плагинами уступает vscode?))","839":"У меня точно не мсис","840":"len взявшийся изниоткуда","841":"Хотя нет","842":"Ты опять свою крестохуйню тащишь сюда","843":"в С нет конструкторов, но можно объявить таблицу \"виртуальных\" функций, заассайнить туда свои \"конструкторы\" на этапе инициализации структуры\n\n```\/* queue\/list: vtable definition *\/\nstruct list_vtable {\n    \/* initialize context *\/\n    void (*init)(struct list** const current);\n    \/* push item on current context (stack) *\/\n    void (*push)(struct list** const current, void* item);\n    \/* pop item on current context (stack) *\/\n    void* (*pop)(struct list** const current);\n    \/* peek item on current context (stack) *\/\n    void* (*peek)(struct list** const current);\n    \/* destroy context *\/\n    void (*destroy)(struct list** const current);\n};\n\n\/* queue\/list: vtable *\/\nconst struct list_vtable list_vt;\n\n\/* default list methods *\/\nvoid list_init(struct list** const current);\nvoid list_push(struct list** const current, void* payload);\nvoid* list_pop(struct list** const current);\nvoid* list_peek(struct list** const current);\nvoid list_destroy(struct list** const current);\n\n\/* list vtable *\/\nconst struct list_vtable list_vt = {\n    .push = list_push,\n    .pop = list_pop,\n    .peek = list_peek,\n    .init = list_init,\n    .destroy = list_destroy\n};```","844":"Что ты этим хотел сказать?","845":"Да не, нормально)","846":"Я такой в продаже не видел","847":"strchr вдохновлялся?))","848":"как его вообще возможно использовать..","849":"Ладно, кривая формулировка, ну вы поняли...","850":"printf(\"%d\", sum);\n\nа попробуй это\n printf(\"%d`\\n`\", sum);","851":"что за бред-то?","852":"быстрее не будет ни в одном из этих случаев, sad but true","853":"где \"там\"","854":"тру спич. трение - сила.","855":"Т.е. допустим у нас интерфейс \npush(&node, data);\n\nЗначит у нас до этого лежал node на стеке? А как с ним работать тогда, если он на стеке?\nНет, он должен быть указателем, чтобы данные лежали независимо от жизни функций, поэтому list_create_node() возвращает указатель. И адрес на этот указатель будет передавать в push()","856":"Как думаете для гейм деву лучше будет c++ или c#? Я про движок игры🤔","857":"Ну смотря когда вы заканчивали. Я вот просидел 6 лет и в итоге, практики было вообще мало, куча теорий и парочку фишек. Все остальное подчерпнул из работы вне универа, в целом сложилась картинка такая \"Лучше либо было купить бумажку и просто работать или вообще не идти на ВО, ибо потратил кучу времени и был в вечной загрузке\"","858":"Ну и двумерный массив с 4 столбцами не может быть из 6 элементов","859":"египетская силушка","860":"Раст","861":"Там проблема в указателях, нашел такую статью, правда на английском, https:\/\/www.benjaminwuethrich.dev\/2015-03-07-sorting-strings-in-c-with-qsort.html","862":"так воно ж викликается, почитай трохи","863":"https:\/\/github.com\/skeeto\/ptrace-examples\/blob\/master\/minimal_strace.c","864":"Так, а ты про какой head? Который в LIST?","865":"Но мой код же не летит, работает","866":"Я тоже стараюсь использовать указатели при итерациях в циклах)","867":"longlong param_3;\nint local_a4;\n\n *(byte *)(param_3 + local_a4) =\n             *(byte *)(param_3 + local_a4) ^ *(byte*)(param_2 + local_a4);","868":"в принципе, так можно и оставить","869":"пока всё","870":"вот мне тож об этом сказали прост скопировать","871":"во1 https:\/\/t.me\/lame_c\/23055\nво2 можно привести к дробному если домножить на `1.`","872":"Но отладчик никогда не помешает","873":"На C пишется Gui c DE или эту нишу занял ++ ?","874":"Ведь sizeof(void) == 1.","875":"я думал ты про .a или .so","876":"Ну если сильно хочется, то добавляешь книгу к курсу","877":"привет! я подтянул расчетную часть куркулятора в qt creator использовав extern «C» по твоему совету.\n\nтут вопросик, он вроде считает, но через раз. иногда пишет что программа аварийно завершилась. иногда дает неправильный ответ, примерно из 10 нажатий на зеленую кнопку сборки выдает 5 раз правильно, 3 раза ошибку аварийного завершения, и 2 раза врет с результатом.\n\nвопросик, может я чтото делал не правильно?\n\n1. указал #include «calc.h» с extern «c»\n2. создал обьектные файлы командой. gcc -c calc.c\n3. добавил их в Cmake\n\nну и создал тестовую строку в функции main.cpp и оттуда пробовал запускать функцию потом печатал в терминал","878":"но ничего из этого не даст 100% гарантии трудоустройства :) \n\nпоэтому рассылай резюме уже сейчас и параллельно учи что-то из списка выше.","879":"синтаксичесий","880":"На есп ток","881":"ну в натуре неуместно. я с тобой согласен стасон, но не тут","882":"а вообще: \n\n`man strncpy`\n\n```Warning: If there is no null byte among the first n bytes of src, the string placed in dest will not be null-terminated.```","883":"пробовал sprintf, но он в цикле перезаписывает на тот же адрес","884":"","885":"да, если есть чужой код, то не надо его использовать, пиши свою реализацию. и опыт, и польза, и все свое","886":"Мне известны два варианта разделения:\n1. Фронт - то, что превращает код на ЯП в какой-то IR. То есть лексический, синтаксический и семантический анализ. Бэк - оптимизатор и кодогенератор.\n2. То же самое, но часть после анализаторов делится на мид-энд (оптимизатор) и бэк - кодогенератор.","887":"А знаешь почему? Потому что он такой какой есть, а не стремился стать программистом)","888":"Что-то типа cat \/dev\/ttys001","889":"Самый популярный это наверное пэхэпэ и джабаскрипт.","890":"это не ты случаем уходил раст учить?","891":">геймдев\nможет бьіть потому что там С++ стандарт?","892":"если нас интересует несколько ячеек памяти последовательных - мы можем просто брать наш указатель, прибавлять отступ от него - и читать соседние ячейки","893":"Ты о чем?","894":"по этому принципу рабатает \nint var = myarray[i]","895":"Объясните пожалуйста как можно изменить объем памяти в статическом массиве ?","896":"+","897":"uefi это печатный стандарт, который может реализовать каждый. А bios это совокупность проприертарных закрытых поделок.","898":"хотя бы на этапе принципиального решения задачи. оптимизации - потом","899":"теперь не получим обувь по скидке(","900":"а, партонти","901":"Эх, ну всё, началось((","902":"А в указатель мы что присваиваем? :D","903":"в каком случае?\nhttps:\/\/pbs.twimg.com\/media\/C72o7mvXUAApzQh?format=jpg&name=4096x4096","904":"Я не утверждал, что считаю его низкоуровневым, но хотел сказать, что многие готовы оспорить утверждение, что он высокоуровневый","905":"мы говорим о работе","906":"Но тут есть и другие моменты","907":"я","908":"Ну тут долго спорить можно кто крутой кто нет\nШарпы просто дружелюбные по синтаксису и системным либам","909":"Когда я смогу получить спутниковое тиви от независимого провайдера?","910":"define старший","911":"да все равно та же ебола","912":"1 9 2 4","913":"Из МФТИ выходят очень грамотные специалисты, получают больше десяти, гораздо","914":"Смотря что тебе надо","915":"Начинать тоже правильно нужно","916":"последний ответ самый полезный","917":"Win API гораздо логичнее POSIX.","918":"Можно, конечно, юзать питон с джава интепритатором, но это сесть на две бутылки сразу. И это офтоп, так что админ может посадить на третью","919":"О, и вправду в 2.28 появились, не прошло и 3 лет =)","920":"Можете сразу скинуть нужную ссылку, если хотите помочь. 😁","921":"Удали папку build со всем что в ней есть:\n\n`cd ..\nrm -r build`\n\nИ попробуй ещё раз по коммандам пройтись начинай с mkdir build","922":"Пример на моём абстрактном языке:\n```i4 example1 = 45;\ni4 example2 = 67;\nasc example3 [example1, example2];\n\ni0 main():\nprint( example3[1, 2] )```","923":"А у вас есть опыт работы с языками С\/С++?","924":"Должно","925":"Добрый вечер, пытаюсь сделать функцию, которая вызывает другую функцию с неизвестным кол-вом и типом аргументов внутри себя.\n\nвот прототип:\n```void f(void *(*func)(void *, ...), void *args, ...);```\n\nЕсли не совсем понятно объяснил, то мне нужно что-то на примере \n\n```def func(a):\n a\n\ndef func2(c, x):\n print(c+x)\n\nfunc(func2(2,5))```","926":"Хорошо","927":"@vscode_ru","928":"print('Hello, python!')","929":"Может return не в том месте?","930":"Но его тут нет, всё согласно стандарту","931":"Через fseek ему частями обрабатывать не как?","932":"Есть rvalue ссылки","933":"что мешает выучить что-то еще что-бы не страдать фигней?","934":"","935":"Поясни, что во что и когда именно преобразовывается?\n\nМожет я терминологию не догоняю","936":"если код целиком, то будет сложно.\nтам обвязки есть, выпиливать долго придется","937":"исчерпывающую информацию ты получишь от Таненбаума.","938":"struct class;","939":"Вот","940":"Быстрее си?","941":"Отлично. Что лучше использовать для нехитрого гуя?","942":"А как же gtk?","943":"Сайт писькософтов говорит 2048 байт, стаковерфлоу 4096, выбирай","944":"зато ученик вежливый, говорит спасибо, профит.","945":"Так же, как одномерного.","946":"Каеф постоянная рубрика шиза в лейм Си.","947":"учи ассемблер, си - не очень для hardware-level","948":"поэтому это юзаю","949":"Не всегда","950":"ну конечно не одно и то же\nно array в выражении преобразуется к типу указателя, выяснили же уже))","951":"Разве что 32 битная чуть больше  будет печатка кристалла","952":"ну тогда Sublime","953":"В vim в split тоже терминал открыть можно","954":"Может ты перепутал, наоборот говорили?","955":"как я понял)","956":"это не моя конфа слава богу и мне на неё супер похуй, я вижу димдима пересылаю его сообщения сюда","957":"А админу должно быть похуй на таких шутников","958":"сколько информации, столько и ответов)","959":"я бот","960":"А у меня трехтомник кнута уже 10 лет, и все зарядка не садится","961":"И дешевле","962":"Введи E","963":"Делаю лабу 👍👍👍👍","964":"вообще нужно написать алгоритм который будет подставлять вместо пустых мест нужные буквы","965":"А, ахах)","966":"`\/* инкапсуляция *\/\n\ntypedef struct cat {\n    int position;\n} cat_t;\n\n\/\/ конструктор\ncat_t *cat_create(int position);\n\n\/\/ деструктор\nvoid cat_destroy(cat_t *self);\n\n\/\/ метод\nvoid cat_move(cat_t *self, int delta_position);`","967":"int nn = n\nздесь идет преобразование испорченного дабла флоатом в целое число с округлением, возможно, до целого.","968":"Посчитай, чему равно `limit - arr`.","969":"Нет, передай в предыдущий адрес NULL и все будет збс","970":"Да, это норм, только ещё один ручной уровень абстракции -> лишний код, да и чтобы эту функцию вызвать нужен экстеншн гну (атрибут конструктор), т.к. в противном случае будет мерзкий костыль.","971":"в выпадающем списке выбери clang (не clang-cl)","972":"я вспомнил эту функцию)","973":"То, которое используется для коммерческой деятельности","974":"а зачем пробел?","975":"Ясно, тролль(","976":"Раньше хотябы что то читал XD","977":"Сделай сначала в 4 разных условия для каждой точки. Потом можешь сократить.","978":"Этот lseek ?\nhttps:\/\/man7.org\/linux\/man-pages\/man2\/lseek.2.html","979":"Тем, что код безопаснее, потому что ты не стреляешь себе в ногу, и тем, что код короче, что упрощает его читабельность и переносимость","980":"привет! может кто-то поможет, в stackoverflow, ничего путного не нашлось. у меня есть таск, где нужно соединить JSON keys в одну строку во время итерации всех ключей.\n\nна конечном уровне у меня выйдет что-то типа \"key1\/key2\/key3\". мне нужно посчитать, сколько \"\/\" присуствует в строке, чтобы понять, на сколько \"уровней\" вернуться назад. и вот непонятно, как посчитать кол-во определенного char в char array?","981":"","982":"uint32_t tess_mode : 2;\nЧто будет значить 0, что будет 1, что будет 2, что будет 3?","983":"а что вообще есть из кода написаного?","984":"хз, вроде все нормально","985":"А, это ж ты, щекастый друг)) Ну тогда я не удивлён)))","986":"ага","987":"Красавчик! Пятничный рофл всегда красиво заходит)))","988":"Есть какое нибудь норм объяснение про указатели?","989":"это что там деление + взятие модуля для setbit\/getbit???😱😱😱","990":"да","991":"у админов скромные гастрономические предпочтения раз ради такого берут попкорн. даже срачи в коментах на хабре читать интереснее","992":"Ну это не говоря о том, что зачастую при создании дочернего процесса, который будет общаться через пайпы, к примеру, только с родительским стандартные потоки закрывают из-за ненадобности.","993":"И **НИКОГДА** не пиши `void main()`. `main` должна возвращать `int`","994":"прикольно","995":"Мне сомнительно, что такое возможно. В том же линуксе вроде как такое делать нельзя (по крайней мере напрямую), так что весьма вероятно, что и в винде нельзя.","996":"Скопируй строку и замени символы. В чем вопрос?","997":"Мемкопи заблокировали?","998":"когда работал над ОС, сам писал :)","999":"Разве это не входит в понятие системные библиотеки?"}}