{"text":{"0":"ну так сложилось в последнее время что зачастую \"или\"","1":"https:\/\/ru.m.wikipedia.org\/wiki\/%D0%9F%D1%80%D0%BE%D1%81%D1%82%D1%80%D0%B0%D0%BD%D1%81%D1%82%D0%B2%D0%B5%D0%BD%D0%BD%D0%B0%D1%8F_%D0%B1%D0%B0%D0%B7%D0%B0_%D0%B4%D0%B0%D0%BD%D0%BD%D1%8B%D1%85","2":"Это пустой треп получается.","3":"кажется суккес","4":"Я так понял есть две сошки, и все. Так?","5":"т.е получается, что этот SDK не имеет доступа к HAL ?","6":"портировать исходников нет","7":"пример с перетиранием:\nset(CMAKE_C_FLAGS \"-g0 -O0 -fno-exceptions\")","8":"так может это и цель...","9":"Спасибо","10":"спасибо, попробую","11":"какие либы собираешь?","12":"на dou.ua есть виджет зарплат","13":"а у data в нём extras null\n:(","14":"https:\/\/github.com\/TimScriptov\/ModdedPE\/blob\/ModdedPE-JAVA\/app\/src\/main\/java\/com\/microsoft\/xal\/browser\/WebKitWebViewController.java","15":"точно точно, я даун","16":"Завязывайте с политикой. Тут не об этом чат.","17":"#whois java developer. Переползаю на котлин, понадобилось разобраться немного с ndk разработкой","18":"Добрый день!\n\n1) Как можно установить на каждую видео своё изображении?\n\n2) И как можно сделать размер одинаково?","19":"Сейчас буду дальше работать, не люблю библиотеки","20":"аа ну ок","21":"Естественно. Я привел их как пример, потому что это продукт гугла. А у гугла такое изврашение \"codelab\". Но хоть что-то. У других, нормальных людей, просто нормальная внятная документация.","22":"это C++ либа я её партирую на android","23":"Именно поэтому ему там уже было предложено обернуть во что нибудь то, что он хочет менять","24":"Там можно поставить студию из стора?","25":"а с чем связана такая политика? чем лучше ndk-build?","26":"А подробнее?","27":"во время запуска","28":"would the library be REQUIRED to be Re-Entrant?","29":"нет никаких плюх конечно для коммерческих разрабов","30":"Всем привет) ребят спрошу глупость, у меня есть библиотека в so , я ее кладу к проекту когда компилирую у нее контрольная сумма меняется, подскажите пожалуйста как можно сделтать так чтобы она не менялась?","31":"У меня сильно заметно","32":"Это ентерпрайз","33":"а мидл что должен уметь?","34":"ну чего скажешь?","35":"В чем затык ?","36":"Кстати, если в этом чате есть андроид мидл разрабы, которым нужна работа. Можете написать мне, возможно смогу подкинуть работу.","37":"Как можно собрать?","38":"да","39":"@Allockye \nхороший вопрос\nсам в похожую ситуацию попадал\nтоже интересно что думают по этому поводу\n\nя лично считаю что всё равно надо пробрасывать через presenter\nт.е.  onSignUpLinkClick - это функция которая НЕ показывает экран регистрации, а ВАЖНО запускает процесс регистрации\nа вот presenter уже решает что будет проихолить в этом процессе\nнапример ты просто вызываешь view.navigateToRegisterScreen()\nа потом ты добавишь ganalitics и уже вызываешь две функции\nview.navigateToRegisterScreen()\nganalitics.navigateToRegisterScreen()\n\nнапример😊","40":"mvp пример до кучи https:\/\/github.com\/LiveTyping\/u2020-mvp","41":"вот пример:\nмессенджер должен на любом устройстве отображать на иконке бейдж  с количеством непрочитанных","42":"@Sola2Be \nэто по моей проблеме?)","43":"А ещё?)","44":"хочу применить к приложению, читаю https:\/\/medium.com\/@patrykpoborca\/making-a-best-practice-app-4-dagger-2-267ec5f6c89a#.bag8f8q04 есть вопросы. Основной — что требуется дописать чтобы зараобтало?","45":"Зачем называть поля одинаково ?","46":"hmm https:\/\/source.android.com\/devices\/sensors\/batching","47":"централизованные создания\\изменения переменных отвечающих за стили","48":"и не один клиент :D","49":"я к тому что ты сам что хочешь то и называешь еррором, что хочешь то и считаешь нормальным ответом","50":"Да, без абстракции на Java и Котлин","51":"ого политика запрещена","52":"Выступает в роли гипервизора и заменяет гипервизор это совсем разные вещи","53":".","54":"Удалил в компонентах 3.10, установил 3.18, сделал Refresh linked C++ projects - она опять выкачала 3.10","55":"а общался телевизор для поваров с кассой, в закрытой локалке, так что норм","56":"много мороки было?","57":"android vnc server?","58":"хедеры вообще используются только при компиляции. в билде нет такого понятия вообще","59":"И все таки си бОльшим числом платформ может поддерживаться нежели джава","60":"тоже такая проблема","61":"Или если у тебя уже есть программа на C++ и ты хочешь её перенести на андроид. Переписывать всё на java? Нет спасибо","62":"","63":"Начинающий. Проект: \"Карта своего города\"\nУзнал из другого чата:)\n#whois","64":"при этом фон у уарточки прозрачный, а у вложенного лайаута цвета фаб","65":"Просто меня бесит он жестко, когда после 3-4 часов работы в студии все дико тормозит, ждешь когда сбилдится проект по 5-10 минут","66":"На x86 работает нормально, s6 полагаю armv7","67":"я пытаюсь строку засунуть в массив byte-ов","68":"Капчу можно распознавать руками индусских младенцев за смешные деньги, не говоря уже про машиное распознавание.","69":"ну так же как и с java кодом, когда тебе нужна функция в нескольких местах – вынеси её в общее место, откуда оба класса будут ей пользоваться","70":"текстовая игра. про движки тоже хз какой взять","71":"Недавно встретил lua в sls хабе. Там простенький микроконтроллер и вполне себе шустро обрабатывало все. Жаль что спалил железку...","72":"эта штука висит у Foreground Service","73":"в параметрах компилятору","74":"Если есть какое-то значение, которое отличается между запусками то чем это не параметр?","75":"Спасибо, пойду изучать","76":"критикуешь - предлагай","77":"оказалось в моём контексте он вовсе не нужен","78":"а что в цикле происходит?","79":"У браузеров все меню ушло в кнопку меню справа под табами","80":"Просто я уже пять лет в теме, и знаю что говорю)","81":"Есть канал с вакансиями - пишите туда","82":"Добрый день всем. Пытаюсь скомпилировать свой проект, ругается, что не видит mbstate_t и sigset_t где-то у себя в недрах NDK. Собираю из под винды. При этом если тот же самый проект запускать на линухе, то проект собирается. То есть я так понимаю, что дело в тулчейне. Кто-нибудь с таким сталкивался? Подскажите пжл, куда копать. Можно конечно на линух переползти, но как-то не хочется пока.","83":"я подключил ffmpeg условный, из него использую пару функций, которые в свою очередь используют какие-то другие ffmpegовские функции. но ведь там всё равно используются не все. поэтому мне и интересно, неиспользуемые включаться в билд не будут?","84":"","85":"не актуально.......","86":"почему так происходит ?","87":"то есть вариант 100% рабочий","88":"😹😹😹","89":"То прилагу купить, то лабы сделать, то моник починить.","90":"хотя бы хэш, а не размер","91":"Всем привет","92":"вроде ок книга, но найти не могу","93":"А это что?","94":"OS: Windows.\n\nЯ правильно понимаю, что поддержка `std::thread` недоступна в `MinGW`, а только в `MinGW-w64`?","95":"Точно такая же проблема была на днях, юзай внутри сервиса startForeground","96":"Ясно. В открытом виде нет codelabs и tutorials ,  на подобии \nhttps:\/\/developer.android.com\/courses\/android-basics-kotlin\/course\nhttps:\/\/developer.android.com\/courses\/android-basics-compose\/course","97":"первую ссылку посмотри","98":"corona 😂","99":"You may also say that DAC does make sense in this chain, but it would be an overkill","100":"[[self] moveToIos];","101":"Там без доната вполне неплохо, даже не нужен он","102":"Не, пока не смотрел. Мне придется довольно много переделывать, чтобы на Native Activity переехать, так что пока не копал в ту сторону","103":"Приглашаем мобильных разработчиков с опытом от 2 лет на Mobile Hiring Week от EPAM!\n\nПройдите интервью и получите оффер за 24 часа🔥 А к нему приветственный бонус в размере одного оклада!\nПодать заявку: https:\/\/epa.ms\/mobile-h-w-1\nМы ищем Android-, iOS-, Flutter- и RN-разработчиков. У нас множество проектов с самыми разными технологическими стеками.\n\nВ основном наши заказчики — зарубежные компании (Америка и Европа). Отлично, если ваш уровень английского — Intermediate и выше. Если нет, у нас есть русскоязычные проекты и бесплатные курсы английского языка.\n\nПрисоединяйтесь к нашей команде мобильной разработки!","104":"ну да, но для новичков самое оно","105":"You will blow your ass off in android trying to accomplish this","106":"В Андроиде","107":"Вроде на одном старом девайсе пожие проблемы были. Старый adb на телефоне падал при подключении. Если зрутован - можно посмотреть на телефоне в папке tombstones падает ли adb демон.","108":"Я сделал","109":"юнити + с# норм будет для обычного платформера с парой действий?","110":"Нашел лишь libmicrohttpd от гугла...","111":"но плеер нормально работал","112":"впервые слышу, ну ок, нагуглил уже, какой-то придуманный искусственный язык.","113":"Скачал android-ndk-r21e-darwin-x86_64.zip, распаковал в opt, добавил path, получаю\nuser@mac` ~ % ndk-build \nERROR: Unknown host CPU architecture: arm64`\n\nuser`@`mac` ~ % arch -x86_64 \/bin\/bash -c ndk-build\narch: posix_spawnp: \/bin\/bash: Bad CPU type in executable`\n\nКак можно запустить ndk-build?","114":"Понятно, спасибо!","115":"Captain Lazerbeam:\nhttps:\/\/gitter.im\/rus-speaking\/android-testing","116":"Really","117":"Есть картинка в форме сердца,  в приложении генерируется случайное число от 0 до 100 и в зависимости от числа необходимо начать заливать картинку другим цветом снизу вверх на количество процентов,  равное этому числу","118":"http:\/\/developer.alexanderklimov.ru\/android\/views\/webview.php","119":"EditText умеет обрабатывать сохранение\/восстановление","120":"1200","121":"","122":"Есть тут кто?","123":"Я сейчас не за компом (","124":"а как подобную задачу решали на пс есть понимание?","125":"Второе","126":"То есть, 2.0 сейчас - это около 5% пользователей","127":"Вот это топ. Мне бы это кучу времени сэкономило весной😂","128":"Если начать с веба, к C++ ты так и не придёшь. Это вещи параллельные и далёкие","129":"Sudo","130":"Ошибки обычно подчеркнуты. Это не ошибка","131":"Unity?","132":"и еще PROPERTIES ARCHIVE_OUTPUT_DIRECTORY изменить?","133":"with about 3.6k lines","134":"Yeah, no Vitally - no great school 😢","135":"Also there is another one I want to enable audio pass through in exoplayer in s\/pdif output this one is high priority any idea how to do it http:\/\/www.himediatech.com\/h8core.html  I am using this android box","136":"Вообще не относится если быть точнее)","137":"А он рядом с .с лежит?","138":"я просто подумал может я упустил что-то)","139":"50ms to 100ms is also acceptable as long as it is loopable without any pauses in playback","140":"День добрый. Сегодня столкнулся с ошибкой \"error: redefinition of 'exception'\"","141":"Гуглите где заголовок для нужной функции и инклюдаете его.","142":"Пункт 5.2","143":"ниче вы тут разогнались","144":"В жавабайт-код руками переписываешь","145":"Ребят, а кто нибудь роболектрик юзает для тесто","146":"Можно опрашивать андроид из java (в том числе System.getenv(env)), или из ndk, std::getenv()","147":"Те если стартанули свой поток - нужно заатачить jvm к нему","148":"Всём доброго времени суток)) Кто нибудь применяет в разработке ChatGPT??? \nХотим организовать митап на тему \" Использование ChatGPT в разработке мобильных приложений \" И ищем спикера который разбирается в данном вопросе и уже применяет ChatGPT на практике при разработке и может и хочет поделиться знаниями. \nЕсть ли такие специалисты отзовитесь пожалуйста)))","149":"ааааа","150":"Так можно сделать webView и отображать в нем карту с локального файла js в котором будут вызываться аякс запросы на сервер","151":"","152":"вот text это текст из эдиттекста","153":"А. Хотя если на всех, то хз","154":"Странный метод. Какой-то тинт колор ему еще нужен, помимо из цвета из параметра","155":"вообще самсунг отличается тем что сильно модифицирует фреймворк андроида и сам jvm","156":"Так и делаем. Но у нас смена .proto файлов - это все же редкость.","157":"казиношки делать?)","158":"Вот моя замедленная, но это не совсем что я хотел","159":"офтоп. hr пусть ищут работников в @mobile_jobs","160":"короче я всё понял, вот будет группа для Android и iOS разарботчиков, т.к. что-то найти не удалось такую. Может кому интересно будет @mobile_dev  гоу, пацаны, я создал","161":"А еще тут","162":"а уже есть 1.1","163":"Бред, v8 -  0,2%","164":"ну, кому-то нравится, кому-то нет","165":"ну я пересчитал типичную зарплату джуна - выходит приблизительно 2-3 бакса","166":"То есть у вас есть java код, который вызывает нативный код, в котором должно быть завершение?","167":"Можно после обновы студии пол проекта перебрать","168":"Разве 24 бета?","169":"просто `target_link_libraries(myclasstarget other_so_target)`","170":"ну как","171":"Ребят, помогите советом. Я - начинающий. Уже прочитаны head first android и Phil Dutson - Android Development Patterns. И тут появляется вопрос: 1) идти дальше по книгам, таким как Android Design Patterns(Greg Nudelman) (или любые другие книги) либо 2) идти изучать библиотеки(планирую RxJava, Retrofit, EventBus)?","172":"если через патчинг ядра мэджиском, то да","173":"Это опенсв? Наверное да","174":"Сложно если честно назвать это драйвером , ибо это просто прокладка","175":"а ошибка то какая при падении","176":"Затри слова после linphone-sdk","177":")) Аккаунт сменил. Со старого вышел. Теперь этот актуальный","178":"он заплатил команде разработчиков и она написала телеграмм","179":"да, здесь был, именно отсюда и срисовывал реализацию )","180":"Это что за группа, попытался найти - не находит","181":"ты клавиатуру кастомную пишешь? я чет пропустил","182":"Добрый день. Я начинающий разработчик. Пытаюсь освоить NDK.  Как такового проекта нет. Как и места работы)","183":"И да, почему глупо?","184":"очевидно что за компом удобнее курс смотреть","185":"See `config.log' for more details","186":"можно получить псевдочитаемый код на С","187":"Перед  выполнением заказа","188":"Ребят, вы как потоки убиваете? Сегодня столкнулся с проблемой при throw new MyExeption, не получилось безопасно завершить поток","189":"понял, спасибо","190":"np.","191":"Также примернл","192":"Можно посмотреть логи cmake. Может там что вразумительное будет.","193":"TextView still takes 2.3 seconds","194":"no","195":"","196":"Посмотрю потом дома, просто я помню что отказался от recyclerview, т.к. побольше с ним работы было, а очевидных преимуществ я не заметил. Ну раз более опытные люди говорят, что листвью - прошлый век, то прислушаюсь","197":"Ты скорее всего пропустил то что по умолчанию эта активность все события делегирует тебе","198":"Ага","199":"хз как там со сторонними зависимости будет, тип сможет ли qt пользоваться сетью из под андроида 🤔\nно тут уже как qt адаптирован и как CMake напишешь","200":"юзай","201":"в 90% случаях","202":"Ответы на вопросы для учебы лучше вам самим находить. Начните с того что такое Android в этом вопросе. Если в контексте ndk - стандартные механизмы доступные в c\/c++. Mutexы, атомики, можно очереди сделать итд","203":"Номер версии можно в списке глянуть в настройках )","204":"я так понимаю человеку нужно сам исходник обсфусцировать так как он его передает","205":"Android JNI Excel","206":"Всем привет. Подскажите, каким образом можно добавить определённый параметр к каждому билду при помощи gradle? Например, я хочу чтобы каждый запуск приложения в студии происходил с аргументом `--profile`","207":"Хочешь задачки с ndk, да не вопрос) сделай работу с камерой )))) без участия SDK)))","208":"А вне состава зиготы тв свой код проверял?","209":"А сейчас я хз","210":"Доход решил поднять?))","211":"Великий разум говорит так:","212":"🧐что там?","213":"у меня на слабеньком ноуте работает вполне нормально (win 10, 12 gb ram, без ssd). avd стартует за меньше чем 30 сек","214":"и не нужно говорить что так и должно быть","215":"Винда точнее","216":"Указал полный путь, все равно не работает","217":"а ты я вижу шутки пишешь)","218":"Супорт и v4","219":"а по простому?","220":"Можно","221":"Сам подумай. Тут нужен дизайнер+ мобильный разработчик+ серверный","222":"Спасибо, но заливаю именно бандлы, больше нет идей?","223":"вот пример как выглядит executable формат","224":"Всем привет,  совсем недавно начал интересоваться системным программирование под андройд. \nПока нашел единственную книгу Roger - Android system programming. \n\nПорекомендуйте еще книги на эту специализацию. А лучше онлайн курсы.","225":"Не знаю,  может в группе уже кидали,  но есть книга","226":"сейчас проверю","227":"прикрутил toleftOf","228":"Ага на веб асме :)","229":"+ в ndk r10 (e) нету тулчейна для cmake( но его можно взять из другого ndk)","230":"в CMakeLists.txt так и сделал, разве нет?","231":"Это тупо фича их билд системы","232":"Потом вызывать так:\nИмяКласса.ИмяФункции?","233":"а как они должны выглядеть?","234":"вот насколько помню haxm конфликтует с микрософтовской виртуализацией","235":"Скиньте сюда проект - посмотрим ( ссылку на репозитарий )","236":"Если процент по всем ядрам, то видимо дело в том что нет потоков внутри","237":"Нашел такой вариант, буду тестировать\nJNIEnv* env;\nstate->activity->vm->AttachCurrentThread(&env, 0);\n\nconst char *adr = \"https:\/\/play.google.com\/store\/apps\/details?id=com.example.app\";\njstring sURL = env->NewStringUTF(adr);\n\njclass cUri = env->FindClass(\"android\/net\/Uri\");\njmethodID mParse = env->GetStaticMethodID(cUri, \"parse\", \"(Ljava\/lang\/String;)Landroid\/net\/Uri;\");\njobject oUri = env->CallStaticObjectMethod(cUri, mParse, sURL);\n\njclass cIntent = env->FindClass(\"android\/content\/Intent\");\njmethodID mNew = env->GetMethodID(cIntent, \"<init>\", \"(Ljava\/lang\/String;)V\");\njfieldID fACTION_VIEW = env->GetStaticFieldID(cIntent, \"ACTION_VIEW\", \"Ljava\/lang\/String;\");\njstring sACTION_VIEW = (jstring)(env->GetStaticObjectField(cIntent, fACTION_VIEW));\njobject oIntent = env->NewObject(cIntent, mNew, sACTION_VIEW);\njmethodID mSetData = env->GetMethodID(cIntent, \"setData\", \"(Landroid\/net\/Uri;)Landroid\/content\/Intent;\");\nenv->CallObjectMethod(oIntent, mSetData, oUri);\n\njclass cNativeActivity = env->FindClass(\"android\/app\/NativeActivity\");\njmethodID mStartActivity = env->GetMethodID(cNativeActivity, \"startActivity\", \"(Landroid\/content\/Intent;)V\");\nenv->CallVoidMethod(state->activity->clazz, mStartActivity, oIntent);\n\nstate->activity->vm->DetachCurrentThread();","238":"Эта проблема постоянная","239":"Я сначала запускаю свое активити, потом активити лаунчера, и в стороннем потоке выполняю нужные действия","240":"https:\/\/crates.io\/crates\/pbkdf2","241":"для сервера то?","242":"Там и правила и как что","243":"@KoderBober примерно такой Android.mk у меня получился тогда http:\/\/pastebin.com\/raw\/ra04Aix2 Там ещё eigen цепляется и protobuf_static. Первый - только инклуды, собирать ничего не надо, второй - в инете много мейкфайлов.","244":"В винде был такой принцип - ищем камеры, ищем их форматы, создаём подключение, инициализируем контекст, выбираем Настройки - начинаем сессию, думаю, что тут примерно тоже самое судя по апи","245":"и шлюхами","246":"Не только 10","247":"","248":"Прятать -","249":"Есть кто который можеть работать над android  программой","250":"Мне сейчас вот такое надо зарефакторить, пока не понимаю как","251":"Ну я видел человека с такой ставкой","252":"У меня явно чаще, чем раз в 10 секунд, не замечал никогда проблем. Но надо обратить внимание, спасибо.","253":"Уровень лога попробуй выше, убедись, что в логкате фильтр не используется. Другие-то записи с устройства в лог выводятся?","254":"And then you can set your pixels","255":"Логики много, на виндовс можно и использовать winapi, но как сделать под андроид вообще не понимаю.","256":"А про написание логики на C++ сломано уже столько копий, что даже не очень хочется начинать. Где-то это необходимо, где-то допустимо, а где-то лучше не надо. Кажется. что мировая практика пришла к тому, что во всяких бизнес приложениях этого стараются не делать по разным причинам, не только техническим.","257":"спс","258":"народ вопрос немного нубский. функция getTextSize возвращает размер текста в пикселях, как его перевести в SP размер?","259":"should i just implement my own `dispatchTouchEvent` instead of using Android’s default for `View` and `ViewGroup` ?\n\nas i cant find much online on how other people implement it as everyone just calls `super.dispatchTouchEvent`","260":"Имею ввиду","261":"это хорошо, но доков и примеров вообще нет(","262":"Я не спорю, что ее можно скачать. Но комьюнити версия она \"не бесплатная\", у нее есть лицензия","263":"configure && make?","264":"Товарищи. Android Studio при создании приложения с нативной частью генерирует cmake скрипт. А тут у меня внезапно вылез модуль с Android.mk. Я таки погуглил, что ndk-build, который с ним работает - это какая-то альтернативная система сборки. Как с ним положено работать в студии? Оно сочетаемо с CMake?","265":"это понятно, а где увидеть все стили, может guide какой нибудь есть в котором они представлены","266":"Платформа?","267":"https:\/\/github.com\/openai\/whisper","268":"после этого курса можешь взять посложнее","269":"А можно просто скачать Библиотеки и все","270":"Здесь вроде как написано, что proguard работает только с Java.\n\n__Because ProGuard can only inspect Java classes, it will not know about any usages that happen in native code.__\n\nhttps:\/\/medium.com\/androiddevelopers\/practical-proguard-rules-examples-5640a3907dc9","271":"You might want to write extern \"C\"","272":"А что ты ожидал? Что в ANDROID_API будет таргет, а не минимум?","273":"@Molbert \n2) куда bundle запихнуть?\nвопрос актуален","274":"Спасибо, почитаю","275":"https:\/\/github.com\/A-gambit\/awesome-telegram-chats","276":"Может быть переизбыток local reference?","277":"Спасибо. Всем спасибо.","278":"Какие ошибки возникли?","279":"Как говорил когда то мой преподаватель не создавай велосипедов которые уже созданы )","280":"Ты просто играл мало","281":"custom view","282":"кто-нибудь пробовал android.R класс найти? не могу найти информацию о нем, только о R классе приложения","283":"Прям по запросу","284":"","285":"а ведройд вижену не пробовал скормить? по крайней мере штрих-коды и лица он хорошо находит","286":"```externalNativeBuild {\n            cmake {\n                arguments \"-DANDROID_ABI=armeabi-v7a\"\n                cppFlags \"-std=c++11 -frtti -fexceptions\"\n            }\n        }```","287":"i know","288":"Из-за этого хочу мак","289":"Что это такое?","290":"После того как собрали apk\/bundle нужно вызвать комманду \n`.\/gradlew uploadReleaseSymbols`","291":"Да","292":"Как раз только что про это хотел тут спросить. Только мне немного другое нужно)","293":"поменял на `mavenCentral()`, все тоже самое","294":"прописал path до ndk","295":"работать должно. на крайний случай можно intel  версию заюзать. будет чутка медленее но будет работать 1в1","296":"https:\/\/developer.android.com\/ndk\/downloads\/revision_history","297":"Он защиту в нативе сделает","298":"загуглите как из ассетов скопировать файл в папку приложения, дальше что угодно","299":"То презентер не должен знать что работает с активити или фрагментом","300":"https:\/\/github.com\/molind\/crosscompile","301":"","302":"погуглил - не понял как это использовать. не подскажите куда рыть?) я еще совсем чайник, раньше никогда не работал с нативом","303":"С новым годом всех у кого он наступил! : )","304":"зависимости в `gradle,build` прописываются","305":"Но я хочу сейчас на фултайм в офис в другой город переехать","306":"Багов критических пока не замечено","307":"Место есть, я расширил диск","308":"Я знаю. За это сразу цену накидываю","309":": )","310":"well if you need to do this with 60fps - it is better to use GLSurfaceView","311":"На хабре почитай","312":"похоже на корапченый стек, нужно дебажить по дизасму","313":"Всем привет, может кто подскажет, нужно определять на изображении документ (его границы), есть у кого решение? (без opencv, тянуть её громоздкую в Android очень не хочется)","314":"Пока из всех решений, только отслеживать разницу времени onKeyDown и onKeyUp","315":"just my app and phh.treble.app or something, (with All Processes ticked)","316":"да, без рут, но нужен доступ к файловой системе","317":"Прав не хватит например.","318":"что оффлайн?","319":"так работает, спасибо)","320":"Выбирайте что вам больше подходит и вперед. Но вроде как большиство популярных архиваторов уже есть в мире java. Поэтому если вам надо только сжимать что-то -  jni тут может быть и не нужен ...","321":"Значит надо","322":"Прям 1кк джсон могут отдать?","323":"","324":"ну так вытащи","325":"```set(BOOST_INCLUDE_DIR ${INCLUDE_DIR}\/boost\/include)\n\nset(Boost_USE_STATIC_LIBS OFF)\nset(Boost_USE_MULTITHREADED ON)\n\ninclude_directories(${INCLUDE_DIR})\n\nset(BOOST_MODULES\n    boost_filesystem\n    boost_date_time\n    boost_system\n    boost_thread\n    boost_chrono\n    boost_atomic\n    boost_timer\n)\n\nforeach (lib ${BOOST_MODULES})\n    target_link_libraries(first-lib ${LIBS_DIR}\/boost\/${ANDROID_ABI}\/lib${lib}.a)\n    target_link_libraries(next-lib ${LIBS_DIR}\/boost\/${ANDROID_ABI}\/lib${lib}.a)\nendforeach()```","326":"создать тебе никто не мешает","327":"Привет, а подскажите как файлик для крашлитики сделать что бы было можно как-то прочитать обфусцированный код? Я пробую команду .\/gradlew crashlyticsUploadSymbolsRelease, но что-то она ругается и фейлится","328":"нет, пообщаться","329":"А мне нужно, чтобы друг за другом шли","330":"","331":"да как хочешь на самом деле.","332":"~~@unrealengine4~~","333":"vsem privet rebyata","334":"Ребят, как можно узнать какой view по счету идет известная нам вьюха в каком нибудь контаинере типа LinearLayout","335":"Сейчас мне приходится ползать по их внутренностям с отладчиком и смотреть что в андроиде не так","336":"можно еще раскурочить приложение которое пишет. найти какие api оно использует и от этого отталкиваться.","337":"А как это в .mk сделать?","338":"А ты с чего тестишь?","339":"я, конечно, понимаю, что это часть ндк","340":"вообще фигурирует в оскаме такое понятие как source порт?","341":"Учить китайский мне как-то не довелось, но глаз первое время дергался от алиэкспресского перевода Гугла)","342":"The answer is in your question. The source and the target sample rate.","343":"тк арт уже не сможет его найти по дефолтному пути","344":"Android NDK","345":"@android_ru","346":"я что-то делаею не так?","347":"шикарный апк","348":"Если лень собирать - скачайте руками ту aar которую в gradle. Распакуйте (это просто zip). Там будут и заголовки и собранные либы.","349":"","350":"На китайских этот uuid может быть нул","351":"Текстом, там всё текст","352":"Медленнее чего?","353":"выкиньте замшелый ndk, последними версиями openssl собирается без проблем","354":"достаточно. что-то типа такого, не помню\n`sdkmanager install ndk \"25.1.12345678\"`","355":"Значит нет причин для беспокойства, вся дебаг информация стрипнется на этапе сборки и в apk это не попадёт. А вот для отладки крэш репортов отладочная информация будет очень полезна.","356":"Благодарю! :)","357":"Жизнь программиста трудна :)","358":"Может вынесешь эту часть на сервер?","359":"По-вашему если сделать все поля не статичными то Cmake перестанет выделываться?","360":"не использую java вообще","361":"народ, кто-нибудь знает как работают apk downloader’ы?","362":"Если кому-то интересно, то вот такая таска получилась","363":"here \/\/f-droid.org\/","364":"и ещё много над чем)","365":"там реально изображение?","366":"Ну да, график же - гуголовский","367":"Добрый вечер. Никому с Github action не доводилось работать? Такая ситуация: для сборки либы использую cmake, в котором к части библиотек путь задается через переменную окружения например:\nset(botan_dir $ENV{BOTAN_DIR})\nРепа с инклудниками и прекомпиленной либой скачивается Github actions и путь кладется в переменную окружения через запись\n>> $GITHUB_ENV \nПеред сборкой echo $BOTAN_DIR показывает, что путь в переменной есть, но в итоге, CMake ничего не видит. В чем может быть проблема?","368":"Да нет, вполне успешно переживают (у тебя почему-то капс на это слово)","369":"а вот последний вопрос:\nесли после компиляции через ndk-build я на выходе получаю файл под именем jniLib.so\n\nя могу его переименовать  в другой ? скажем myLib.so и в android проекте использовать под именем myLib.so. Может поэтому падает?","370":"а почему оно должно собирать именно под андроид в таком случае?","371":"isCopy устанавливаешь не ты, а JVM","372":"Rect rect =  tracker.getPosition();\n    int array [4];\n    array[0] = rect.x;\n    array[1] = rect.y;\n    array[2] = rect.width;\n    array[3] = rect.height;\n    \n    return (jintArray)array;","373":"Если студия их автоматом не лепит, то забыл 100:","374":"И причем, что забавно, не просто с новым компилятором, а даже на новых осях. (Билдил на убунту 14 с компилятором по умолчанию, потом билдил на убунту 20 с клмпилем от 14 и падали ошибки, там хедеры как-то не так обрабатывались и надо было просто порядок в некоторых местах изменить)\nЭто не про андроид, а просто про компиляторы ы кодец","375":"Не могли бы вы уточнить","376":"@Molbert \nЯ не понял чем вариант Виталика не подходит?","377":"If this is hard for you then I dont even know what are you doing here in Android NDK discussion","378":"если есть jobject, то создаётся LocalFrame и тут хз со скоростью","379":"Они как-то обещали, что в каком-то последнем они уберут поддердку v7","380":"это, скорее, для изображений","381":"прокси с подменой ответов на лету 🌚","382":"","383":"типо да","384":"Magisk не стоит на месте и развивается","385":"вот фб она еще и тормозная либа, при загрузке тормозит.","386":"Заработало. Благодарю за помощь","387":"asus n550jv - только HDD na SSD заменил + доставил 16 гб оперативки , и DVDrom заменил на HDD","388":"Yes i need fpr kernel","389":"Name и surname объединить и ограничить длинну строк","390":"tho no code for obtaining a Res_png_9patch struct","391":"Нужны исходники. По собранным файлам не получится.","392":"как настроить что конкретно будет происходить по нажатию на эту кнопку например\nзнаете?","393":"все в автобус!","394":"is `std::thread::native_handle_type` garenteed to be implemented via pthread in Android","395":"Сейчас можно использовать Google NDK, или лучше какие-то другие сборки типа Сrystax NDK?\n\nКакой там стандарт c++. Что со стандартными библиотеками?","396":"В угоду тоже","397":"Получается дефолтными средствами не проверить","398":"Я такое сам написал)","399":"Попробуй TargetSDK поставить в 29 и может будет старое поведение.","400":"учитывая что вакансий в городе нет, то и специалистов не особо в городе будет","401":"В MotionEvent есnь `getPointerId`","402":"тогда не удивительно что он их не видит","403":"android shared memory видимо. Это разделяемая между процессами память в андроиде, куда любой процесс может писать и любой может читать. Вкратце так, деталей не знаю. Знаю что у facebook  Fresco туда складывала картинки, чтобы не занимать память процесса.","404":"З 2016","405":"Ну что, как поплавали?","406":"?","407":"Ещё есть подозрение на то, что у вас используется статическая библиотека в бинарном виде. В таком случае её надо пересобирать.","408":"я из Ташкента","409":"и перед этим adb kill-server","410":"товарищи, может кто загружал в телегу файл с ндк?","411":"ну тогда как только ты скажешь что это твоё приложение и ты его написал, а потом не сможешь объяснить как оно с точностью до байта совпадает с опубликованным ранее другим человеком, то автоматом получишь повторный перманентный бан в гугле за обход бана","412":"\"по id фигачить\"\nсделал такой вывод после последнего уточнения","413":"Разве что на экранах с адаптивной частотой имеет смысл.","414":"Нужно сервак перенести на этой технологии на android)","415":"Что-то вида:\n`include_directories(${`PathToOtherLibHeaders`})`\n`target_link_libraries(`libname`\n        PRIVATE `libother`)`","416":"","417":"или подобной софтине","418":"плохо из за ретроспективы","419":"Кто нить в курсе, че йето такое?","420":"Кажется, вам уже намекнули, что вы ошиблись чатом","421":"Должно работать, если они есть в проекте и путь указан правильно","422":"там где инсталл дир","423":"и это не в моей власти","424":"но туда джуну не пробиться","425":"Как в численное json поле отослать null вместо 0?","426":"Кто-то ломал стек и переменная которая хранилась в стеке получала левое значение.","427":"","428":"а то пацаны не поймут)","429":"","430":"На самом деле дело в Priority","431":"Дизайн - да","432":"","433":"Какого то такого специфического правила нет","434":"Почему вынос мозга?","435":"Сравнивать далвик с докером это как соавнивать теплое с мягким","436":"Видел бэкпорты под другие сяоми","437":"Тут тоже интересно.","438":"Понял, спасибо вам за ответ =)","439":"https:\/\/developer.android.com\/ndk\/guides","440":"а MTPro кто-нибудь юзал?","441":"Do you speak english?)","442":"Для чего вы его добавили?","443":"я когда на девайсе мамы (на леново) тестировал приложение, там тоже флуд был аццкий 😄","444":"Ну вот, наверняка у тебя где-нибудь в gl контексте рендер идёт. Туда же можно и аудио закинуть","445":"Фулстэк девелоперы занимаются всем)","446":"Никогда такого не видел","447":"либо -fpic либо -pae","448":"И будет по краям, а в середине дырка","449":"Здесь ндк это очень нишевая штука","450":"деструктор у img и так и так ведь будет вызван при `delete a`?","451":"0_о","452":"кстати, они этот способ деприкейтят и просят в build.gradle указывать:\nThe value for ndk.dir should no longer be set in your app's local.properties file, and support for this ndk.dir setting will be removed in a future version. The Android Gradle Plugin sets the NDK version by default, but if you need a specific version of the NDK, you can set android.ndkVersion in build.gradle","453":"Код максимально тривиален и бесполезен, мне пока что главноре чтобы хотя бы собралось и в консоль вывелось, даже без создания Activity","454":"И очень долго собирать с попутным бегом по граблям. Проще скачать книжку lfs и собрать линукс from scratch. Граблей поменьше на порядок и времени, зато поймешь что получищь с андроидом. Они, кто ведет прошивки - просто инкрементально дособирают. И то долго.","455":"у тебя presenter управляет View  (обновление UI)  или я неправильно что то понимаю?","456":"а значения (entryValues) в ListPreference можно хранить только в массивах строк?","457":"нужно добавить onDestroy метод в презентер и прописать mView = null там","458":"транслятор пакетов","459":"Вот пример создания классов в рантайме","460":"frida.re","461":"А так да, replace и сохраняешь instance state","462":"Логика названий для функций меня порой удивляет ...","463":"спасибо","464":"Есть потребность получить рут. Нужно решить ее. Смекаешь?","465":"Ну вот","466":"Just add sqlite-amalgamation source into your jni code and use it. Easier way is to use java sqlite driver.","467":"Мне на него смотреть даже не особо приятно) как за ним работать?) не, не вариант","468":"Для Android 6 я сделал а на семёрку пока не получилось","469":"Но там нужно ключ с гугл плея","470":"рестарт студии помог","471":"Ты может ещё хочешь руками TomCat написать или глазфишь?)","472":"сдается мне что версии разные","473":"ok","474":"prefab в текущем AS и с новым градл плагином работает.","475":"т.е. что помешает мне  вданном случае создать фрагмент через НЕ пустой конструктор","476":"хитро","477":"Привет всем. Может кто помочь с kernel дайвером (С++)?\nКонкретно проблему вызывает строчка\n#include <ntddk.h>, ругает мол такое не найдено.\nМогу предположить, что это работало в старых версиях VS, WDK. Отдельная установка не помогает.","478":"что есть почитать по дизайну для android ?","479":"ok","480":"я вообще не понял последние 3 сообщения","481":"Эккель в оригинале и golovach courses","482":"Так что теперь буду частым гостем у вас в чате","483":"иетерпретатору байткода пофигу какая она вобщем","484":"Реалм не привязан","485":"дело явно в джеке","486":"","487":"В чем проблема собственно","488":"))","489":"Была идея перекомпилить либу, но потом забил так как для тестового задания это было совсем жирно .","490":"всем привет, у меня вопрос так же про разрешения, если я к существующему приложению добавлю <uses-permission android:name=\"android.permission.VIBRATE\" \/>, вроде как он не потребует от пользователей вручную обновлять приложение на новую версию? кто так делал?","491":"Экран приложения на девайсах 800*400 4 дюйма выглядел некорректно.\nЯ решил проблему заведя отдельный layout для hdpi","492":"Вот это странно. Ести тесты под макос значит и собирает под макос","493":"yes, but how specifically does it do that \n\nassuming the hardware itself does not pre-batch and simply send to driver, eg\n\n`BATCH_START, EV, EV, EV, EV, BATCH_END` as a possible input stream that the OS converts into MotionEvent","494":"есть туторилы , о том как завести open cv","495":"приложение которое делает фотки с рамкой полароида","496":"Впрочем, все зависит от Универа","497":"We dont know what your terminal session is and what the guts of all this is","498":"Чтож они никак не найдут своих партнеров-то. :) толпами ходят.","499":"Логи?","500":"не","501":"а взлом натива","502":"Если размер меньше - то тут чутка посложнее. Надо будет сделать мапу id -> указатель на объект.  Ну а дальше понятно. Вообщем пока вам не надо создавать 2 одинаковых объекта и как-то их различать в статичном колбеке - синглтон норм.","503":"Благодарю","504":"Всем привет ещё раз.\nМожно задать общий вопрос, не касающейся конкретного языка программирования?\nО том что мне делать, если нужно нанять фрилансера, для развития существующего приложения, **но я боюсь отдавать ему исходники**?\n\nЯ уже спросил, в Android Developers. Но не получил ответа. Спасибо.","505":"Thanks","506":"Крашится на armeabi-v7a","507":"С 16 пробовал, такая же беда","508":"кому как","509":"там наверняка все видно","510":"сделай ls -la","511":"Уж точно не единственный способ. Тем более, что Android.mk уже устарели давно.","512":"это не тот","513":"Например, можно ли собирать параллельно для 4 платформ? Или только для одной, зато в 4 потока","514":"Погуглил, что можно собирать с помощью NDK_build, или использовать JNI, но там речь идет об исходном коде, как я понимаю. Спасибо.","515":"Please how do I do that","516":"Спасибо.\nЕсли Вы соберёте и выложите libaacdecoder.so для всех платформ, особенно под arm64, в свете правил Google.Play, вводимых с 1 августа ( https:\/\/developer.android.com\/distribute\/best-practices\/develop\/64-bit ), очень много людей скажут Вам спасибо.\nИ, если при использовании не будет ошибки \"text relocations\".\nЯ сейчас проверяю exoPlayer, если он не подойдёт, обращусь к Вам.","517":"и оно не устаревшее это два","518":"@GlebKl \n\"проблема с многочисленными findViewById\"\nэто что за проблема и как связана с Котлином?\nили лучше самому погуглить?","519":"@whalemare\nзанимался подобным\nпотратил много времени но так и не получилось\nтак что если найдёшь решение то обязательно поделись с нами","520":"но удачи)","521":"новых книг нет, последнее, что я нашёл 2014 года \nhttps:\/\/www.ozon.ru\/context\/detail\/id\/18062412\/😑","522":"Да как не ругай эпл за их маркетинг и понты но то что у них качественные продукты то факт","523":"Собираешь под нужную архитектуру, пишешь жни слой, пакуешь в аар(по желанию), дергаешь нативные функции из kotlin, Java, или из крестов - Java","524":"and doing\n\n`float locationFixed = location - regionLength - widthLeft\nregionLength = location - locationFixed;\n\n`just screws it up, as does\n\n`regionLength = regionLength - locationFixed;`","525":"Если callback - то по имени я класс не ищу","526":"Дичь.","527":"поизучай в теме своего телефона","528":"Но ещё Kotlin есть","529":"Если сильно надо - искать dlsym-ом. Если есть - юзать. Если нет - искать альтернативу.","530":"Вебвью установить высоту на весь контент в нем и скроллить","531":"Ну почему глобальные?))  Статическая переменная в структуре. В принципе конечно ее можно признать глобальной, но повторюсь тут тот случай когда важнее было быстро провести эксперимент - хотелось иметь готовые настройки, которые можно посмотреть и преднастроить в GUI до того как структура будет создана.","532":"Ну да, я не с нуля собирал, там срр файл в котором есть опенсв, вот для этого файла как я понимаю и собирается библиотека","533":"И парселебл через либу parcel","534":"это прогрессбар?\nили совсем с нуля вью?","535":"https:\/\/wiki.strongswan.org\/projects\/strongswan\/wiki\/MacOSX","536":"Всем привет","537":"можно работать с std::string. Он по умолчанию пустой и конструктор свой вызовет.","538":"activeandroid","539":"ты ожидаешь что кто-то скачет апк, распакует её, будет искать там менюшку, дебажить её?","540":"То есть если его активировать, то файлы отостанутся в памяти","541":"А что там с пушами?)","542":"upd: Проверил сам, не работает так. Build.MODEL работает","543":"Не хекм","544":"Какой еще чат по пндроиду есть? Там 2700+ человек","545":"все равно заново начинает","546":"Если тебе котлин интересен в принципе)","547":"Кто-нибудь может подсказать как посмотреть используются ли определенные string ресурсы в коде или нет? У меня просто много строк (возможно много лишних) и почему-то щелкая на них я не могу перейти к месту, где используется ресурс","548":"gc может удалить обьект поидее","549":"Seriously? 😱","550":"собственно даже CVS не потребуется, если ты миллионы не тратишь каждый месяц, конечно )","551":"С чего ты уверен, что они вообще так делают ?","552":"точнее оно ругается только на последний класс, а именно Game.cpp","553":"@Sola2Be если да\nты завершаешь работу явно вызывая метод onBackPressed ?","554":"падает при вызове jint result = func(1, 100, \"input_source\");","555":"У нее нет разрешений для хранения данных на \/storage\/emulated\/0 (Память телефона)","556":"Еретики","557":"Activity прописываются дальше. Там и указывается что и сколько есть","558":"стимул","559":"Хотите глобальную переменную - найдите ей дом в виде единицы компиляции. В остальных местах ее extern-ом. А если у вас просто дефолты какие-то в GUI. Так сделайте структуре еще один конструктор и туда передайте. Вариантов уйма.","560":"В чем крутые фичи?","561":"Всем привет!\nОчень неприятная проблема возникла. \nЕсть проект с нативной библиотекой на rust. Обновил студию до Electric Eel, до этого стояла Dolphin. Проблема в том, что .so библиотека стала занимать **намного** больше места (было 12мб, стало 53мб и это только APK, а на установленном девайсе вообще космос). SDK на обоих стоит 33.0.3, код совершенно одинаковый. На фото было\/стало. В чем может быть проблема?","562":"Руками блин","563":"Вообще хз","564":"директор хочет стать цукербергом?","565":"#pr \nВсем привет\nЯ веду разработку игры \"Быки и коровы\"\nhttps:\/\/ru.m.wikipedia.org\/wiki\/%D0%91%D1%8B%D0%BA%D0%B8_%D0%B8_%D0%BA%D0%BE%D1%80%D0%BE%D0%B2%D1%8B\nна андроид\nСвоя реализация с блекджеком, свистелками и тд\nВсе кому интересно поучавствовать в разработе\/тестировании отпишитесь😊","566":"А как иначе?","567":"Тут и архитектура x86 - редко такое на android собирают.","568":"вот структура проекта","569":"В общем у меня есть макет по структуре сверху вниз - текст, место с рисоваными фигурами, кнопки. После нажатия конкретной кнопки рисуется конкретная фигура (круг или прямоугольник) по середине экрана\n\nВо всех туториалах для канваса в setContentView запихивают непосредственно объект класса, который унаследуется от View, вместо обычного макета типа activity_main. Можно ли как-то соеденить обычную разметку и этот канвас в одно?","570":"Вот похожий пример. Строка 100 отправки. Если в ней отваливается соединение из-за плохого соединения, весь цикл (91 строка) останавливается и не принимает соединения.","571":"так многие разработчики пилят приложения под беты, а бетка java 9 есть","572":"Надо будет ноут купить","573":"хотя, ходят слухи, что к концу года апворк загнётся)","574":"это оно и есть","575":"или что там еще есть подобного","576":"telegram.me\/androidev","577":"а как при этом дать заданные во фрагментах значения полей в html?","578":"Не кто не знает как использовать , ndk stack?","579":"Нужно сразу конкретно говорить","580":"https:\/\/en.wikipedia.org\/wiki\/Programming_language\nhttps:\/\/en.wikipedia.org\/wiki\/Build_automation\nPlease do not mix theese two things 🙂","581":"думаю сами знания не главный фактор","582":"Какую вам доку на ндк надо?)","583":"В каждом ндк набор заголовочных файлов меняется. :) но суть та же, да.","584":"мне надо заюзать .ogg формат и вроде это самый простой спсоб.\nСпасибо за фидбеки","585":"Даже вон лог сборки есть","586":"","587":"А отклонение от тематики - не норма","588":"ughhhh wtf i still cant reproduce it even if i copy every file used into a single header and rename the namespace so it does not conflict","589":"Ребят, работаем над андроид приложением, сам пишу на java, но просят xamarin, по сути вопрос такой:как сделать чтобы при авторизации через ВК , открывало не webview, а просто пароль из приложения вк","590":"Тебе надо насоздавать таблиц или их потом использовать?","591":"Все намек понял","592":"под  gsm модем","593":"Код выглядит нормально. Думаю дело где-то в cmake.","594":"It’s a whole repository of examples","595":"Я и на ява чуточку писать умею","596":"Резонно","597":"С ними серверные запросы делаются только с секретным серверным ключем","598":"это прежде всего нужно знать asm","599":"спасибо! изучаем","600":"Каких данных","601":"Как базу данных SQLite подключить к себе в проект?","602":"Не в критику, но если хочешь улучшить апку или доработать разные в ней вещи, то советую глянуть курс Developing Android Apps от Udacity. Там делали аналогичную апку, но проще и классно очень объясняли затрагивая всю платформу. Я вот сам недавно все просмотрел :)","603":"кто подскажет, есть ли какая нибудь причина делать из большого количества статических либ одну сошку?\n\nЯ уже не первый проект встречаю где библиотеки организованы таким образом.\n\nИ огромный суперкласс в джава коде который даёт ко всему этому доступ","604":"Я знаю, он любого щас дева на бутылку посадит, он один из старых девов старой школы🌚","605":"re-creating all the widgets that android has *","606":"А как же аппкомпат активити?)","607":"Можно посмотреть машинный код или псевдо код. Если тебе этого хватит чтоб понять алгоритм - можно.","608":"are there any metronome examples","609":"да, только регистрирует колбэк и дергает методы","610":"Всем добрый вечер у меня проблема с фрагментом","611":"Api level\nНомер, который видно пользователю (10, 11, 12...)\nБуквы\n\nДостаточно любого одного, зачем все три сразу? Причем разработчик сталкивается со всеми тремя, а написаны они всегда по отдельности, нужно каждый раз лезть в таблицу и смотреть соответствие.","612":"что такое лойс?","613":"тоже идея, спасибо. пока вроде не падало","614":"ребят 20$ в час","615":"такс получается мне надо погуглить как закешировать класс.","616":"а, понял","617":"В том то и дело, необходимо шифровать сертификаты, для зашифрованного соединения с сервером","618":"ура","619":"Это понятно. Просто любопытно как эту дилемму люди решают. Полагаю я не первый кто задался подобным вопросом","620":"всем привет, насчет защиты в нативе\nкак можно читать подпись напрямую из натива, если GP переподписивает свои ключем?","621":"Yes it is derived from the algo","622":"вон оно чо. попробуй запустить на 4.4 или ниже","623":"is this dead?","624":"У меня ноут 11 года, средний для тех времён: i5 2550m, GeForce 540m, обновил: ssd Kingston 120gb +4gb(8) оперативки. Года два уже так, все отлично работает, я бы не менял, но, блин, хочется нового, ноуту уже 5 лет. Ровно 5 лет))","625":"а вы сами на джава сидите?","626":"Знаю","627":"когда-то очень давно, несколько лет назад, так что мой опыт не актуален. я даже не уверен что работал с ним именно на андроиде.","628":"Ну это везде","629":"и никогда (!) не даёт внятных сообщений об ошибках","630":"Это еще более экзотно","631":"я имел ввиду наверняка допиливали сервер. Все аналоги долго обрабатывают и имели ограничения. Я читал где-то на tj, что они еще дрочились с оптимизацией","632":"Привет","633":"ну то есть дальше компилятора не уходит разбор форматов","634":"Это вариант без параметров если мне память не изменяет.","635":"Здравствуй","636":"Думаю как-то так","637":"Что ты хочешь получить в конечном итоге? Что за зависимость?","638":"Здравствуйте","639":"Я не из РФ, не имеет смысл говорить :)","640":"шланг теперь?","641":"Да да, эт я что-то","642":"если для обычных диалогов работает а для этого нет то я не знаю :(","643":"насколько помню еще в Jni_OnLoad передавали jvm","644":"У-удобство","645":"там метод","646":"","647":"Можно ли гифку в приложение засунуть?","648":"https:\/\/del.dog\/tebifiluji     `java.lang.UnsatisfiedLinkError: dlopen failed: library \"libReSampler.so\" not found`\n\nhttps:\/\/del.dog\/nohevazodi.sh C:\\Users\\konek\\StudioProjects\\libmedia\\app\\src\\main\\java\\libmedia\\CMakeLists.txt\n\nhttps:\/\/del.dog\/datawafuna.sql C:\\Users\\konek\\StudioProjects\\libmedia\\app\\src\\main\\java\\libmedia\\resampler\\ReSampler\\CMakeLists.txt\n\nhttps:\/\/del.dog\/oyutowojaj.rb project build log","649":"или я тебя не понял","650":"how do i include linux `\/usr\/include` path in android studio's header resolution paths\n\nfor example,\n\nredirect to `\/usr\/include\/C++\/9\/cstddef`\n\ninstead of `~\/Android\/Sdk\/ndk\/20.0.5594570\/toolchains\/llvm\/prebuilt\/linux-x86_64\/sysroot\/usr\/include\/c++\/v1\/cstddef`","651":"Вроде на некоторых моделях телефонах в настройка разработчика такое видел","652":"https:\/\/material-design.storage.googleapis.com\/publish\/material_v_9\/0B8v7jImPsDi-d09QRUZzVUdMSFk\/components-buttons-fab-transition_card_01.webm","653":"Главное что работает 😅","654":"BitmapFactory.Options options = new BitmapFactory.Options();\n        options.inSampleSize = 5;\n        Bitmap bitmap = BitmapFactory.decodeFile(FoldersHelper.getPhotosDirectory() + \"\/\" + getString(Tables.Places.Columns.photo) + \".png\", options);\n        BitmapDrawable bd = new BitmapDrawable(mContext.getResources(), bitmap);\n        h.photo.setImageDrawable(bd);\n\nкогда у меня стоит задача показать картинку которая заведомо больше чем мне необходимо я применяю такой костыль\nh.photo - это ImageView\noptions.inSampleSize - это во сколько раз картинка ужмётся для вставки в imageview (если коротко)","655":"вот","656":"все, дебаг починил","657":"в последний раз работал с ней год назад и пока возвращаться к этой теме не планирую хотя доп реальность интересна и есть несколько идей но пока отложил до лучших времён)","658":"Уф.. Сам хотел полгода назад сделать) потом нашёл удобную и красивую читалку","659":":)","660":"И отобразит пакет 10459?","661":"слышал и не раз","662":"нет","663":"учитывая что они пилили его хер знает сколько времени до 0.99","664":"до сих пор пользуюсь","665":"how do i do that?","666":"Код opencv будет вызываться только в java","667":"у тебя мак?","668":"Удивительно, что вот такое код на java - всё пишет, но не в папку с данными приложения, а в общую","669":"Часто создается пул worker-ов и они висят в локе пока задача не приходит","670":"http:\/\/www.intertech.com\/Blog\/saving-and-retrieving-android-instance-state-part-2\/","671":"Юнити с шарпом","672":"Да, ignore battery optimize даже добавил. Но на него полагаться не надёжно, его вкл нужно","673":"Вот ты все в шутку","674":"https:\/\/github.com\/android\/ndk\/issues\/243","675":"Так я же говорю, поменяю байт в нативе. Условный переход изменится.","676":"проще ретрофит же","677":"It would be what you will make it like","678":"пробовал, отсылает к корню модуля, а не всего проекта","679":"Если cmake, то надо убедиться, что используется тулчейн из ndk и что флаги компиляции и линковки не перетираются в cmakelists.txt","680":"так-то я гугли не один раз","681":"до сих пор каждый запиливает его как хочет","682":"Это в чем?","683":"I'm developing a SysV API for Android ^~^","684":"@molyakos мы реализовывали подобное\nно у нас просто сервер получает version и в ответ присылает да\\нет\nа уже в приложении нами был написан код который не пропускает дольше первого экрана","685":"туда питон впилили, афигеть","686":"настройки - безопасность - администраторы устройства","687":"addPolyline возвращает объект","688":"кто шарит плюсы ? 🙏🏼","689":"Если уж так надо запустить - есть виртуальные машины для андроид. Завели там что надо и вот те сервак...","690":"got a working, basic sampler, with a right panned delay (not echo) plugin :)\n\nhttps:\/\/github.com\/mgood7123\/AAudioTrack\/blob\/master\/AAudioTrack2\/src\/main\/cpp\/ardour\/AudioEngine\/AudioEngine.cpp#L408","691":"Тоже думал что может сработать=) Потому-что андройд=)","692":"disas мне был нужен чтобы понимать на какой я вообще инструкции","693":"попробовал в проводнике - тоже не помогло...","694":"а тебе прям очень надо именно с++? си шарповский xamarin не подойдет? там уже все готово","695":"что шифрануть?","696":"Наверное метод initNewClient() должен быть статическим, если он влияет на объект другого класса, хотя я могу ошибаться, ведь я не знаю почему вы выбрали такую архитектуру классов, наверное это необходимо","697":"I dont see path ffmpeg\/lib in there by the way","698":"чтобы во время пары никто не пытался обмануть систему","699":"React native может кому-то будет интересн, но у реактовцев есть отдельный чят","700":"а давно ли андройд и энтерпрайз нога в ногу?","701":"Возможно, ток оплатить тебе чем - то надо","702":"neither does *2","703":"Fake 360 😬","704":"Вот наглядно, как нужно","705":"ExceptionCheck является более правильным вариантом для простой проверки на существования исключения. \n\nExceptionOccurred конструирует local reference, что занимает время (оставим за скобками насколько сильно это замедляет работу, просто на сколько-то замедляет), также за этим local reference надо следить как за любым другим local reference.\n\nExceptionCheck вызывает внутри исходников джавы has_pending_exception, которая просто проверяет внутреннюю переменную на NULL, что не создаёт временных объектов и выполняется явно быстрее, чем конструирование local reference.","706":"И эта ссылка останется после выполнения метода?\nА потом этот объект нужно зарелизить?","707":"ну это не сигнальный сервер, но да ладно","708":"что то  новое","709":"может просто бряка не сработала? поставь туда дебажный вывод чтоли","710":"спасибо, не знал","711":"https:\/\/developer.android.com\/studio\/debug#attach-debugger","712":"из доки: \nWhether or not the application contains any code — \"true\" if it does, and \"false\" if not. When the value is \"false\", the system does not try to load any application code when launching components. The default value is \"true\".\nhttps:\/\/developer.android.com\/guide\/topics\/manifest\/application-element#code","713":")","714":"в динамической библиотеке main сам по себе не вызывается. чтобы библиотека смогла загрузиться - нужна функция OnLoad. Там очень важно вернуть версию jni интерфейса. И там же можно сохранить JavaVM, если надо будет вызывать что то из мирa java на потоке из мира c\/c++.","715":"Кто знает, возможно ли сделать захват аудиоданных в стерео, которые воспроизводятся программой, есть несколько источников звука которые воспроизводятся одновременно, и как они складываются на динамике вообще непонятно, нужно произвести захват, каждого канала отдельно, пробовал `Visualizer`, но там только моно, а нужно каналы отдельно хватать","716":"когда это потом должно произойти?\nвсмысле я хочу создавать фрагменты с изменяемым поведением\nзадавать из вне behavior, listener, controller, presenter и тд и тд","717":":) js?","718":"@kostya_bakay 21 самый каеф работать \nСмотря кто твоя целевая аудитория","719":"Это же был не реплай.","720":"Не получилось?","721":"выглядит не плохо","722":"«Это не показатель» :)","723":"Thank you,it worked","724":"Это она и есть","725":"Господа, что такое ashmem и как его правильно готовить? Что такое pin и unpin, и зачем оно нужно?","726":"так надо и все😁","727":"Хоспаде иссусе","728":"Нит))000000)","729":"to be fast enough fot real-time text layout and measurement (eg with no drawing lag as the user inputs text)","730":"У меня есть requestPermission","731":"Сегодня пропала","732":"но это по моим диванным оценкам","733":"it should not be underrunning when cpu frequency is low, right?","734":"Privet,  Vusal)","735":"Банхаммер наточен","736":"https:\/\/github.com\/settings\/profile\nты уверен что хотел именно этой ссылкой поделиться?","737":"Зато со стандартной камерой скорость ограничена лишь алгоритмом, у нас распознавания в 50 ФПС работают.","738":"Попробовал изменить тактику, собрать питон с `--enable-shared`, открылся новый квест — избавиться от 1.0 в SONAME\/NEEDED (или понять как заставить их быть в апкшке)","739":"https:\/\/developer.android.com\/reference\/android\/opengl\/GLSurfaceView","740":"Нене, именно для старых приложений ( потому и ввели google key manager ) это оказалось сложно - сохранить ключи.","741":"Ты заливаешь им апк","742":"Отдаешь на сервер","743":"Я наю, но для меня это пока слишком сложно","744":"ну это все лишь затягивание неизбежного, вопрос лишь в мотивации взломщика)","745":"ну там майнер не прописан под видеокарту. а так да, на видюхе лучше, т.к. их можно штук 5 поставить в системник","746":"Вот эту","747":"я имею ввиду","748":"Краш  есть , просто его не видно при фильтрах","749":"Кто пробовал Recyclerview в AlertDialog ? Что-то итемы в нем высотой не те, да и сам лист высотой wrap_content не становится","750":"это вопрос к конану. В Android\/NDK зависимости скачивает gradle","751":"Никого в онлайн(","752":"Какой бы язык для бэка порекомендовали","753":".a ?","754":"Я это делаю через мод меню инжектор","755":"Ставь условие на запуск","756":"я думаю синглтом эстетичнее и я бы выбрал его если бы передо мной стоял выбор","757":"а как он искать будет, вдруг у меня в другой папке лежит?","758":"@Destman выдайте, пожалуйста, РО господину Dim Dim, выше, а то начнется, точнее уже начинается","759":"от 6 окт","760":"Тогда почему в одном случае работает, а в другом нет ?","761":"либо хранить списки удалённых объектов где-то в префах например","762":"У меня такая же херня была с Hdpi","763":"updated documentation","764":"а где крэш","765":"Сформируй объявление и кидай в чат Mobile Dev Jobs","766":"Где type jclass, всё равно крашится =(","767":"Я вспомнил про пропеллер на острове и противогазы с швабрами)","768":"@ImangazalievM \nимеется ввиду open-source как у больших дядь по всем правилам и лицензиям с 1к звёзд на гитхабе?)","769":"WebCanape","770":"гугл не рекомендует его использовать вообще, для этого есть firebase token","771":"так а в чем проблема? не получается что-то?","772":"программист НЕ под андроид","773":"Из Явы можно запустить отдельный бинарь без жвм","774":"ну… это надо взять на подумать","775":"Да","776":"Ок, Pascal это не DELPHI","777":"Use ARCH","778":"","779":"#whois \nВсем привет. Зовут меня Всеволод. Фриланс разработчик: android, iOS. Веду несколько небольших своих проектов и помогаю в паре стартапов. О чате узнал из чата \"PRO Стартапы и бизнес\".","780":"https:\/\/github.com\/KeepSafe\/ReLinker\n\nМожет быть эта либа поможет","781":"И то правда) С NDK знаком очень поверхностно)","782":"Ну мне непонятно. Я как бы просто разраб","783":"The second one of course","784":"За пхп не слышал) но это треш согласен)))","785":"Тогда в чем фишка NDK?","786":"По команде add_executable в конце CMake-файла","787":"А можно поподробнее?","788":"окей)","789":"у меня другой вопрос : Народ кто работал с RxJava + Retrofit + TDD  ?","790":"Что бы делал я - триггерил коллбек на java уровне, в котором бы передавал несколько float значений, соответствующих каждому диапазону частот (10-100, 101-1000 и т.д.).","791":"Я плохо знаю C, но я выделяю память с помощью malloc.","792":"При 1кк может и имеет смысл, 5-10к это просто копейки\n\nЕдинственное что требуется уточнить, при размерах джсон в 1кк, слабым местом будет не его парсинг, а его хранение где-то, индексирование и передача по сети","793":"","794":"https:\/\/frida.re\/docs\/android\/","795":"Что вы имеете под Оскам? Протокол, программу на компьютере, или программу на ресивере?","796":"очень сырой, да\nно для элементарных задач его точно можно использовать\nпока у меня не было опыта реального\\профессионального тестирования","797":"уточню","798":"Да, это мне и нужно)","799":"а вот с armhf даже ndk-build  не сделаешь","800":"Можно в яве делать инит и в нем хранить глобалстейт.","801":"Причин может быть несколько. На другие смартфоны этот пакет устанавливается?","802":"я всю жизнь делаю через пустой и передаю аргументы через бандлы","803":"О, спасибо)","804":"И возможно проблема в кривом имени. Cейчас AS подсказывает если что-то не так в c++. На счет rust не уверен :) но старый добрый javap может подсказать что и как называется ...","805":"да, этот","806":"Драйвера для самого телефона + для отладки","807":"Чтобы не создавать дополнительный модуль","808":"Но не программист","809":"Дебагать тоже надо на разных архитектурах :)","810":"#whois Всем Привет,\n▫️Какой у вас проект или где работаете  - пишу разные проекты на андроид и desktop Java, работаю второй год \n▫️В чем вы специалист - Java ,Android, OpenCV, Rest API \n▫️Чем можете быть интересны сообществу - хм.... помогу чем смогу .. в свободное от роботы время\n▫️Чем интересно сообщество вам - хочу узнать чето новое... \n▫️Откуда вы - из Украины, но закончил универ в Польше и здесь и работаю\n▫️Как узнал(а) про чатик - интернет мощная вещь.... как то случайно нашол","811":"anyone work with AIDL","812":"ok! thank you very much!","813":"Это же шутка?😄","814":"Если вы загружаете динамическую либу через loadLibrary перед ее загрузкой надо через loadLibrary загрузить ее завимисти","815":"Как вы считаете,  должен ли разработчик приложений под Android хорошо знать алгоритмы?","816":"internet, accses wifi & network state, read phone state, write SD","817":"то есть 100кб машинного кода это уже прилично чтобы задолбаться его реверсить","818":"А хз. Я уже давно не юзаю ndk_build. Что оно та куда собирает и вообще как поддержка старого добра работает - хз","819":"Да блин!","820":"24 ая уже в sdk появилась","821":"Мне тут сложно что-либо сказать =))\nтеперь у меня другая проблема, не создается моя нативная либа, но, возможно, не все пути поправил","822":"Всем привет! Может кто работал с библиотекой Oboe\/AAudio? Может существует какая-нибудь библиотека для считывания аудиофайлов с устройства с помощью NDKMediaExtractor? Каждый раз городить столько кода, чтобы только воспроизвести аудио - ну такое 🥴","823":"нет, такого нет","824":"Хотя они там просто списком","825":"https:\/\/www.iitk.ac.in\/esc101\/05Aug\/tutorial\/native1.1\/implementing\/array.html","826":"enterprise communication and collaboration platform","827":"у меня нормально\nпроверь не сидишь ли через прокси?","828":"тогда искать реализацию `SystemProperties.native_get()`","829":"Есть тут кто работает андроид разработчиком на плюсах","830":":)","831":"А кто недавно подключал firebase через c++  - почему оно не подключает ни через set_target_properties(firebase_app PROPERTIES IMPORTED_LOCATION ${fire_sdk_o}\/libfirebase_app.a) ни через add_subdirectory(${FIREBASE_CPP_SDK_DIR} bin\/) ?","832":"там первая релизная из ~~25-х~~ мажорных, спасибо, теперь понятно)","833":"Да","834":"Неа, видимо пока забью","835":"","836":"хедеры то зачем","837":"ruby \/ node.js way :)","838":"врем название приложухи лйах гиз","839":"племянница Стива Джобса написала😁?","840":"Improved fps algorithms (with help)","841":"Если размер известен - можно сначала создать directbuffer. И заливать напрямую в него.","842":"Опять таки, любая защита по типу \"проверить ключ\/сертификат\" обходится анализатором трафика","843":"tolka team","844":"Getpackagе статический?","845":"https:\/\/www.deepin.org\/?language=en","846":"ScheduledExecutorService runs in your application process. If application process dies, none of the scheduled tasks will run. Hence the need for Service (so your process lives beyond Activities active part of lifecycle).\n\nWhile AlarmManager is critical system service that runs all the time. And if your application scheduled something and was killed, then AlarmManager may start application again (via PendingIntent).\n\nAnd the last major difference that no one mentioned here is that AlarmManager knows about WakeLocks and power management. This means that AlarmManager may wake up Android device at specified time to run scheduled task. While ScheduledExecutorService knows nothing about power management and will only start task when device is not in deep sleep (i.e. it can simply miss the time).","847":"Кстати то же касается и активити, но ни у кого не возникает аналогичного вопроса по поводу активити)","848":"вот такой в итоге получился","849":"","850":"Не запускал студию без ссд?","851":"Мы тоже иногда как аутсорс, но мы включаем мозг и правим тз","852":"они используют системную socket (2) функцию.","853":"https:\/\/developer.android.com\/reference\/tools\/gradle-api\/4.2\/com\/android\/build\/api\/dsl\/ExternalNativeCmakeOptions#arguments(kotlin.String)","854":"я до сих пор не могу привыкнуть к BottomNavigation. такая штука впервые у iOS появилась, а у Android - выдвегающееся меню. всегда считал это решение фишкой iOS","855":"Pausing Google Play's billing system in Russia.","856":"Есть. Но лучше начинать тогда не с NDK","857":"how can i use an AudioTrack from C++","858":"У вас какие предложении есть?","859":"Тоже вопрос по этому поводу. Какой вообще стоит выбирать alias для этого кейстора? Одним именем или какое угодно и проблем потом не будет?","860":"так только фильт все равно без 64битных оставить","861":"между dpi, size и sw есть зависимости, так что, думаю, ему не так уж трудно решить","862":"Про curl не знал, спасибо. Действительно выглядит как в linux.\nУ Android такой же набор заголовочных файлов?","863":"Ну просто из-за людей, согласных делать приложения+сайт+ещё что-нибудь за неделю и за 40к страдают остальные","864":"в нем сравнивай что хочешь","865":"Iphone 6 - 38k, iphone 6s - 40k)","866":"Более детально описано тут: https:\/\/source.android.com\/docs\/security\/features\/apksigning","867":"Всем привет","868":"I guess this is the reason why there is a certain level of popularity around iOS devices being used for DJ and similar purposes","869":"ok","870":"Вот трушное","871":"Уже не модно делать метод с возвратным значением?)","872":"всем привет, подскажите новичку как подключать эти библиотеки, пожалуйста","873":"Конечно","874":"Сколько людей, столько мнений)","875":"у меня есть приложение на андроид которое создает прокси сервер на андройде, при запуске приложения требует вести токен к подключению к моему личному аккаунту в одном из облачных сервисов. Кто нибудь может перенастроить что бы прокси сервер запускался на телефоне и я видел какой прокси и пароль к нему и логин","876":"самый лучший вариант я вижу в Riru (EdXposed на нем и основан)\nно там никакой документации\nЕсть только один пример от разраба и все","877":"Если летает что-то большое. То может быть лучше сформировать во что-то вроде протобафа. Когда блоки содержат в начале свой размер и не надо по байтам шагать и искать где там что. А если в конце сложить и таблицу смещений с метаданными. парсинг будет просто прыжками по известным смещениям.","878":"ох","879":"я скопировал его ответ","880":"Мне интересно самому руками можно сделать или нет","881":"https:\/\/github.com\/allockye\/Ansome","882":"если человек хочет распечатать и подгонит всё в ms office, то после этого придётся подправить документ, а не сразу печатать","883":"хм, тогда вопрос в какой момент это вызывается? потому что все выглядит легально, но зачем аттач к треду","884":"https:\/\/i.imgur.com\/TC2XKZI.png","885":"Да лааааадно! Неужели что-то годное не на базе ViewPager'а запилили)\nhttps:\/\/github.com\/DevLight-Mobile-Agency\/InfiniteCycleViewPager","886":"ну не в прямом - имею ввиду, что лишний раз бегает, я это понимаю. Не знаю вот как исправить так, чтобы создать имено по 13 карт из каждой из 4 мастей","887":"да ну ладно, я только начинаю","888":"Нагуглить либу легко","889":"Ну так","890":"Да оно ничем не отличается )","891":"А почему его?","892":"мне нужно правильно сформировать \n\ntypedef int (*lib_nativeSetCMD)(int32_t i, int32_t i2, char str);\n\nи вызвать ее \n\nfunc(1, 100, \"input_source\");\n\nно при вызове она падает","893":"","894":"В принципе как у вас? Если сделать приложение через визард и нативную библиотеку всё должно собраться \"из коропки\"? Или без бубна никак не обойтись?","895":"Ну и всякое такое","896":"Норм","897":"Что-то не так делаете. создается standalone тулчейн, запускается на нем configure с флагами нужными, make, make install. Всё штатно","898":"Ну ты ищешь кажется решение несуществующей проблемы","899":"А виртуализация на m1 как поживает?)","900":"Отправил файл","901":"imma try cleaning then rebuilding my project to confirm if the library is actually built or not","902":"yes","903":"хотел себе 2 клиента avito сделать - поменял package, как пологается, подписал, но приложение не устанавливается. другие же приложения устанавливаюстся. что еще нужно заменить, кроме пакета?","904":"Total commander","905":"этот? там же нет про нотификацию  https:\/\/www.udacity.com\/course\/firebase-essentials-for-android--ud009","906":"В любом случае, ты говоришь, что работал с либой. Я вот яндекс метрику инициализировал в апке и больше ее не трогал, даже не читал ничего про нее. Мб она больше ничего и не умеет, но это сейчас не важно. Теперь просто смотрю стату. Не смотря на это, я могу сказать, что я работал с метрикой, ибо это действительно так","907":"Что за бд?","908":"Короче, ты либо класс делаешь, либо пытаешься успокоить свой перфекционизм другими решениями, который он же сочтет элегантными","909":"Много при чём ! Jetbrains = Android studio = ndk  - тут довольно просто","910":"вот","911":"armeabi - устарело, её нигде не поддерживают","912":"а ты функцию то которую вызываешь зарегистрировал?","913":"https:\/\/developer.android.com\/ndk\/reference\/group\/media","914":"На c# проще будет async\/await заюзать","915":"эта какая-то лямбда?","916":"https:\/\/github.com\/Semantive\/waveform-android\nor better this one\nhttp:\/\/bfy.tw\/OKlf","917":"https:\/\/gist.github.com\/anonymous\/19cd055a0b43487e6eb35836a3d12702","918":"И?","919":"Ну и зависимость прописать. И заюзать в конфигах для сборки.","920":"А я наоборот сую фрагены везде попало😞","921":"Ходит мнение, что земля плоская.","922":"До этой обновы такого делать было не нужно","923":"Так это то же что СДК","924":"Не не не, зачем БД?)","925":"можешь. в ndk всё лежит","926":"мне кажется мы переходим к конкретике","927":"О, прикольно, скоро воспользуюсь","928":"всем привет, каким образом можно освободить память выданную через NewByteArray? Очень много массивов byte создается, и просто heap не хватает\nждать пока Garbage Collector очистить нет времени)","929":"а скидка для патриотов?","930":"но записать он всё равно должен, хоть и обрезанную строку","931":"Прикольная игрушка) жалт документации нет","932":"это как?)","933":"Да, вы мне его и скидывали. Я просто другую срочную задачу решал. И только сейчас вернулся к этой проблеме. Извините за такой вопрос, давно уже не чувствовал себя так глупо. Не знаю куда я смотрел.😐","934":"я помню ты про gedit говорил","935":"Я не помню, как решал эту проблему, но недавно видел, что можно в gradle-файле указать что-то version \"3.18.0+\", и вроде должно работать","936":"Нужно изучить его","937":"На маке такая борода с новым режимом где эмулятор встрен в UI Android Studio. Лечилось вылючением этого режима","938":"Я когда то думал что эта тулза вместе с компилятором идёт.","939":"4.12 версия\\","940":"Или чо там те больше нравится","941":"Не исключаю, но для начала что-то по-проще.","942":"На этом откланяюсь) и покину ваш уютный чатик. Пойду искать 3.5 гиков","943":"Да я понял что рекламная не слышал.","944":"Yes,there is in my build.gradle","945":"Да по принципу enum сделаю","946":"У вас Windows ?","947":"А проверяли что там для ninja передается за комманды? Там же все видно чем и какими параметрами собирается","948":"да на гитабе все есть","949":"Хотелось листать в бок фильтры, изображение 240на 240 думал больше будет в галерее и ватермарк пиксельный (возможно из-за разрешения фото )","950":"","951":"Всех приветствую. Пытаюсь собрать телеграм с gradle 8. При синхронизации gradle у меня возникла ошибка:\n\nUnknown argument -j=16\n\nЯ прочитал,что теперь в cmake этот флаг нельзя передавать в аргументах,а делать это как-то по-другому,т.е через комманду build. Вопрос в том,как это правильно прописать в gradle? Заранее благодарю всех за помощь.","952":"насколько я знаю, рут можно применить только через эмуляцию терминала (например Runtime.getRuntillme().exec()),\nа из кода (java\/c++) никак","953":"Всем привет, я новичек в нативном коде, подскажите пожалуйста как работать с .so файлом (заголовочного файла нет)? Как вызывать методы от туда? У меня jni вроде по гайдам..","954":"android.location.LocationManager","955":"в первом случае флаги, заданные в тулчейне, будут потеряны","956":"и в джаву отдать просто готовую jstring","957":"Ффмпег и экзо это не обязательно видео : )","958":"хм.. тут кстати тоже вариант ...","959":"хочешь помочь людям - делай бесплатно","960":"диалог не является фрагментом разве?","961":"попробуй просто класс найти через JavaVM","962":"ТЗ","963":"It depends from hardware. Most DACs produce click when powered off. If you do not close audio session (DAC did not stop wroking) and you hear clicks - this usually means that there are problems in mixig of audio. For example if first audio stop plays with nonzero sample and start with 0 - you will hear click.","964":"То спецификация врет, то аппаратные энкодеры через одно место работают","965":"Чаще всего NDA подписать, но поверьте, в ваших исходниках нет никакой ценности ( вы не Ubisoft с движком под грядущий хит оптимизированный под Playstation 5 )","966":"если положишь сервис в фореграунд, он, вроде как, гарантированно будет работать, пока юзерок его не положит","967":"не вижу проблемы в том, чтобы парсить параллельно json","968":"нашёл всё-таки https:\/\/www.hanshq.net\/command-line-android.html#native , правда кто будет в здравом уме опираться на баш скрипт это уже другой вопрос","969":"А на какой ты процессор собираешь, тут же в основном x86","970":"Следственно конкуренция бешеная","971":"Зачем тебе вообще это все ?","972":"so idk what will happen if the host libpng is ever upgraded\/updated","973":"главное шобы бесплатный","974":"Запустил, все работает. Ошибку повторить не удалось","975":"Благодарствую)","976":"idk","977":"там есть поиск)","978":"ты спросил рабочий способ, тебе написали как. Какой ещё вопрос остался:?","979":"jar вроде нельзя. А вот можно либу подключить как второй проект, тогда можно. Но это исходники открытые надо.","980":"тип вот строку передать легко будет или картинку чтобы как-то обработать?","981":"@Sola2Be \nда да модуль\nно ты видел сорцы\nтам старый - неандроидстудиометод разделения на модули\nон не подойдёт для человека со студией без обработки дополнительной","982":"О политике давайте в другом месте.","983":"А зачем кстати тебе это нужно?","984":"А если нет, то будет у тебя писаться оно в раз 10-50 дольше","985":"приложение работает, я пробовал внедрять свой код, менять манифест, все ок, но если меняю versionCode - не запускается","986":"мммммм","987":"Зачем выдумывать костыль если есть готовое апи.","988":"Кто-нибудь пробовал под новые версии ндк\/гредла\/билд плагина обновить этот семпл?","989":"Не останавливаюсь на брейкпоинтах","990":"Перед этой функцией вот такой код int aNN = 12 ; auto future_result = firebase::remote_config::Fetch (0) ;","991":"заказчик русский","992":"Это СДК?","993":"бред","994":"Должен быть","995":"У меня xiaomi redmi note 3 pro со снапом 650 на 8.1 андроиде. Разрешение камеры я ставил 640х480, иначе совсем грустно.\n\nЯ создаю обьект JavaCameraView и в методе onCameraFrame получаю кадр mRgba = inputFrame.rgba(); ну и потом вызываю функцию обнаружения нативного класса OpencvNativeClass.faceDetection(mRgba.getNativeObjAddr());","996":"Tools -> Kotlin bytecode\nВ окне нажать Decompile","997":"Ток это не имеет значения, они работают с апк, а Google Play требует AAB. Придётся потом ещё воспользоваться APK to AAB","998":"Bundle был бы оправданный при передаче с фрагмента во фрагмент, либо с активности во фрагмент","999":":) nda понятно)\nЩас скину тебе кое что, неуверен что поможет, но ты загугли"}}