{"text":{"0":"","1":"Съел","2":"далбаебина бот","3":"Откуда я знаю","4":"просто, генеришь ключи и публичный подкладываешь на сервер","5":"Бля","6":"ей надо пользоваться, а не ебаться с ней","7":"ктрл + шифт + м","8":"оптимизон может дать в разы прироста производительности, чем лишних 100мгц","9":"так запросы направляются сокетами на ип адреса. тебе нужно просто найти код, который формирует тело сокета и сами сокеты","10":"Они себя изжили, время их прошло","11":"","12":"","13":"внешка","14":"","15":"Вакханалия явно удалась","16":"блядь","17":"))))","18":"я помню, но ты говорил что собираешься это учить","19":"чего?","20":"Дихотомия, в первую очередь. Потом все остальное","21":"alt + insert = автодописывание многих вещей. В т.ч. и геттеры-сеттеры автоматом","22":"64 разрядную","23":"Что делают 2 строки эти?","24":"Отсекает 99% спама","25":"думаю бля ты чо год делал","26":"тупои вопрос - в бэкенде же ооп активно юзается?\nменее тупои - есть еще годные чятики по шарпу\/бэкенду?","27":"Не браузер, а рендер хтмл вместо хамл","28":"","29":"blob это массив байтов","30":"","31":"Где я тебе такое найду xDD","32":"пасаны, как подвязывать определенные проекты к старту?","33":"Я объективен как никогда.","34":"хорошо, покажи свой идел, на который у тебя встаёт","35":"я именно экземпл встречал","36":"Всем привет! Написал кастомный Middleware. Подскажите, как сделать так, чтобы его действие не распространялось на методы, на которых не навешен атрибут авторизации [Authorize]?","37":"но можно и стандартным","38":"Давай печальные","39":"Мы скатились?","40":"убило последнее что ветеранам монумент поставили \nиз цемента и на него наклейку сделали","41":"Да лан пасаны","42":"а там не перехватишь?","43":"нахер ты им сдался в выходные","44":"даришь ему какашки а он носом вертит.....","45":"Ну как редактор кода","46":"это был вопрос на осознание что в tcp куча полезного","47":"В С++ вроде надо делать еще и посев генератора, обычно по текущим милисекундам","48":"Хз, я за обычный композит, он простой и понятный","49":"жееесть)))","50":"как ты не юзаешь списки?!","51":"Кажется мой вопрос остался","52":"почему у города отлёта и города прилёта типы столбцов разные?","53":"","54":"Я ж ссылку дал на кеш","55":"В чем это?","56":"там около 6 контейнеров кажись и юзают все для своих задач","57":"Так сразу лист сериализуй","58":"кто тут из вас любит десктоп вот так чтоб прям готов на опенсорсе ебашить забесплатно его","59":"нет, ты не можешь её не применять","60":"всё есть) но не сейчас)","61":"Dataflow поди какой нибудь вместе с хранимками.","62":"он без денег","63":"Траблшутинг включи","64":"19","65":"Для начала","66":"Но собирать их я не люблю","67":"Подкачайся и сможешь ее побеждать","68":"синглтон сервис конструируется - требует свой дбконтекст контейнер его строит и подставляет","69":"Что с телегой?","70":"Работал","71":"я вообще без понятия что такое выучить язык? сейчас выучить шарп это значит понять все типы членов которые могут быть в типе, анонимные типы и анонимные методы (лямбды), поняь разницу между ссылочными и значимыми типами, дальше уже только многопоточность стоит и асинхронность","72":"Написал один раз- знаешь что такое существует- прогуглить когда надо будет снова","73":"Не, разные сволочи, как оказалось))","74":"и смена власти ничего не даст, поверь","75":"Народ, такой вопрос. Сам из Белки. Рубанули вам телегу или ещё нет?","76":"Или лучше учиться сначала год хотя бы?","77":"дейнерис таргариен: я успешная женчина и я выбираю 1с","78":"Я тупой просто","79":"правда если честно я до сих пор не совсем уверен что понимаю разницу )))","80":"не , не ренж, айди торговых точек.","81":"вот тебе и ответ - используй ексель вместо SQLite","82":"без негатива?","83":"похоже что настройка  <jsonSerialization maxJsonLength=\"10485760\"\/> игнорится","84":"у одного челика который сделал жулие фрактал","85":"Как-то слишком просто","86":"Ef Core забыл добавить)","87":"неожиданно","88":"Если честно, я тоже. Её какой-то сатана накодил...","89":"та поставил бы студию 17 или 15 года на 7ку","90":"Нанимаешь девушку с красивым голосом, даёшь ей в руки скачанный скрипт продаж и двигаешь на поиски заказчиков.","91":"как и ты реально свинья укропная","92":"Кстати да","93":"+ форматирование само собой","94":"Так гонг конг это и не китай почти","95":"не понял что ли?","96":"10к строк в день?","97":"Алексей - лук порей","98":"iframe","99":"Вполне себе нормально","100":"Регуляркой","101":"Делфи классный!","102":"А сайтик: пускай лежит, потом сделаю как нибудь","103":"я сейчас говорю о платформе Twitch","104":"Скорее всего у тебя в проекте подулючены две сборки, одная из нугет, а другая подключена другим способом., скажем из фреймворка.","105":"Может ее в маке?","106":"чаво бля","107":"много кто использует Task вместе с Thread?","108":"Ты все с первой победы нашей сборной не просыхаешь что ли?)))","109":"если через logic обращаться, то всё равно не работает","110":"а во внутрь Delete (путь к файлу )\nдолжен прописать да","111":"что тебе не понятно?","112":"это нетривиальная задача","113":"json","114":"","115":"если их можно не использовать, то лучше не использовать ;)","116":"ничего не отлетает. он пишет ошибку что таблица уже существует. а я же написал дропнуть","117":"? Шо це таке?","118":"Не, это максимум в голове)","119":"Элементы всмысле строки? Типа в одной колонке у всех строк поменять значение?","120":"тот же","121":"надо НАОБОРОТ","122":"подскажите пожалуйста","123":"В скуле всеравно никто не форматирует","124":"я уверен, что если ты откроешь конспекты\/учебники, то 1-2мес и на 4 точно вспомнишь","125":"\/g http client headers only","126":"Что такое нре?","127":"а. Тогда сорь","128":"Если что готов выезжать? И биты поди готовы?","129":"какой статик? кто не видит? ты ебанулся?","130":"но нужно это сдлеать по клику кнопки","131":"поковыряй реакт, он простой","132":"Во, примерно за этот случай говорю","133":"Ссылку на профиль?","134":"как я понимаю, какая-та беда с маппингом","135":"иди спать","136":"вот кстати","137":"оно?","138":"Но такой функционал возможен","139":"Не по одному уже даже туториалу","140":"Я должен репозитории на слое бизнесс логики заинжектить","141":"для школяров","142":"это более универсальный подход, чем цвета проверять","143":"какой протокол?","144":"да есть. но на не 100% совместима с обычным питон. ну простые какие-то вещи да будут работать","145":"Может кто будет поможет","146":"да","147":"ну я аутентифиакию пройти не могу","148":"Зайди в гугл, там есть набор модулей","149":"Ставь нормальную ось","150":"","151":"Нет","152":"например в бекенд шарп можешь идти","153":"че","154":"Хорошо Георгий, закругляемся","155":"Щас Точно не скажу как переменные называются","156":">Опыт разработки от 2 лет.\nНет, обычный такой джун, самый стандартный, там еще зп будет 20-22к","157":"","158":"Сделать  RonBotAsync static и ввзови без конструктора program","159":"так ты мне скажи как правильно хранить инфу по столбцу, а это показывать его или нет, и его порядковый номер в репорте","160":"","161":"знаю, просто сам сталкивался с рандомом, решил такой вариант самописный юзать, но я хз, если фор будет i<10000   )))","162":"или hackerrank?","163":"о, а я думал, тут про C# разговаривают… :))","164":"А какие надо ставить?","165":"А что скрывать? Воруешь чтоли?","166":"кабак ))","167":"Кто-нибудь знает почему компилятор ругается?\n\nstatic async Task Main()\n{\n          await Task.Run(Work);\n}\n\nstatic void Work()\n{  \n}\n\nThe call is ambiguous between the following methods or properties: 'Task.Run(Action)' and 'Task.Run(Func<Task>)'","168":"У меня 7 на меня одного уходит LuL","169":"кароче главная проблема - там sso аутентификация в АД через окту","170":"вряд ли","171":"","172":"в закреп","173":"?","174":"Хмм","175":"мб исправили","176":"я на днях ел","177":"а в шарпе так делать можно?\none: {\n            two: {\n                three:{\n                    break one;\n                }\n            }\n        }","178":"да","179":"Попробуй это","180":"кинь скрин кода","181":"а че мне нравилось как-то писать все через this","182":"попробую на виртуалке запустить с голой виндой наверное","183":"","184":"меня больше беспокоят средства разработки и библиотеки","185":"потомучто возникает в static методах","186":"А какие-то права и разрешения. Для заказчика можно только через QIWI WPF","187":"Ну я пока свалил в Польшу, нужен был рускоговорящий для проэкта в России","188":"","189":"Чтобы я с чужими группами работал — жесть.","190":"Да аще изи.","191":"🏳️‍🌈 I am 8% gay!","192":"так ты скрин покажи","193":"оки раскидаю","194":"чего сегодня нового кодила??","195":"а где тот опрос про казино","196":"хотя вобще тупизм если чесно","197":"Ну да","198":"И кто ему дал талон на нытьё? @zerpico ???","199":"Я сейчас на электричке вместе с толпой студентов ездил. Даже на время забыл, что я уже закончил учиться🤣","200":"Работы было 0","201":"Другие пахают две недели ради 100 евро","202":"Сначала обосрали Димаса за акробат ридер. Предложили альтернативу запускающиююсясячс за 1 нс","203":"чето уже совсем походу засиделся, что квик чейнджс энд рефакторингс не нажал","204":"даже спец должен умень отбрехиваться от тимлида, который тебя будет Issues топить","205":"За 35 покупался","206":"Теоретически да","207":"kjk","208":";)","209":"есть експрес,  девелопер едишн, и ентерпрайс","210":"","211":"Че делаешь?","212":"то что там напридумывали в еф это головопушки еф","213":"Уже удалил","214":"я хз. какая тебе нужна ссылка","215":"я в аниме вообще не шарю","216":"где не робит","217":"это новые обои","218":"да","219":"Хотел поделиться одним прикольным ништяком который сегодня увидел.\nТип как получить последний элемент списка без сложных нагромождений и свойства count в стиле\nMoimassiv[Moimassiv.Count-1].\nЧтобы упростить это выражение достаточно подключить пространство имён Linq и само выражение заменить на Moimassiv.Last()","220":"Какая девочка","221":"какая там правда может быть","222":"посоны","223":"Я до сих пор не всегда пишу хороший код","224":"хотя вроде раскурил","225":"всё идите лесом кароч","226":"Еще больше запутался. объясните гайс","227":"не так давно как раз была статейка на хабре что сишка живет","228":"Здравсвуйте. Подскажите, что можно почитать и посмотреть по поводу отслеживания изменений в базе данных клиентскими приложениями? (Нужно при изменении данных одним пользователем, отобразить их в приложении другого пользователя)? Используется Entity.","229":"Ну да","230":"Тебя чо кобыла лягнула? Чо ты на папашках с чвтика душу отводишь?","231":"о чем думал","232":"точно такой же","233":"пропащая молодёжь Узбекистана","234":"Два моника","235":"Это для новичков","236":"чай не член делить собрались","237":"Чувствую что день прожит не зря","238":"Это отсылка к Вадиму Шванову?","239":"вствь сюда в биндинг....","240":"Я думаю там и так достаточно всего без вин АПИ можно использовать","241":"TextAlignment это выравниваение по горизонтали именно текста, а не контрола, а вот как по вертикали не могу найти","242":"И нон-стоп не трогают.","243":"ну если я правильно понял вопрос то да, нельзя","244":"Не совсем понял...","245":". . .\n. . .\n. . .\n\nэто две диагонали и две параллельно диагонали (любой)","246":"кто-то запилил на андроиде топ софт, теперь мы должны на хромбуках ананировать?","247":"возьми какой-нибудь xUnit, моки и попробуй написать тест на один запрос так, чтоб замокать все","248":"И делай с ними что хочешь, хоть в красную комнату суй)","249":"не, она красивая и высокая","250":"Там просто куда не плюнь, попадешь в замужнюю","251":"Твоя правда....","252":"ЧО нагуглил то и юзаю","253":"Это хорошо, ведь у меня нет религии","254":"еееее","255":"боже андрей вы болен","256":"своей, всмысле правой руки та )))??","257":"Илья, wpf это больше чем Ui, это целая вселенная!","258":"Одно дело, если у тебя в нескольких местах такие штуки","259":"такшо тут ты 100% обосрался","260":"На урл смотрю всегда","261":"типа когда у нас ничего не было","262":"так как ты гвооришь сраббоатло - подставил спереди сд и перешло","263":"это не шарпы вообще","264":"Что тяжко?","265":"это просто область видимости, вся эта залупа инлайнится в код","266":"да. по прежнему считаю что он хорош. только вот прокси наш ебаный, это ваще китайский фаервал какой-то","267":"софт платный","268":"Я тоже так думал","269":"ща гугл панораму гружу позырю чо там за киров","270":"а в гит заливается?","271":"не было бы столько дрочки","272":"если быть точным","273":"У тебя гино будет больше чем член. XD","274":"Это winforms, как я понял?","275":"","276":"в хоккей","277":"ты просил пруф? вот пруф что ты тупой баран, вон люди видели , зафиксировано всё. Что не так то опять","278":"спики и второму не болякать))","279":"Да димон шлангом только прикидывается, уверен","280":"Да","281":"Сча тебе натыкают. Добавил бы хоть 4ый вариант, на чисто поржать ипосмотреть результаты.","282":"Какой шанс","283":"У меня от джавы уже жопа болит","284":"","285":"Друна подтяну","286":"а то я даже не знаю, похудала я или поправилась","287":"тупнул","288":"Фул дегенерат без обид)","289":"который лишь как Panel для компоновки","290":"Странно. Я предложил парню на пару написать софт, который заходит к конечному ip через цепочку из проксей, и улетел","291":"И реальная задача","292":"бл ну так не честно","293":"а ты угадай","294":"Напомни что ты изначально хотел?","295":":D","296":"или еще че произойдет","297":"ПЗДЕЦ","298":"{action}\/ както так наверно","299":"сома я больше в жизни в рот не возьму","300":"Такой вопрос","301":"без золотых проводов","302":"не работает","303":"Ну может у студентов и по другому","304":"asp net core web api","305":"Т.е. мне нужно впилить пустой конструктор? Или обычный конструктор где самому прописать присвоение","306":"Компилятор не позволит это сделать.","307":"Тогда спать","308":"Что вы думаете об урезаной клавише `[Enter]`?","309":"ты про менеджмент студию???","310":"Піф мазіла","311":"так в рамках одного домена они будут действительны","312":"https:\/\/cdn.jsdelivr.net\/npm\/signalr@2.4.0\/jquery.signalR.js","313":"и потом появляются электроны, знаем мы","314":"я тож не распарсил","315":"Было бы полное задание легче было бы обьяснить","316":"спасиб","317":"ну тут же все тебе дали)))","318":"Что там с маппингом?","319":"😏","320":"может там опечатка закралась, скопируй название колонки в строчку where","321":"Ладно пора спать, уже все отвалились","322":"so close","323":"сначала Free Pascal скачай","324":"и декоратор","325":"Ну давай покажи класс, обьясни человеку или те проще говно извергать?","326":"всякую херь придумывают","327":")","328":"Ну мог бы тебе предложить поюзать FiraCode","329":"тоже верно","330":"учти, все равно придется вникать в алгоритм распаковки, т.к. тебе нужно разбить на итерации","331":"Или кто это","332":"Где это написано","333":"да,с помощью него мы обновляем пропертю когда нам нужно","334":"Сложности не с пингом, естественно","335":"в Новой Зеландии было убито 35 человек","336":"Ага, спят по 20 часов в день к тому же.","337":"на строке записи в файл выдаёт ошибку типо файла нет","338":"Вроде есть легкое что-то а иногда вери хард попадаеться","339":"не будешь думать я шерзода позову он мой кум он тебя побьет","340":"Плохо пробовал","341":"","342":"ну некторые имеют ввиду мвп в качестве дэмки и это только заказчику(тому кто деннежку платит за разработку) а ползователи это уже потребители которые платят заказчику","343":"Взломом считается, не предусмотренные методы для пользователя, сам изменил куки, копался в коде и тд","344":"Ребята делаю проект на MVC asp.net core, добавил авторизацию при помощи Identity с бд и my sql сервером","345":"я вкурсе уже, там нет объяснения по этой формуле более подробно","346":"атададад даааааааааа еду в аквапарк","347":"А тут такая же логика","348":"давно пора уже","349":"frame.CastOf<Control>().Select(c>c.GetType().Name+\",\"+c.Text)","350":"Ну это не бд","351":"хамарин выебнулся","352":"Ну хорошо что не многочлен тогда.","353":"топ надо башлять","354":"АХАХАХАХ","355":"А я нуб не юзаю такое","356":"Они могут разный UID1 и UID2 иметь но отражать один смысл","357":"вопрос, что дальше нужно сделать для UPDATE sql ?","358":"бля он че серьезно что ли?","359":"чтобы понятнее было","360":"Фу, свинота.","361":"Что за \"Рав данные\"?","362":"😂😂😂","363":"хотя приведение неявное","364":"Red это char да?","365":"а мб и не только для десктопа, а сразу для всего","366":"вот это девушка","367":"да ты просто подумай, чувек, просто подумай)","368":"Можно и количеством, как посчитаешь, отпиши)","369":"так всегда на собесах бывает )","370":"Та не","371":"А по поводу ASP.NET Core web api MSDN справляется с лихвой","372":"утром понедельника после недели больничного","373":"он не умрет","374":"Уххх","375":"Это из того что есть на телефоне","376":"такие че не очевидно есть принципе неважно блять какие ключевые неважно давайте короче почему то. шекспир пока живет ссылка счёту переменные. этот я там короче создал перемены закидывал стыд и возвращал визу функции пиздец он блядь типа значит мы там находились. допустим тот же момент а срочный тот же этот как называется чатинг. будет блядь потом мне подсказали что когда выхожу из функций они всего умирают блять даже потому что на них существует ссылка. существуют ссылки хуя столько всего базара базально как говорит костин вкусный салат. против\nПри поддержке [Тудуранта](https:\/\/todorant.com\/?utm_source=voicy)","377":"Вот вот пошёл процесс, изучение программирования как социальный процесс","378":"Зависит от стоимости.","379":"Взаимосвязь чувствуешь?","380":"На каком пилил раньше ?","381":"дороже чем что?","382":"ниадам","383":"там нашли твой ник в каком-то тг-канале для знакомств","384":"Та можно все","385":"очередной рабочий день практически закончился.","386":"PInvoke","387":"все же от контекста зависит, программирование тонкая штука)))","388":"но повторюсь, имхо, лучше всегда явно на нал проверять","389":"Чо ебан чтоли?","390":"стоп","391":"зиро даун ваще на высоте","392":"фу извращенцы","393":"Делал на скорую руку. Надеюсь помог примером","394":"ахуели чтоли","395":"Я уж полез расчехлять прокси","396":"Ты задавай сразу вопросов без прелюдий","397":"Еду сейчас , куплю хату и заеду","398":"Смешно пошутил погуляем?","399":"Скорее runstring наверное","400":"Нужен реализовать типа saas, при регистрации создать новую бд","401":"сори, неправильно написал","402":"государственный язык","403":"","404":"есть","405":"В одной колонке","406":"hehe","407":"разве она изменится при повторной компиляции автоматически*?","408":"В конструкторе","409":"ответ нищебродов понятен, мне пофиг т.к. в кормане кукиш","410":"В этом чате сокровища в коде откапывают","411":"15-25","412":"ну такое шутка.np это типа non-deterministic polynominal а не просто уравнение","413":"Id","414":"в статье написано долбоёб","415":"","416":"Но видосики монтировать за деньги могу","417":"Точка остановы в переводе в вс","418":"Понятно","419":"Девочки все в юбочках школьницы","420":"не могут","421":"А не как дотнет дибил во фронте","422":"вот у меня пиздец запар","423":"Не могу я ей мозги пудрить","424":"тоже побенчил,мой вариант получился примерно таким же","425":"@EngineeringZ Имя сборки? Так словарь из другой сборки?","426":"дома всё","427":"привет. Задумка такая: на форме есть квадрат, который рамдомно имеет красный\\синий цвет, игрок нажимает клавиши Q\\P, указывая, какого цвета квадрат, после чего цвет снова меняется. Так вот как мне сделать ожидание клавиши после GenerateRandomColor?","428":"Это какая?","429":"С чего такая ненависть к медленно превратившимся в тяночек?","430":"Питухон используется действительно мало где","431":"Ехх)","432":"?","433":"","434":"Он танцор 🕺, певец 🧑‍🎤 и на дуде игрец, ещё С# и нод разработчик (но это не точно) . Но спросить у него ннадо","435":"А с мамки не подойдет ;)","436":"да мне уж проще по tcp просто обмениваться","437":"```(x.CodeETPType != ((int)EtpTenderTypesEnum.OneSourceTender).ToString() ? (x.PUBLISH_DATE_2 != null && x.PUBLISH_DATE_2.Value.Date >= filter.PublishDateFrom) : (x.FINISH_DATE != null && x.FINISH_DATE.Value.Date >= filter.PublishDateFrom))```","438":"Жиза, это я пытался делать костыль с Material. Приходилось добавлять в него сетку bootstrap'а чтобы оно хоть как-то начало позиционироваться","439":"а так показал бы","440":"Я не шарю в докере","441":"значит подключение прошло удачно","442":"Виталий юзает иде на всё 110%","443":"LPT","444":"Мы еще не то могем","445":"Я комененьарии воще не юзаю)","446":"на него ответ","447":"еще более менее контекст","448":"Искали куню","449":"мм не сматрел надо скачать","450":"по 👆 и distEnce - и с русским\\english не очень😏\nчто за формула у тебя такая?","451":"Прежде чем делать вывод - узнай за человека","452":"","453":"сильно","454":"мыж любя","455":"night butterfly","456":"кокер это натура","457":"И подсказки двоечникам","458":"У них к слову вечная стройка, старшая дочка без работы магистр, мать получает минималку продаваном, а батя по халтуркам гоняет и таксует","459":"заебись","460":"Смыль давай","461":"если тебе предлагают готовый вариант (и он кем то продвигается), то тут ничего не поделаешь","462":"а как бы ты вынес два раза контейнс?","463":"Решит проблему 100%","464":"в студии вижлы","465":"наверно в этом что-то есть","466":"давно было, ниче не помню, сорян","467":"","468":"У ноды xml есть список аттрибутов","469":"то есть такой функции как в вебформах нет","470":"И ко мне","471":"Не помогало. Всё дело было в Не _number[I]  а i","472":"А хотя скллайт не пашет же с еф вроже","473":"http:\/\/hh.ru\/vacancy\/48331279","474":"на винде хватит Process.Start(\"MyUrl\")","475":"gc надо воспринимать уборщией со свободным графиком, но ответственной и не лезть в ее работу, не заставлять приходить угрожая невыплатой зп","476":"но вы к моей печальной доле хоть каплю нежности храня","477":"xD","478":"и пострашнее бывало:\n\n\"в базе должно быть минимум 50 таблиц, причём не связок M-M, а полноценных!\"\n\nи е*ись как хочешь, хоть рожай эти таблицы","479":"это ж имба","480":"я за ПДД)","481":"жду ответа, позовут ли на 2 этап","482":"буду пробовать еще раз спасибо...","483":"явно проблема в логике","484":"я не гоню против орм","485":"да\nно в хуй дуть все равно будешь","486":"да","487":"эт уже ангуляр головного мозга какой-то )","488":"универсальный метод","489":"Джокер","490":"","491":"а где димон?","492":"и не трубить о ней в новостях как о всех детях в онколечебнице","493":"ну тоесть если у тебя Н-ная связь между сущностями, то в каждой Н-1 прописывай на Н-2 делит каскад","494":"Нетт","495":"нет","496":"тоже норм проц","497":"Тут уважают всё. Даже глупые вопросы, которые решает гугл. Удивительно терпеливые люди собрались здесь","498":"похоже все наигрались","499":"Ребята, вы вообще работаете?) Как посмотрю в чат - вы все пишете и пишете :)","500":"+++","501":"Всё было расхерачено и нихуя не работало","502":"начиная с первой ссылки","503":"Тоесть миграция не делается? Тоесть у тебя проэкт не билдится?","504":"Или сам чай делать в мак с таким подходом","505":"Вы тут рофлите, да?","506":"а так я сам один раз ффмпег использовал","507":"Но с приходом индийца мягкие реально только лучше становятся","508":"Блятство да че вечно задачи попадаются на какие больше вопросов чем ответов на стековерлоу","509":"Аще не знаю че в Воронеже есть.","510":"как-то у меня настроение пропало","511":"То чье имя нельзя произносить","512":"у webrequest как передать тело?","513":"Кто-то в курсах как работает EndsWith? В том плане, ему все равно есть ли пробел или нет?","514":"Искал на гите, но не нашел","515":"на НГ будет день борьбы с алкоголем","516":"`public static class Helper\n{\n    public static List<T> RawSqlQuery<T>(string query, Func<DbDataReader, T> map)\n    {\n        using (var context = new DbContext())\n        {\n            using (var command = context.Database.GetDbConnection().CreateCommand())\n            {\n                command.CommandText = query;\n                command.CommandType = CommandType.Text;\n\n                context.Database.OpenConnection();\n\n                using (var result = command.ExecuteReader())\n                {\n                    var entities = new List<T>();\n\n                    while (result.Read())\n                    {\n                        entities.Add(map(result));\n                    }\n\n                    return entities;\n                }\n            }\n        }\n    }\n}`","517":"и обращаешься к нему","518":"потому что кругом пидоры и анимешники\nя правда не понял почему ты их разделил?","519":"Конечно есть! (они в европе)","520":"хочет чтобы с++ стал додиез","521":"А ок","522":"через сид ты говорил заполнять таблицу","523":"И у меня к ней много претензий","524":"но при чем тут Руслан?","525":"чё там было?","526":"хз, мне кажется внутри я просто какой то чсв пиздюк","527":"Спасибо","528":"всё я отключаю бота","529":"","530":"с запада","531":"Это ты у Шерзод а спрашивай, он эксперт","532":"\\","533":"Когда есть замечательный EF, но ты пишешь на SQL 🤦‍♂️🙈😂","534":"вспоминаю C++, хочется тоже блевать 😂","535":"","536":"а почему так много","537":"как понять?","538":"тоже ругается(","539":"для такой задачи асп - из пушки по муравьям","540":"Нет, если ты работал с этой залупой, то скажи куда сохранить и как потом сказать проге как работать с новым драйвером","541":"заменитель бл@я придумали уже","542":"Так, а зачем в 30 лет вопросы такие задавать в чате по c#, где 95% мужиков. Хотя я знаю, чтобы получить комплиментиксов.","543":"Как поживаете","544":"фу,обманщица","545":"и тебя не смущает что он досих пор такой лагучий?","546":"Давал","547":"и может еще кто знает, работаю с китайскими камерами, там дайджест аутентификация, не могу понять у меня хэши паролей различаются(кодирую нормально через md5)","548":"да, где-то там выбирается, точно не помню","549":"ну и таску Task.FromResult","550":"как у нас","551":"ну тут я тоже зафейлил","552":"что за сериал?","553":"А","554":"глазам смотреть больно","555":"да я угараю","556":"Кст. За последние года 4 у iOS на удивление стабильная beta версия","557":"ёбаный вопросительный знак","558":"мб конструктор класса сделать","559":"постоянные чего","560":"Ага","561":"в ООП тож агрегация есть\nclass A {\nAnotherClass object;\n}","562":"значения.взятьмножество(ошибок).взять(сообщения);\n\nили\nиз состояния в значениях из ошибки в ошибках взять сообщение","563":"если что cell это и есть то же самое что и лист,просто я присваю координаты через цикл","564":"И на том спасибо","565":"до этого хоть студия падала","566":"Однозначно","567":"мб сменить && на &","568":"у них своя база значит","569":"Що а зачем триггеры тут? Можно в миграции прописать самому в ап и довн.\nЕсть ещё чето типа create or alter или в старых версиях поиск по sys.object","570":"да это ему, он не любит wpf","571":"Делай всю логику бд в хранимой процедуре. Хранимку вызывают с нужными параметрами в консоли оракловской. Консоль вызывай из скрипта или еще чего","572":"\/\/начало функции\n\/\/конец функции","573":"Скажи что готов пообщаться языком тела, в горизонтальном танце.","574":"сейчас поставил точку и убрал тайп вообще","575":"","576":"Ну тут дело не только в деньгах","577":"Ии это машина могущая обрабатывать тонны инфы за секунду, призвана человеку дипфейки создавать через телегу","578":"Отправить почтой?","579":"Но люди работают","580":"Насчёт печенек и прочей херни тоже верно, просто привыкли что это везде есть","581":"","582":"","583":"Война штука ситуативная","584":"Кто-нибудь сталкивался с антидетект браузером.","585":"вдруг они когда-то захотят меня найти а из-за того что у меня будет аватарка они не смогут","586":"это который в яндексе синьор?","587":"А program должен быть обязательно статик?🌚 А почему?","588":"ulongdddouble","589":"народ, в винформах же тоже есть нотифиПропертиЧейндж?","590":"О и так во весь стол 😁","591":"или это не это хммм","592":"я фигачу людей киркой","593":"естественно","594":"Это не значит, что мы можем не следовать правилам государства","595":"без основ,есть книжка с++ за 21 день","596":"Што ты здесь делаешь?","597":"https:\/\/perm.hh.ru\/vacancy\/51960636?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=java","598":"Хеллоу","599":"И антивируса не нада","600":"хмммм","601":"Я про ООП\nСоблюдение \"правил\" \nВ структуре поля private и к ним через get set обращаться, иначе теряется суть ООП\nХз, я так думаю","602":"и деревья без практики?","603":"так у меня теперь нет корзины)","604":"","605":"","606":"нормально, пиши кастомный мидлварь","607":"иногда и тетя","608":"смотри в чем фича, можно писать на любом языке хорошо если умеешь, но какие то языки тебя ограничивают своей ебаниной а какие то нет","609":"запустил, всё так же как и через иис, ток локалхост другой","610":"это работает так,что если у тебя есть последовательность элементов которые вытягиваются из источника асинхронно ты можешь их перебирать в форыче и они будут подгружаться по отдельности а не будут грузиться все в память","611":"макросами делал","612":"я к андрюхе через адб подрубаюсь","613":"это отсутствие собеса","614":"Да, тут все окей","615":"Тоже интересно 😁","616":"","617":"так делать нельзя ))","618":"а вот так на основном срабатывает ок","619":"Да","620":"Там буду я из 2022±","621":"Ты","622":"Только экшен меняется","623":"Не. С ней я просто посоветовался и вопросы задавал)","624":"ну лан успокоил тогда ))","625":"https:\/\/t.me\/frontend_hranilishche\nВыбирай","626":"😂","627":"Обласная по решению задач на языках программирования","628":"ну харе 😡","629":"ты передаешь строку","630":"","631":"","632":"ну вот даже рабочий момент - была одна система в клиента из которой мы сливаем себе данные, её заменили другой, для каждой сущности проставили екстерналКод из старой системы - и мы себеспокойно дальше работаем по внешнему коду","633":"так мы использовали Visual Studio Installer, вроде как хватало","634":"Любой бесплатный, просто что б проверить","635":"на 100%","636":"а если реально по сотке скинуться, будет почту 170 000 деревянных рублей)  можно оборудовать рабочее место себе)","637":"нуллы бля","638":"Логично, что да","639":"Айкидос, вернись в токсиков","640":"сбилденный разве что)","641":"а получится так: \n\nwhile...\n{\n                    Thread.Sleep(100000);\n}\nтолько как-то, чтоб можно было продолжить раньше, чем таймер закончится?","642":"soap - мыло","643":"ну тут я хз чемпомочь","644":")))","645":"У тебя даже в вариантах точки","646":"эпилептик 8 же не?","647":"Ты предлагаешь ему на модель атрибуты навесить?","648":"Уважаемые знатоки. Интерну хочется попробовать сделать, Аля небольшой простейший кликер\/бот, для клиентской игры mmorpg. Про что мне можно почитать? Без компьютерного зрения, просто имитация нажатия клавиш.","649":"У-у-у брат...","650":"я вот думал, может нам самим такой подсказиватель начать пилить?","651":"Меня мой учитель в чс кинул .Теперь я сам буду учиться.Потом обоссу его в чате этом.","652":"блять да это ладно","653":"http:\/\/oracle-dba.ru\/database\/backup-and-restore\/","654":"про СLR ни слова, про GC пару вопросов, даже про Generations ничего не было","655":"У тебя, походу, просто не один эксэпшн.","656":"например @zizjan","657":"Даже хуже аниме","658":"спасибо большое!","659":"плюнул\/протер - воткнул пашет","660":"ну я пока попробовал в браузере, потому что обычно это работает","661":"","662":"банан хочу","663":"Спасибо, иди работай🤧🤛🏿","664":"я не про контроллеры, а вообще про авторизацю, хуле бы ее в UI блазора не делать?","665":"","666":"как десерилизовать данные, которые получил от сервера?\n.Net\nможет через какой json можно","667":"а че там с ооп добераться","668":"","669":"я поначалу вобще без интелисенса не мог и строчки написать","670":"Спасибо","671":"помоему тут и без дувайла код уебанский","672":"не блядь, хочу мускль с дотнетом","673":"остальное отбросил","674":"я бы лямбду в метод посылал,которая сама могет в это,но задание с автопроверкой,и на их стороне никакой лямбды не поступает,поэтому донт ворк","675":"поэтому набирали фулстэк?","676":"А он выебывается","677":"с добрым утречком всех","678":"да","679":"\"силы на хуйню\" это как раз о полетах на марс","680":"купил платные компоненты ?","681":"НУ БЛЯТЬ ПИЗДЕЦ ПРОСТО КАК КАЛИЧЕН","682":"Нихера не понял, ты какой-то укуреный","683":"до перла тут далеко","684":"Чет кто-то в динамик скуель пытается но не очень получается?","685":"Если на чистоту, то из 35 тел где я изначально работал было интересно только с двумя. Нет, я конечно не говорю что нужно изолироваться от окружения и вообще ЛЮДИ ЭТО ЗЛО!!!, но выслушивать про корыта, детей и кто где как напился это весьма прискорбно, а более-менее интересным темам не хватает глубины. Всё-таки коллеги это не друзья","686":"ну щас просто для примера показываю локльные","687":"я походу слишком молод для этого","688":"https:\/\/m.rozetka.com.ua\/offer\/31665983\/","689":"сам сеттер ты не пометишь как async, но можно внутри него создать новый таск и оттуда запустить асинхронный метод, но я даже не джун, чисто интуитивно )","690":"косяк ип","691":"хрен с ним, не нужны они мне уже","692":"Во-во","693":"Senior developer","694":"Лол, за 1000 не очень","695":"только дед умер, а пыха нет","696":"Да, мне здесь нравится.","697":"Хотя я не слышал чтоб народ это так называл","698":"если будут","699":"андрий тут?","700":"XD","701":"мне, на лечение токсика","702":"Соаботало","703":"public class Market\n    {\n        [JsonProperty(\"id\")]\n        public string Id { get; set; }\n\n        [JsonProperty(\"symbol\")]\n        public string Symbol { get; set; }\n\n        \/\/\/ <summary>\n        \/\/\/ Name of cryptocurrency\n        \/\/\/ <\/summary>\n        [JsonProperty(\"name\")]\n        public string Name { get; set; }\n\n        \/\/\/ <summary>\n        \/\/\/ Image of cryptocurrency\n        \/\/\/ <\/summary>\n        [JsonProperty(\"image\")]\n        public Uri Image { get; set; }\n\n        \/\/\/ <summary>\n        \/\/\/ CurrentPrice of cryptocurrency\n        \/\/\/ <\/summary>\n        [JsonProperty(\"current_price\")]\n        public double CurrentPrice { get; set; }\n\n        \/\/\/ <summary>\n        \/\/\/ Рыночная капитализация\n        \/\/\/ <\/summary>\n        [JsonProperty(\"market_cap\")]\n        public long MarketCap { get; set; }\n\n        [JsonProperty(\"market_cap_rank\")]\n        public long MarketCapRank { get; set; }\n\n        [JsonProperty(\"fully_diluted_valuation\")]\n        public long? FullyDilutedValuation { get; set; }\n        \/\/\/ <summary>\n        \/\/\/ Объем(24 ч)\n        \/\/\/ <\/summary>\n        [JsonProperty(\"total_volume\")]\n        public long TotalVolume { get; set; }\n\n        [JsonProperty(\"high_24h\")]\n        public double High24H { get; set; }\n\n        [JsonProperty(\"low_24h\")]\n        public double Low24H { get; set; }\n\n        [JsonProperty(\"price_change_24h\")]\n        public double PriceChange24H { get; set; }\n\n        [JsonProperty(\"price_change_percentage_24h\")]\n        public double PriceChangePercentage24H { get; set; }\n\n        [JsonProperty(\"market_cap_change_24h\")]\n        public double MarketCapChange24H { get; set; }\n\n        [JsonProperty(\"market_cap_change_percentage_24h\")]\n        public double MarketCapChangePercentage24H { get; set; }\n\n        \/\/\/ <summary>\n        \/\/\/ Циркулирующее предложение\n        \/\/\/ <\/summary>\n        [JsonProperty(\"circulating_supply\")]\n        public double CirculatingSupply { get; set; }\n\n        [JsonProperty(\"total_supply\")]\n        public double? TotalSupply { get; set; }\n\n        [JsonProperty(\"max_supply\")]\n        public long? MaxSupply { get; set; }\n\n        [JsonProperty(\"ath\")]\n        public double Ath { get; set; }\n\n        [JsonProperty(\"ath_change_percentage\")]\n        public double AthChangePercentage { get; set; }\n\n        [JsonProperty(\"ath_date\")]\n        public DateTimeOffset AthDate { get; set; }\n\n        [JsonProperty(\"atl\")]\n        public double Atl { get; set; }\n\n        [JsonProperty(\"atl_change_percentage\")]\n        public double AtlChangePercentage { get; set; }\n\n        [JsonProperty(\"atl_date\")]\n        public DateTimeOffset AtlDate { get; set; }\n\n        [JsonProperty(\"roi\")]\n        public Roi Roi { get; set; }\n\n        [JsonProperty(\"last_updated\")]\n        public DateTimeOffset LastUpdated { get; set; }\n    }","704":"Ну я имел. Но у тебя система явно по-другому спроектирована","705":"","706":"те же дженерики только при определенных условиях с ними можно сделать то что нельзя сделать с обыными дженериками","707":"","708":"json десериализовать обратно в коллекцию элементов","709":"Лучше ангуляр выучи","710":"я только прибавляю","711":"От десктопа все равно не откажутся, даже когда везде, даже в сраной африканское деревне, будет гигабитный интернет","712":"А какие знания нужны?\nНу там +-\nК примеру я +- знаю C# и немного разбираюсь в Unity, это же не значит что я готовый джун?)","713":"","714":"Оо фози прикольно","715":"сама техническая часть мало кого интересует. тут главное — грамотная записка, выполненная по всем ГОСТам","716":"лампочки?","717":"до директивы еще пока не довёл, в процессе","718":"","719":"ща я пришлю скрин когда к кругу градиент применяю","720":"можешь метод расширения написать типо extension","721":"ага, делаю\nгорит крч, всякие лсы пишут на вакансию джуна. зная лишь то бля как массив в жс инициализировать и все. а мои коллеги такие да конечно давайте пригласим его и будем платить зп как мне))\n\nв то время как я целый магаз на нет коре 3.0 писал пол года по трёхслойной архитектуре, они присылают гитхаб в котором тудулист на ангуляре 😅","722":"Между креслом и компьютером","723":"А чем умножение в одной системе счисления отличается от умножения в другой?","724":"я конечно не уверен, но для видеонаблюдения сетевые протоколы и видеопотоки вроде надо кодить а не веб","725":"Минтор?","726":"кидай, но приоретет игры, а именно кс го (фпс 70+ на даст2, гта5, мафия2, rocket league)","727":"допустим есть контроллер в котором нахуячено всякого для разных сервисов","728":"-1% ридонли ботов","729":"особенно последяя строка","730":"шо?","731":"А что это за троечка","732":"да я тоже  мне чет 2д привлекает","733":"ты сидишь в джс чате?","734":"и шо?","735":"При то, что его конкаренси модель похоже на ЭТО?","736":"там команд 10 которые юзаются от силфы","737":"но в итоге кароче проще купить продажную бабу чем приручить домшнего Ведьмака","738":"public delegate TOutput Converter<in TInput,out TOutput>(TInput input);","739":"Найс","740":"Всем хорошего кода и спокойной ночи)","741":"лучше оно чем отношения по неволе","742":"кто знает?","743":"пиздец","744":"Так послушать — будто жена что-то страшное и надо бояться её.","745":"Понятно, спасибо. Будем перегружать значит.","746":"а щас чё?)","747":"Задача такая)","748":"","749":"У структуры есть конструктор по умолчанию пустой","750":"Есть еще совет, тебе юнити интересен?","751":"Да походу","752":"","753":"заранее","754":"там можно на лету патчить методы","755":"сложно выглядит, ты имеешь в виду переопределение методов преобразования типов?","756":"","757":"там разве нада тригер?","758":"т.е. без названия кнопки","759":"Наверняка можно как-то","760":"Винда погоду стала показывать","761":"нет безопасности в вэбе","762":"Похуй ложил уже дважды релиз","763":"сука","764":"lol","765":"","766":"ты еще скажи что с темной темой дебаг чётче работает","767":"так ...","768":"Дело не в том что они устаревают. Циклы и массивы в программировании будут всегда. Дело в том что процесс обучения как-то по-уебански(извиняюсь) построен. Например на лекциях люди зачем-то в тетради пишут какую-то воду под диктовку лектора, в стиле \"Цикл это - блаблабла\"...","769":"в телефоне это слово называется акселерометр","770":"Подключаешся и получаешь поток данных","771":"В манифесте указать админскую роль надо","772":"При почечной недостаточности гипергидратация связана","773":"Да","774":"типа while(flag) ?","775":"ох я не знаю правильно ли я написал","776":"подой бизнесов, покос бабла!","777":"скинь ТЗ","778":"У тебя есть высшее?","779":"эти массивы равны null","780":"Это посмтеновский токен","781":"чё на основе интересно","782":"аж плакать хочица(((","783":"Долларов","784":"Да, сейчас пока лучше не обращай внимания. Как к изучению внедрение зависимостей приступишь, тогда поймёшь","785":"Даже если в душе?","786":"ну, если сильно постараться","787":"ладно, с тобой всё понятно","788":"собес проходишь?","789":"Всем привет. Кто знает библиотеку про распазнование math формулы?","790":"+++","791":"за STT справедливо. Остальное - хуита","792":"уххх","793":"Давай","794":"","795":"Массив, словарь, что угодно","796":"Rust\/C++\/C","797":"Как это сделать?","798":"Моно ставить","799":"только не ленись описывать и параметры","800":"Вспомните свою радость от 1го хелловорда","801":"я непомню это давно было все были пьяныек","802":"дэдлайн","803":"Из жопы","804":"Так го меряться компуктерными писюнами","805":"Которое потом рефачить хуй знает сколько","806":"=) ну да ккодировка =)","807":"63.17:50:36.8303590","808":"Ниче не понял","809":"суть та же","810":"покажи бинд","811":"вот скрин выше который работает","812":"у меня дети тащаться","813":"а вот эти клин коды хуеды кому это надо если ты попадаешь на проект где этого в помине нет?","814":"https:\/\/ru.stackoverflow.com\/questions\/222414\/%D0%9A%D0%B0%D0%BA-%D0%BF%D1%80%D0%B0%D0%B2%D0%B8%D0%BB%D1%8C%D0%BD%D0%BE-%D0%B2%D1%8B%D0%BF%D0%BE%D0%BB%D0%BD%D0%B8%D1%82%D1%8C-%D0%BC%D0%B5%D1%82%D0%BE%D0%B4-%D0%B2-%D0%BE%D1%82%D0%B4%D0%B5%D0%BB%D1%8C%D0%BD%D0%BE%D0%BC-%D0%BF%D0%BE%D1%82%D0%BE%D0%BA%D0%B5 я вот отсюда свою ебаторию и начал","815":"Странно что тут серым выделило, навели на него, что говорит?","816":"Здравствуйте не знапте как воспользоваться AWS с помощью c#","817":"Да там на что только не собирают, в плоть до 1кг картошки.","818":"ПАЦАНЫ, продавцы Мвидео раскрыли секрет!! Частота процессора падает каждый год!","819":"куда дальше стрелять говори","820":"впф вместо формочек (( нунахер (((","821":"добраночек","822":"к классу","823":"ахахахах ))) да вы чё девок программистов дохера","824":"say no to wpf","825":"где он такое говорит? \nhttps:\/\/docs.microsoft.com\/en-us\/dotnet\/csharp\/language-reference\/operators\/arithmetic-operators#integer-remainder","826":"Капец ты странная","827":"для начала","828":"Dictionary","829":"","830":"много","831":"если подписку не сделаю не будет, а в памяти будет где-то сидеть первый экземпляр с подпиской или нет?","832":"я хочу в один файл сохранять... и не очень хочется лепить класс который объединяет эти данные","833":"Страшна вырубай","834":"","835":"нет, не странно. смотря что ему нужно","836":"пофиксил","837":"да не разбирается он второй день - просто завтра сдавать, а там конь не валялся. Задание четко разжевано и совсем легкое.","838":"","839":"но убил то ведь ты","840":"Кстати, ты код для микропроцессоров пишешь?","841":"Пеленка и это в 21 веке в 2к18 году.","842":"Не всегда, далеко не всегда)","843":"тут очень много факторов.какие офисы,какой проект,какие технологии,какие люди,какая компенсация,какая карьера,какие плюшки","844":"А конкретнее?","845":"Я бомж.","846":"а вот это мне давно хотелось","847":"было где то","848":"да я щас от плойки не отрываюсь","849":"дада, ступил в данном случае.","850":"Такое знать для меня еще рано наверное","851":"я имею в виду на теле где? Мне чуток выше машонки","852":"почитай книги про Data Structures (Структуры данных)","853":"никогда не работал с делегатами","854":"В день пар др был , когда мы только начали С#","855":"не получится - аккаунт девелокера надо а не тел разлоченый","856":"Какие простые и в тоже время великие слова.","857":"Шо глянуть?","858":"буду","859":"Пшел нахуй","860":"мне ебало не раз ломали ес че","861":"точнее не нужно.","862":"да","863":"Надо тебе такие ячейки, сделал рендер","864":"","865":"А не зная очень сложно.)","866":"какой прекрасный язык...","867":"да, тебя хотят убить","868":"Буду надеяться что он просто занятой чел а не всем отделом они 3-ий день ржут над кодом","869":"можешь у него спытать","870":"что?","871":"все","872":"++","873":"https:\/\/codeburst.io\/working-with-json-in-net-core-3-2fd1236126c1","874":"1G","875":"я не понимаю нахуй писать треды вайл тру какие-то","876":"Я святой","877":"первое вызов метода консоли, второе метод формат, посл конкат","878":"так и есть","879":"Сегодня был первый день, и первый мой опыт работы с формами в С#, на вау-эффект не стоит от меня рассчитывать","880":"","881":"ну да, значит стринг файлнейм раньше объяви пустым","882":"ничего , просто проходит  и след  строка получает  такойже процесс как и первый","883":"зачем?\nон подумает что у него есть выбор","884":"аааа","885":"Нет ли в выходном датасете двух полей с одинаковым названием?","886":"ладно пойду тогда в чат по астрелинукс спрошу где меня еще не забанили","887":"Надо с чего то начинать. Выкладывай свои мысли","888":"почему они отмечаются сразу 2?","889":"Все ок","890":"С++ за час\nС# за час\nДжаваскрипт за час","891":"ну теперь понятно","892":"Билли Херрингтона","893":"Если зайдет, то стоит. Но для 90% кодеров это скучная хоть и толковая книга. Не зайдет - забей","894":"","895":"можно ли асинхронно использовать запись файла? (System.IO.WriteAllBytes)","896":"мне девушка сказала что тест 2 палки показал и у нее задержка а мне всего ебать 23 года","897":"Душевно сказал","898":"Дай свой гитхаб пожалуйста.","899":"уедешь","900":"404 это доступ запрещён вроде не?","901":"Анюта?","902":"я не говорю что там на 100% всё чисто","903":"э, а где свифт?","904":"ну конкретно здесь делает активной всю строку и передает значение перевой ячейки строки для отбражения в лейбле","905":"Можешь в аэропорт подъехать xD","906":"да это тролль","907":"ну так понятно","908":"","909":"Комбинаторика, пацаны, я вошёл в такое положение, что  осознал суть немощности без знания матана","910":"","911":"есть че нидь  типо коммунти","912":"Работать надо, а не играть)","913":"😁","914":"dotnet dev-certs https --clean вот эта команда очищяет","915":"и как этот паттерн реализовать если в базовом контроллере диспоз не виртуальный","916":"остальное по мякотке было внутри xaml","917":"@KapLead родной","918":"Я тоже себя так утешал","919":"я только про автоприцеливание знаю","920":"а тут нету","921":"хз","922":"не знаю","923":"типо например как в кино народ против крамера","924":"acer nitro 5 у меня, ноут заебись, так что не надо гнать)","925":"Нормальный заказчик может платить от 900к в месяц","926":"не делать О_О??","927":"Слив защитан","928":"Дякую","929":"хуле, у тебя ни дитей ни жены","930":"че происходит?","931":"Речь идет про правила. Закодить можно что угодно, хоть возведение копеек в квадрат, если кто-то ебанется.","932":"том*","933":"=)))) вроде все кейсы проходят) задание приняли)","934":"ТхенБу","935":"есть другой вариант","936":"ме","937":"Чтоб через полгода был на битрексе","938":"фрот?","939":"когда полмира под ними будет, тем более будет востребован","940":"","941":"я так и не раскурил этой темы","942":"\/g","943":"хочешь максимум скорости - придется платить...","944":"0 логики","945":"да","946":"Хочешь кодовую многоножку сделать?) Сначала код пойдёт в твой интерпретатор, потом код на шарпе пойдёт в csc, потом байтовой код транслируется в машинный, и только тогда код выполниться.","947":"Узбекистан?","948":"я только вчера начал разбираться как работает gc","949":"че эт за зверь","950":"я уже почти сделал чтоб переводило выражение","951":"а онли юзать гуид если только придерживаться практики что лишний запрос после создания ни к чему","952":"это в ее стиле","953":"ааа","954":"Буду тут у тебя бесплатные советы выпрашивать :-)","955":"или убери фигурные","956":"Пардон, в startup","957":"Увидела и приняла как родного","958":"И тело в порядок привести","959":"для понятности","960":"Чтобы присвоить значение свойству объекта. Если напишешь name = name, то получается что переменной name присваевается ее же значение. Поэтому указывают this.name, чтобы компилятор понимал, что нужно присвоить значение именно свойству объекта","961":"Вот умора.","962":"Вы тут крутые программисты, расскажите как вы учились?","963":"я даже про пску забываю","964":"https:\/\/eax.me\/winapi-threads\/","965":"","966":"а мне надо одно","967":"Юнит фактори","968":"скорее всего","969":"помочь не пытались но поняли","970":"Узбекистан, Ташкент","971":"Иначе огонь может продолжить гореть, а люди будут задыхаться — сначала из-за дыма, а потом из-за того, что стало меньше деревьев, которые вырабатывают кислород. Не говоря уже про свалки, которые тоже могут сгореть","972":"беру мангу дб","973":"Цей предмет виводив мене з себе, це по суті мені снилось в найгірших моїх снах","974":"а? проблема?","975":"Типа того","976":"Это тупо, но мне кажется сработать может","977":"А шо уже новая версия","978":"а как сделать чтобы 100% запустился в отдельном потоке? Task.Run(() => (имя метода));?","979":"понял,  спасибо)","980":"Бля я не анимешник но тоже захотел)","981":"или я наебываюсь","982":"Просто добавить в джсон ещё одно поле из названия типа и тупо сериализировать в конкретный имхо проще и универсальней","983":"У меня так брат до 34 без жены","984":"ну как-то вот так","985":"всё что пройдёт по ws злогируется, потом разбераеш что да как","986":"если можешь проект с нуля поднять, внедрить, суппортить, а потом еще и не говно получится\n\nну и строго желательно всё это уметь не руками делать, а автоматизировать и понимать как чо работает","987":"","988":"За неделю","989":"иди поучи матчасть","990":"https:\/\/m.habr.com\/post\/151703\/","991":"Лучше не надо","992":"Но как я понял, тайп скрипт сейчас топ и жс уже никто не пишет?","993":"насколько я помню JOIN имеет небольшую разница","994":"И снова я, как вывести массив через цикл foreach ?","995":"Я хочу 6ти значную зарплату но мне лень ходить на собеседования 🤭😂","996":"","997":"А то спра8иваешь что будет если жепу бумагой вытереть...","998":"хуйня, давай пиши по новой","999":"И шо это"}}