{"text":{"0":"Ты специально используешь длинную нотацию, чтобы запугать людей","1":"Точно чит)) Можно сделать оверлей для приложения.","2":"dynamic webBrowserDocument = webBrowser.Document;\nstring html = webBrowserDocument?.documentElement?.InnerHtml;","3":"Хорошая стрелочка","4":"буду знать","5":".ConfigureAwait(false) как раз не дает задаче вернутся в поток из которого была запущена, чтобы избежать дедлока","6":"Верно.","7":"да.","8":"","9":"Да, это понятно, но какие бест практисес в этом случае? \n\nВ общем я думаю тогда юзера кастомного в Identity контексте хранить, а все остальное в обычном контексте","10":"Вложенность. Это их сколько угодно может быть?","11":"хм, реально работает.  а в 472 не работало почему- то","12":"Начать","13":"","14":"Мне сейчас нужны азы","15":"Но мб я неправильно понял","16":"не уверен, но я где-то читал, что мсил у кора и фреймворка немного, но различается","17":"+","18":"Ну да ладно!","19":"У тебя у самого аргументы уровня \/b","20":"А ты можешь с другим?","21":"Уже на волоске, если что.","22":"Для бывалых","23":"через \"серилог\"","24":"та я верю","25":"потому что при создании группы всегда есть 1 участник, чтобы сразу его добавить в список. а потом по ходу работы программы этот список будет пополняться","26":"Через групповую политику отключал?","27":"Тебе нужно узнать, есть ли в БД пользователи с таким же email или userName, которые ввел новый пользователь при регистрации :)  - > запрос к api","28":"linq2db","29":"И виноват в этом будешь лично ты","30":"Ну если инжектнуть в нужный процесс CLR и стартануть","31":"Привет всем! Я тут с вопросом. Я переехал в Турцию ещё до сами знаете каких событий. И ещё я ищу работу с текущими обстоятельствами это немного сложно. Мне могут здесь помочь, если я изучу C#, MVC и бд sql разные. Я сказал, что посмотрю за месяц что-нибудь изучить и дам ответ. Можете посоветовать как быстро войти в .NET. Сам я full-stack разработчик на javascript и node.js, React и сопутствующие технологии.","32":"а если тебе платят хорошие деньги но неинтересно, ты будешь учить?","33":"я ищу просто цельные фразы","34":"И я думаю поменять ли на фк просто инт айдентити","35":"датагрид мне тож не нравится. если сиквел - то azure datastudio или ssms","36":"Where","37":"могу гарантировать, что 3 инструкции выполнятся быстрее, чем эти же 3 инструкции и еще любые 2","38":"Или все оператор, что не значение?","39":"Подскажите, как развернуть докер на windows хостинге?","40":"Rigidbody2D Это класс","41":"Посмотри чейнджлист","42":"Привыкай, это только начало","43":"😐","44":"Если часы переведут назад на день, у тебя всё встанет колом","45":"Оказалось, что у него класс отнаследован от `MonoBehaviour`, а у него за каким-то чёртом перегружен оператор сравнения, и делает какую-то дичь на сравнении с `null`.","46":"Json более лаконичный и меньше дублирующейся информации.","47":"Хэши от хэшей","48":"Что за прога ?","49":"Может скомпилированный запрос.","50":"","51":"Без понятия, ни разу не использовал winpcap. Но, кажется, это просто штука для заворота трафика в прокси?","52":"понятия не имею","53":"может лучше не использовать это легаси?","54":"Никогда не было такого компонента. А поддержку VB.NET не удаляли, она есть. Если ты об этом.","55":"типа просто впихнуть в контейнер, обернуть в интерфейс и каждый раз отдавать просто реализацию?","56":"https:\/\/fluentassertions.com\/documentation\/#object-graph-comparison","57":"может кто-то подсказать как в IIS опубликовать два сайта?","58":"у него есть свойство baseUrl","59":"А вообще - это ведь странное поведение, такого быть не должно","60":"даже студент так не скажет","61":"там и оформление заказа переделывать","62":"Или Windows terminal","63":"В первом случае ты передаешь ссылку на List","64":"Ну а что поделать 🤷‍♂️","65":"спасибо, посмотрю параллельно книге","66":"Куда тыкать?","67":"ну я еще не открывал список пакетов, я просто редко лезу в json из под шарпа","68":"2019 студия?)","69":"> лень исправлять отступы\n> одна команда баша","70":"так, а как в эту схему добавляется апигетвей ? \n\nЕсли мне нужно с фронта послать запрос на бэк (апи гетвей, который отреверспроксирует на нужный ендпоинт), то как оно авторизовывать на конечных сервисах будет ?","71":"https:\/\/i.imgur.com\/9CeFR56.gifv","72":"Так и есть","73":"ну ты мож создать себе","74":"При десериализации","75":"Личная страничка","76":"Потому что ну откровенно ерунду пишешь","77":"На работе буду, посмотрю как я делал, тоже были какие то траблы с типами ячеек","78":"Опять твои конфликты!","79":"любые бест практики","80":"Да и разрабы из Microsoft часто упоминают её","81":"https:\/\/habr.com\/ru\/post\/169231\/ Вот посмотрите вариант","82":"svn мёртв","83":"В данном случае - что удобнее. На функционал никак не влияет, а в случае с ASP.NET ускорить написание используя minimal API не получится","84":"и объясните мне чем же этот сайт такой плохой","85":"глобально это к мидлварям","86":"ок бро! еще вопрос а DLL под линукс как сделать? чтобы PInvoke работал. или лучше не заморачиваться и в отдельном процессе вызывать си код?","87":"Да, ты правильно вспомнил. Ещё они вырезаются, если для них не написано тело.","88":"Сделать наглядную схему для заведомо замороченной предметной области очень сложно","89":"lol","90":"Давай, буду признателен","91":"Выше уже писали - зависит от бизнес-логики. Для простых задач без сложных зависимостй и т.п. нет смысла использовать hangfire","92":"На какой строчке точно вываливается?","93":"Что может быть в этом фильтре на так, если он возвращает одну строку 17 раз","94":"Ну это я уже понял, спасибо","95":"Не могу сказать(","96":"он обычно их не выдумывает. А вот при их использовании может выдумывать несуществующие типы и апи","97":"А при чем тут пробел","98":"Без призыва юзать gql","99":"ну или попробуй обратиться к тем кто курсы ведет","100":"var processlist = Process.GetProcessesByName(\"cmd\");\n                foreach (var process in processlist)\n                {\n                    process.Kill();\n                }\n\nПробую так, не убивает процесс","101":"Garbage Collector","102":"Спс огромное !!!","103":"`var index = doc.InnerText.IndexOf(\"<table\");\n            Console.WriteLine(new string (doc.InnerText.SkipWhile( x => x != doc.InnerText.ElementAt(index)).ToArray()));` вот такое получилось, спасибо за совет, помогло","104":"Давай.","105":"ну мне компилятор и ide говорят что s1 это `string`","106":"Ну все-таки раз на SO есть ответ с OpenCV связанный, то определенно связь есть какая-то","107":"А он ведь через докер только поэтому онли винда?","108":"будет дамп структуры без данных","109":"надо вызвать функцию после Where на каждый найденный обьект, а потом выбрать оттуда значение","110":"Над этими 2 параметрами сижу уже 3 день","111":"оно только с нет6 если чо","112":"Да, спасибо, что ж вы ранее не сказали, они же такие содержательные, я сразу же понял в чем суть вашей проблемы","113":"медиатор","114":"я нашел то что иска","115":"google -> postgres compress data","116":"пальцем)))","117":"Тебе нужен список точек, так?","118":"","119":"блин, я наверное не то установил","120":"Если коротко:\nТак как то что я выкапываю сейчас из исходников шарпов - async\/await и таски писали больные на голову извращенцы и использовать их крайне не рекомендуется никому.","121":"фантом не расстроил","122":"Что dbcontext не установлен","123":"Ссылочные поля ссылаются в хип,  поля значений лежат в стеке. Gc потом отслеживает отсутствие ссылок на те поля, после очистки стека и работает с ними","124":"IntPtr hwnd = FindWindowA(\"MozillaDialogClass\", \"Настройка имеющейся у вас учётной записи электронной почты\");","125":"Да","126":"Почему?","127":"Который да","128":"тут канал нубов чтоли","129":"FirstOrDefault попробуйте","130":"и покажи контекст","131":"Ну вот в обычных реалиционных базах понятно как организовывается связь между таблицами. В NoSQL всё подругому. Хотелось бы понять как строить коллекции, связи между ними, какие вообще принципы есть.","132":"кинуть в лс?","133":"Ебать сегодня жирно вбрасывают","134":"Я так понял платформ уно и авалония это одна степь?","135":"https:\/\/ru.stackoverflow.com\/a\/416086","136":"Хуета какая-то","137":"Нет,\nу меня в чате\n1 ChatUser который Creator\nM ChatUsers которые Participants","138":"Сборки загружаются по мере их необходимости","139":"Потому что, уж поверь, __весьма маловероятно__, что твой знакомый на плюсах сумел повторить его логику по сериализации дотнет-типов.","140":"ну, в том числе и для того, чтоб дали по шее за нежелание гуглить.\n\nв чем-то товарищ прав.\nпо хорошему, писать в чат стоит в стиле \"нужноо Х, я попробовал А, Б, В и не помогло\"","141":"Navigation свойства, EF справится сам. Если это возможно - одним запросом, если нет - сам под капотом сделает несколько","142":"а вы откуда берете?","143":"","144":"шарп 8 можно юзать и в коре 1, ему похуй","145":"Оно просто парсит по сути","146":"т.е. просто написать условно google.com\/kekpuk.txt","147":"\"где i от...\" Ты имел в виду bi, а не i я правильно понимаю?","148":"ей она и не нужна, по сути","149":"Скачивал только юнити да визуал студио","150":"Да, в примере указал необходимый минимум, там много полей","151":"я обычно сначала создавал контекст","152":"Nunit последняя версия.","153":"https:\/\/github.com\/migueldeicaza\/gui.cs :)","154":"Не, это понятно, но под капотом-то там скл)","155":"кстати, в Rust const означает и то, и другое. Что может быть в compile-time - там оно и будет","156":"Чо хочешь, то и используй","157":"да","158":"он не null","159":"ну тз такое","160":"я даже не знаю как тебе описать мою радость)))","161":"👍👍👍","162":"И он у всех объектов разный же?","163":"Ну он действительно кривой для ряда юзкейсов, change tracking в некоторых сценариях использования ORM может мешаться.","164":"А если всё же добавить конструктор без параметров, как он просит?","165":"Через стрим","166":"есть == так пускай бы оно и в африке было ==","167":"Характеристик.\n\nЗачем поля все выводить?","168":"я пересылаю ее в исо","169":"Я могу и дату регистрации сохранить","170":"Раньше так называли, когда в пререлизе был","171":"пытаюсь сохранить созданные таблицы, выходит бесконечная обновление","172":"Конструктор не место для сложных вычислений.","173":"на Net 6 еще нет в планах перевести веб?","174":"https:\/\/github.com\/aiframesharp\/AIFrameSharpNonCommercialRus Хотел сделать аналог нумпай, скайпай и скайкет лерн на шарп. Но сейчас пошел в сторону интеграции с питоном. Как сделаю релиз новой версии могу скинуть.","175":"производительность это тоже частность. синтетические тесты не всегда показывают то что надо. Конкретные проекты часто затачиваются под конкретные СУБД, чтобы максимально эффективно использовать конкретную СУБД","176":"Ну не обязательно эвентлуп, в виндовом софте часто асинхронный io на отдельном пуле потоков процессят","177":"да, без этого сахара писал бы ручками `myObj.Connection.Close(); myObj.FileStream.Close(); ...`","178":"в такой код залезешь и охуеешь","179":"К нему можно имплисит кастов приколоть, и вообще будет норм, кажется.","180":"читаешь главу, пишешь 3-4 консольных проектов, так будет лучше","181":"спасибо догнал теперь","182":"больно слышать, когда у тебя в древнем легаси используется bison + flex :(","183":"Интернета небыло - удалился из чата","184":"почему?","185":"Виндусовской длльки","186":"а смысол","187":"либо если сервер то что-то сложнее","188":"Пользовался обоими. Завелось в обоих случаях моментально.","189":"long myVar = 123;","190":"😂","191":"я конвертировал строку в массив байтов","192":"да, сейчас через него и сижу","193":"искать библиотеку для корсса\nили реализовать под каждую платформу свой варик","194":"https:\/\/qna.habr.com\/q\/571004\nвот тут интересно написали","195":"изменили чтоб не путались люди","196":"ага, красивая идея, но пусть ее сделает кто-то другой","197":"Вряд-ли","198":"оригинал вот так отправляет","199":"Так?🥺","200":"Или костыльно.....?  Надоело мне с CentOS возиться)","201":"ну среди перечисленных я вижу только 1 иде - это райдер, вс код это не иде","202":"насколько я помню гуиды могут совпасть, если генерят разные компы и вероятность близка к нулю","203":"Нужно смотреть по мере необходимости. Сейчас проще iqueryable наружу отдать и всё\nMap тоже снаружи лучше делать, вряд ли там будет часто переиспользоваться","204":"знач пишем на сишарпе, подмножество доказано )","205":"и из него надо вызвать какую то магию","206":"короче нужно с куками работать","207":"либу почини","208":"где прочитать про body get,post,delete","209":"сложно не знать что она есть https:\/\/visualstudio.microsoft.com\/downloads\/ когда она сразу бросается в глаза кнопой \"бесплатная загрузка\")","210":"что это за жесть?","211":"ага🙂","212":"Я это и имел в виду, да","213":"Таки да, `\\p{L}` — это \"All letter characters\".","214":"Т.е. это гораздо больше 100 потоков","215":"ахахаххахахахахах","216":"кубером деплоишь кстати уже?","217":"точнее брать из буфера","218":"FindAll должен вернуть List<GameObjectComponent>","219":"Ну и, извини, но я не верю, что ты искал в коде Visual Studio и не нашёл там ни одного `WriteConsoleW`.","220":"да","221":"Разве мс тест жив ещё?","222":"","223":"мб они в гитигнор файле?","224":"Иди сюда, что ли: @probuildsystems","225":"Короче не всё так просто в мире видео =)","226":"райдер ❤️","227":"Когда смысл есть - буду проверять в обоих случаях, когда нет - только в случае с нуллами.","228":"Фикси","229":"Либо писать полное копирование что означает пересоздание всех классов либо использовать структуры которые копируются по умолчанию (кроме ссылочных типов)","230":"несколько раз приходилось пользователя гос услугами, всегда все четко было","231":"Как можно посмотреть в студии, где затык в другом потоке?","232":"а выполнить ее может поток (Thread), который берется из пула потоков","233":"хм хм","234":"Вся суть, что как сам контейнер гонять!","235":"Куки это часть http протокола, не важно в браузере или нет","236":"если его всего раз в начале материализовать","237":"если один из моих сервисов будет работать с жд, мне надо его делать statefulset?","238":"Нет","239":"+","240":"","241":"аааааааааа, это различные вещи","242":"но сложнее в пару раз чем на метаните","243":"Может, нам тоже надо спрашивать.","244":"Спасибо, учту","245":"как я понял для того чтобы различать статик методы от динамичных, вот в первых двух делаешь методы статическими, а потом переделываешь их \"динамическими\"","246":"каким образом?","247":"❤️‍🔥","248":"где у каждого в комнате доступ в интернет, трехразовое питание, и вообще пятизвездочный отель емнить","249":"Ладно, наверно пока стоит взять такой варриант, в любом случае не думаю, что будет много лишних очередей","250":"У меня щас вот это скомпилилось.","251":"о спасибо! выглядит интересно.","252":"оказывается у этой ошибки SqlException есть свойство Number, в котором указывается номер ошибки.\nChatGpt подсказал\n\nFor example, the Number property of the SqlException object contains the error number that was returned by SQL Server. This number can be used to look up the specific error message in the SQL Server documentation or error message catalog.\n\nThe error number 2627 in SQL Server indicates a violation of a unique index or constraint. This error occurs when you try to insert or update a row with a value that already exists in a column or set of columns that have been defined as unique.\n\nКак итог:\ncatch (SqlException ex)\n{\n  if (ex.Number == 2627)\n    return \"Login already taken\".\n}\nЧто то типа того","253":"","254":"Можно! Никогда не видел, чтобы так делали, но, по идее, ничего не мешает скачать файл и потом Assembly.Load на него. Другой вопрос — зачем (могут же быть кейсы, когда нет интернета — пользователь захочет что-то сделать и всё зависнет. да и кодес становится уязвимым к mitm и другим. хотя если чексумму проверять, то будет ок)","255":"Глуповатый вопрос, но все же: насколько важно .net-разработчику на C# под бэк знать веб(js,html,css,фреймверки разные) ?","256":"ну, в общем экспешн в таком случае и выбрасывается","257":"игровой сервер у знакомого  с 250 онлайном спокойно на LiteDb работает","258":"ну я даже не знаю, гуглить не пробовал?","259":"`let inline ignore _ = ()`","260":"в пхп от этого ушли потому что слишком говнокод получался. Почему в дотнете добавили я не оч понял","261":"Что!","262":"Это как посмотреть.","263":"Правильно ли я переделал","264":"Вот в этом и проблема Я его в наверху создал","265":"скорее всего даже все случаи не выйдет, есть же лимит на количество параметров","266":"что за админка такая, в которой будут заметны просадки в производительности из-за пользования ОРМ?","267":"","268":"Перечитай ещё раз текст сообщения, вдумчиво","269":"ну скажем так, мы знаем типовых клиентов  по телеметрии - которые используют наш софт","270":"пишет неправильное имя директории)","271":"Что?","272":"Могу конечно ошибаться, но тебе надо либо в абстрактом классе указать такую же перегрузку либо в классе в котором ты их переопределяешь писать этот метод без override.  Иначе ты пытаешься переопределить метод которого нет в абстракном классе и будет ошибка","273":"Не, предположим, что [ATTACH и это [\/ATTACH] всегда присутствует.","274":"написанно же","275":"соответственно перегружать в дочерних классах, можно конечно и типы подсовывать и дженерик сделать и много чего, но что-то мне кажется что сама архитектура странная, не должно быть оружию разницы серверное оно или клиентское","276":"Там нет деплоя, я буквально руками файлики складываю","277":"Что тебе нужно?","278":"короче мутная тема, но раз сделали то нужоно","279":"","280":"","281":"гугл -> геокодер","282":"https:\/\/docs.microsoft.com\/en-us\/dotnet\/api\/system.runtime.interopservices.marshal.readintptr?view=net-5.0\n\nМожет что-то такое?","283":"да, это изи","284":"","285":"Можно будет банкомат какой то сделать,","286":"пронет?","287":"т.е. решарпер","288":"","289":"Нет)","290":"some kidn of an automaper from wep abi core build in","291":"Может вы еще не любите GC за неявный malloc?","292":"для этого у тебя есть весь C#","293":"а потом гуглини","294":"Когда я кликаю на настройки, в cshtml из usermanager я достаю Юзера и Связ.данные юзера(данные профиля). Почему то открывается она после 2-4 сек. Пк слабый у меня но не думаю что это так сильно влияет","295":"","296":"это ж профессорвеб убрали )","297":"да кстати вот этот момент совсем не очень","298":"MVVM увы, не смогу","299":"Всем привет мне нужно реализовать возможность Подписки пользователя, на неделю, две недели, месяц, два месяца, год.\nОн сам выберет на сколько он хочет подписаться, для каждой длительности подписки будет своя цена, подскажите как мне в базу занести что если пользователь выбрал подписаться на одну неделю - к его дате прибавилось 7дней, это понятно, а если он выберет месяц, что тогда делать?","300":"medis для мака","301":"https:\/\/docs.microsoft.com\/en-us\/ef\/core\/querying\/related-data\/eager#including-multiple-levels","302":"this.Alert.......","303":"А то в каждом месте добавлять эти опшинсы","304":"А что это такое? Можно ссылочку?","305":"хм, что за бред. достаю из базы decimal значение, а оно ругается Numeric value does not fit in a System.Decimal)","306":"Если у вас в бд стоит настройка автогенерации праймари ключа, то бд надо дать команду, которую вы указали. Кроме как сырого выполнения никак.","307":"","308":"ребят подскажите пожалуйста, как правильно такую диаграму составлять?","309":"sqlite","310":"А, ок :)","311":"тоесть на любой ос","312":"REST API","313":"хотя тут очевидно, что ну никак он нулем быть не может","314":"https:\/\/qrng.anu.edu.au\/","315":"Проект на сторонней платформе, привязаны к ней. Разрабы платформы вроде переходят постепенно на кор и новые версии языка, но пока сыро и непонятно по срокам когда можно будет пробовать апгрейдить и тащить в прод.","316":"Я вот например это вижу","317":"С одного апи","318":"теоретически, я могу так сделать, и даже за 5 секунд","319":"спасибо","320":"жаль, что дышать иногда сложно))","321":"Могли и догадаться, что я повешаю экстеншен на `void`!","322":"Клиент никак не валидирует данные?","323":"нет","324":"вот выше Антон хороший пример отправил\nиспользуя s.Length - мы смотрим все что вбили, а не столько, сколько указали в начале (N)","325":"Эм? Серьезно","326":"на SO тебя не кидают через болт, если ты указываешь на ошибку","327":"какой вопрос такой ответ","328":"я бы .split по # и тупой string a == string b","329":"а если задание звучит так: \"Он считает со скольких отрицательных чисел начинается последовательность\", то можно избаится от переменной \"c\", и просто проверять введённое число на >=0, тогда при выполнение ответ можно вычислить с помощью i","330":"","331":"в организации uid это его скажем так идентификатор а name уникальное имя, я хотел бы сделать name первичным ключом, а uid внешним ключом, что бы в других таблицах на подобии юзера вписывать как 'ссылка' на организацию","332":"А все спс","333":"NRT позволяет внутри проекта иметь согласованное состояние, чтобы четко понимать что, где и когда у хранится, но это не панацея\nНо это не панацея на пограничных случаях между разными библиотеками\/доменами\n\nАргумент про \"можно не делать проверку и не тратить перформанс\" - бред, в микрооптимизациях практически никогда нет таких ситуаций, а в каких-нибудь микросервисах if\/else - это не то, о чем стоит задумываться при оптимизации","334":"И они могли забыть про publish action","335":"Это ты их обижаешь","336":"Потому что так в dll изменять которую я не могу. Она поставляется разработками софта. Как api к их софту","337":"проще всего взять http:\/\/www.dependencywalker.com\/ и глянуть чего нехватает для загрузки вашей dll","338":"Отвечать на запросы некому","339":"Того о чем вы говорите. Просто C# не совсем родной язык.","340":"Да, прометеус будет агентом который ходит, а в графане дашборды.\n\nА какие алерты тебе нужны? Какую задачу ты решаешь?","341":"Нет, не всегда\nНовичкам лучше вообще его не трогать","342":"Доброе утро. Подскажите, пожалуйста, как в vs code добавить путь к динамической библиотеке","343":"О","344":"Нет. Условия старые. Преподаватель разрешил использовать любой язык, но принцип все тот же","345":"Чо","346":"Верно.","347":"https:\/\/codereview.stackexchange.com\/questions\/194967\/get-all-combinations-of-selecting-k-elements-from-an-n-sized-array","348":"или нет..","349":"всё равно не понял","350":"проверь там короче","351":"это надстройка для IIS","352":"нет","353":"Найди другой)","354":"Я не вижу напрямую такого свойства у TreeView поэтому не знаю как такое реализовать","355":"у вас тоже 5 разных видов джунов 5 мидлов 5 сеньоров итд?","356":"Мб, кто-то из сотрудников постарался?","357":"В студии?","358":"Вместо `Console.ReadLine();` добавь `Task.Delay(1000)`","359":"не, опять же, пока что они не настолько весомы, чтобы подорваться и переписать весь работающий на .net framework легаси на кор","360":"или там где они есть","361":"по итогу кое-как понял, что тут каким-то образом action в контроллере почему-то вызывается два раза","362":"","363":"Зачем сборщик в aot?","364":"jb rider","365":"Ну сто проц в коде ключевые слова есть","366":"Зачем await.","367":"у тебя же метод действительно асинхронный или просто написано async? )","368":"ну ты выносишь Queryable в слой бизнес-логики и вертишь его как хочешь, когда репозиторий должен уже возвращать конкретные ответы на запросы","369":"За пару лет поймете основы","370":"перезаргрузи раза три и билд","371":"Дебаггером приаттачься и изучай.","372":"потом dotnet restore","373":"крч а если я токен прокину и потом отменю через Cancel(), оно мне таску не оборвет на полпути? (помимо моего ручного                 if (cancellationToken.IsCancellationRequested)\n                    return;)","374":"То есть можно полностью с вебмордой на своем серваке развернуть и никак не зависеть от gitlab.com?","375":"Ловите ботовода))","376":"Я вижу, что вы пытаетесь связать Office и CarItem, но почему-то связываете через свойство Car. Может быть, вам нужна связка Office => Car => CarItem?","377":"ответ убил: все три будут использовать чатгпт и не страдать хуйней","378":"просто шанс на нее крайне мал","379":"И нельзя вне метода свойствам значения присваивать\nheader.FontFamily не будет работать вне метода","380":"что дебажить то?) кусок кода , но приходит нулл(","381":"это что такое ? где смотреть ?","382":"Читай контекст","383":"а нельзя их очистить после всех действий в цикле?","384":"чтобы ерундой каждый раз не страдать","385":"И xaml лучше ручками","386":"Сочувствую","387":"Я тогда boost asio буду юзать","388":"Сохраню пожалуй, слишком гениально","389":"Есть данные, хранящиеся в сессии, которые используются внутри","390":"Попробуй ради теста установить позицию руками, в итерациях цикла например, чтоб отследить - поможет ли","391":"Что там хорошего?","392":"Напиши скрипт, который поднимет твою сотону, и запускай его каждый раз.","393":"затмение","394":"Это как?","395":"float надо чтобы дроби были, в инт только целые числа","396":"Если развернуть цикл вручную, то получишь","397":"тогда белую шапочку на голову и иди пентестить!","398":"Почему регексп <url([\\$a-z]+)[^>]\nИз <url$siteurlhref>>profile$pN берет в группу только $siteurlhre","399":"либо не альтернатива, либо не для всех, либо себе в убыток: сервера кому-то надо держать =)","400":"но мне не 2017 надо а просто более ранняя версия 2019","401":"Well, you may exit from any console program in that manner.","402":"синтаксис и семантика одинаковая. Лексеры разные","403":"Версия калькулятора вот эта? Калькулятор 10.1906.53.0","404":"DI для этого и сделан, чтобы ты работал с интерфейсом, кторый ресолвица в нужную реализацию. Тоесть ты регаешь <interface, service> и потом везде используешь interface для того чтобы изолироваца от конкретной реализации","405":"И ждать холостых?","406":"я неправильно ответил","407":"А, нет, обманываю.","408":"Настроить https и решать задачи","409":"очень удобно между прочем","410":"Internal.Cryptography.CryptoThrowHelper+WindowsCryptographicException: The parameter is incorrect.","411":"а как именно - просто в PsExec указываются же креды внешнего сервера, к Mysql указывается user password точные.","412":"Плюс назвать 225 элементов и настроить TabIndex в разы быстрее из кода","413":"https:\/\/docs.microsoft.com\/en-us\/dotnet\/csharp\/language-reference\/keywords\/where-generic-type-constraint","414":"Настрой просто ci\/cd, либо напиши мсбилд таску","415":"просто","416":"И компилятор начнёт противиться только там, где ты начнёшь вызывать методы, которые противоречат такому использованию генерик-типа","417":"Я ответил так что, таск это условно абстракция на thread, только работаем мы с пулом потоков вместо того чтобы создавать thread вручную, что хорошо т.к многие вещи уже выполняются под капотом, но вроде ответ такой себе был","418":"очень много мнений и все очень важные. спасибо за внимание)","419":"кстати может токен неверный?","420":"всем привет.\n\nПомогите решить задачу.\nНужно сделать конвертер величин, решил использовать паттерн стратегия, но началась тупка =D\n\nчто я хотел бы сделать что то вроде такого\n\ninterface IConverter\n {\n     enum ConversionsUnits;\n     decimal Convert(ConversionsUnits from, ConversionsUnits to, decimal indications);\n }\n\nclass EnergyConverter : IConverter\n {\n  public enum ConversionsUnits\n  {\n      Cal,\n      Kcal,\n      Mcal,\n      Gcal,\n      J,\n      KJ\n  }\n\n  public decimal Convert(ConversionsUnits from, ConversionsUnits to, decimal indications)\n     {\n } \n }","421":"и логично передавать данные игры между ними","422":"Привет. Парни подскажите, что делать. Написал код на обновление(он рабочий), ошибка заключается в том, что я хочу редактировать выбранную запись, а у меня выходит ошибка: System.Data.OleDb.OleDbException: \"Невозможно обновить поле 'Код клиента'; не обновляемое поле.\" \"Код клиента\" - это ключевое поле(счетчик), почему я написал его в запросе, что бы по выбранной записи переходить к самому редактированию, но дело в том, что это ключевое поле, я вообще не меняю.","423":"есть ещё хакинтош. Даже знаю, кто на нём делал софт по IPhone, но все хором утверждали, что лучше купить нормальный мак","424":"...зачем.","425":"у тебя там про 300гр написано было на скриншоте выше) это уже какая то краудсорсинговая разработка коммерческого приложения получается)","426":"Всем привет! Пишу приложение с GUI на Avalonia. По нажатию на кнопку нужно исполнить функцию с долгим исполнением (прошивка устройства по USB) и дождаться, какой результат она вернёт. Также в этой функции необходимо выждать паузу и иметь возможность эту функцию отменить с CancellationToken. Если бы не выжидание паузы, то я бы исполнил функцию с TaskFactory.StartNew с параметром `TaskCreationOptions.LongRunning, полагаясь на то, что планировщик скорее всего выполнит в отдельном потоке функцию.`TaskFactory.StartNew( async () => с await Task.Delay() тоже не нравится - вычитал, что отдельный поток завершится при первом await, а остаток исполнится в ThreadPool. Thread.Sleep в TaskFactory.StartNew с параметром `TaskCreationOptions.LongRunning тоже не нравится, потому что железной гарантии выполнения функции в отдельном потоке насколько я знаю, нет. Как думаете сделать лучше?`","427":"готово","428":"Cannot deserialize the current JSON array (e.g. [1,2,3]) into type 'System.Collections.Generic.IDictionary","429":"ну просто у тебя проект запускается на localhost а ты в 192.168.... долбишься","430":"Привет, я делаю миграцию пдф файлов из sql в s3 bucket. В базе они сейчас в байтовом виде. Подскажите, можно ли как-то в таком же виде их сохранять в с3?\nЕсли да, то как?)\nЕсли нет, то как лучше? И если конвертировать, то как?)","431":"ша дотнете, кинете?","432":"`.TextDecorations.Add(TextDecorations.Strikethrough);\n` чтобы убрать, соответственно нужно удалить","433":"SelectedMonitorIndex - в этом поле находится индекс выбранного элемента в Monitors","434":"Как при помощи стандартной функции форматирования собрать строку типа: \n{\"ObjectName\": Value }","435":"Я бы через P\/Invoke всё-таки сделал. Ну, если ты не ищешь других преимуществ от разбиения на процессы.","436":"Да, нужен virtual, т.к. иначе рослин запечатывает реализацию (слово final).","437":"Так не понятно же ничего. Какой массив?","438":"где `;`","439":"Инфы мало, примеры с ошибками и плохими практиками","440":"мало воды","441":"Можно. Я кучу такого реализовывал.\nНет с этим проблем. Твой код в рантайме является машинным кодом, и если туда неуправляемый вызов попадет (системный коллбек по событию) то он корректно выполнится","442":"ctrl + shift + del в браузере","443":"не слышал, чекнул, вроде тоже норм","444":"там суть в чем","445":"Да согласен","446":"Вообще base64 может не только строки кодировать. Но и любые бинарные данные, например, картинки)","447":"Ребят, кстати, насколько актуально коментить методы и тд через \/\/\/ <summary> ?","448":"и тут даже не столько в это проблема сколько в том что тебе придется придумывать миллион костылей чтобы не дать весь доступ к БД твом ремотным юзерам","449":"","450":"Спасибо! Попытаюсь =)","451":"приветствую\nпомогите с проблемой pls\nесть массив object  из 3 элементов типа ( string,Date,long)\nкак из объекта извлечь эти данные?","452":"с другой стороны если там некому здраво оценить твои способности то вариантов то и нет больше)","453":"там spa","454":"Или я не понял вопроса","455":"Так а что даёт тот факт, что он в либе?","456":"Ну если понадобится вывести свойства сущности на какой то момент времени - то этого сделать не получится. Если есть такая задача","457":"А если всегда работать с английским, то жизнь будет легче","458":"И тд","459":"Если мы модель в Partial() передадим, он будет в колбеке доступен?","460":"вроде бы у ms есть уроки по ажуру, но вроде бы они платные","461":"В-третьих, правильно тебе говорят — кастовать к `byte` не нужно","462":"ну или в один большой экзешник. я не уверен как лучше и как можно","463":"Он же говорил на другом компе все работает","464":"проморгал, точн","465":"Молодой, горячий фронтенд на сисярп","466":"ReadKey внутри потока, тогда да","467":"ну так то да)","468":"Доброго времени суток. Можете подсказать кто знает? Можно ли организовать общение между двумя asp.net core MVC приложениями или нужно через web api собирать?","469":"мы тут за авлонию топим","470":"Неужели встроенных диапазонов в регулярках нет?","471":"спасибо","472":"Погуглите паттерн спецификация ef, там есть примеры кода. В целом сложности не вижу пока, просто нужно пачку классов создать и из собирать из ввода","473":"Мне надо по ulong проходится","474":"Оно вообще в любом файле","475":"сходить за профилем юзера в апи с таким токеном","476":"Это совсем извращение)","477":"Да, корректно отрабатывается","478":"Как в рестШарп проверить работает ли сервер или нет","479":"","480":"То как вывести хоть что то поверх игры в полноекранном режиме","481":"лямбда не статична, а надо статический метод","482":"Но это обычно, а я на всякий )","483":"Нашёл, сейчас посмотрим","484":"Создавать Run динамически","485":"[**Ozon Tech ](https:\/\/t.me\/ozon_tech)**[**Intro Meetup: строим складские системы на .Net](https:\/\/ozontech.timepad.ru\/event\/2499125\/)**** **\n \n25 июля в 18:00 |  \nонлайн и офлайн в Астане |  \nполезно C#, Go, QA-инженерам | \n \n**О чём будут доклады:**  \n- IT в товарных операциях и микросервисы для управления конвейерами; \n-  внутренняя разработка WMS и пирамида тестирования; \n-  матмодели для управления маршрутами операторов склада; \n-  модель собственных продаж и очень быстрой доставки; \n- уход от монолита к микросервисной архитектуре \n-  жизнь внутри команды по продукту и технологиям товарных операций. \n \n**Важно:** время указано местное, UTC +6. Приходите пораньше (17:30), чтобы понетворкать на кофебрейке. \n \nЕщё одно важное: [регистрация.](https:\/\/ozontech.timepad.ru\/event\/2499125\/) Дождитесь письма-подтверждения и захватите удостоверение личности с собой на митап.  \nОнлайн слушателям тоже стоит зарегистрироваться — организаторы отправят напоминалку и полезные материалы.","486":"Спасибо за линк на документацию для драйвера?)) Куда ж мир катится))","487":"что значит улучшить? :)","488":"Не, в другом классе нужно будет передать уже не TasteType, поэтому прибегнул к T","489":"и Foreach запускает процессы, а whenAll, ждёт когда список процессов закончит выполнение, и после стартует новый таск, это немного разные штуки","490":"Да вообще все это кастомно как правило","491":"полагаю","492":"Но здесь автора почему-то полные пути внутри неймспейса пишет","493":"ну может было уже какой-нить решение, чем их писать","494":"Да вродь обычное дело при работе с сетью","495":"","496":"Деструктор в шарпе называется финализатор","497":"с точки зрения DI не могу в голове устаканить как её тут применить","498":"Блин. две кнопки","499":"Кстати, скоро coreclr, corefx и какой-то там core setup сольют в один репо\n\nhttps:\/\/github.com\/dotnet\/coreclr\/issues\/27549","500":"конечно всегда можно нафакапить и усложить ему задачу","501":"рантайм не умеет в телепатию и кофейную гущу","502":"Вероятнее всего, да.","503":"через IIS","504":"тоесть в этой точке перехватить. Но не возвращать какие-то там `IObservable` и тд.\nВ моем случае это не имеет смысла просто","505":"Ни разу не оффтоп. Именно клавиатуры в чатах по .NET и обсуждают.","506":"","507":"Без наблюдений","508":"За то сразу видно в будущем что есить говно а что нет, а не видить сразу все хорошее","509":"Жесть! Хотя этим даже Майкрософт грешит","510":"Если это аналайзер то как он запускается? Если на билде, я бы посмотрел на билд лог. При необходимости докинул бы левел логинга в мсбилд","511":"там всё внутри проекта одного","512":"Это пробовал?","513":"i have to do simple login\/register asp.net project","514":"Досадно","515":"Просто в MS протоколы включить в настройках инстанса сервера нужно","516":"Довольно частый сценарий","517":"Single()?","518":"https:\/\/docs.microsoft.com\/en-us\/dotnet\/api\/system.array?view=netframework-4.8\n>The array size is limited to a total of 4 billion elements","519":"Жду предложения лучше(","520":"https:\/\/sharplab.io\/#v2:C4LgTgrgdgNAJiA1AHwAIAYAEqCMA6AYQHsAbEgUwGNgBLIqAZwG4BYAKA2xwBZW32A9AMyBAEEBEIIAwQQFggmQNgggPBBAFCCB8EECoIIBQQdu1QBmLgDZsAJkwBRAB7ByjOo3YBvdpmfY9uQ7h0AeACoA+TAAxEgBDYCsoXz8ACmAACxoGLj0AKxCAc3TyOABJKwBbBgBKJxdHNhdKzAAzIjByEMo4zGiANxCwTBoCrqhMNMzsvPJCkoqq53KJiZpqlu6RrqTPXqhyMGHR0umy7Z2q2vrG5raO1fXN3vONgoY8YLCIqOiisf33rhxsAHZrzb4PpgAL57HbkEgMcigj64L6oX7RHxFBb5AHTEHjZwYoFAA","521":"создай таймер и чекай какие потоки можно закрыть","522":"Я примерно так и сделал. Стараюсь не нагромождать контроллеры. Вся логика в отдельном классе.","523":"как решить проблему7","524":"вставил media element, wpf. В конструкторе все отображается, а в приложении пусто. Пробовал и видео и изображение. Ставил разные свойства LoadedBehavior и свойства на видео, изображениях Resource. Ничего не помогает, что может быть?","525":"можно","526":"О, классическая тема \"вот так с помощью бд и RMQ мы сделали кафку\" =)","527":"В typescript будто нет public static","528":"это не трудно))","529":"короче заменил системный разделитель в  винде 10 и всё Ок. спасибо [Игорь](tg:\/\/user?id=1157692485)  подсказал","530":"https:\/\/devblogs.microsoft.com\/dotnet\/configureawait-faq\/","531":"Не удивлюсь, что после 2018.3 попрут \"баги\" по поводу того, что эта фича тормозит и прочее.","532":"да там настройки были, вот тока где нифига не помню\nпосмотри через свойства грида, там много чего было","533":"нет не нужен, или нет нужен?","534":"в проектах я никогда таким не страдаю, я понял прекрасно о чем вы говорите","535":"Спасибо","536":"поэтому всегда сначала селект, потом заменяем на делит)","537":"И да, DP нужно чтобы привязывать его к чему-то, НО НЕ НАОБОРОТ. ViewModel же не с DP, а к её свойствам привязываются.","538":"Но жалоб, связанных с утечками памяти или нагрузкой на процессор не было","539":"Народ, почему с таким кодом проект просто не компилируется, я нахимичил в методе  ExecuteNonQueryAsync() и теперь вот такое вылетает в студии","540":"общее использование?","541":"очевидно, что есть конфигурация","542":"можешь это в тетрадках попробовать воспроизвести, от руки, шоб усвоить лучше","543":"И поймете, что где пара байт, там и пара гигабайт траффика по памяти","544":"А forall?","545":"Да даже и ошибки не выдает, такое ощущение, что он просто не видит что есть ещё бд","546":"Я хз, а не лучше ли вам под вашу задачу использовать радиобаттон?","547":"но я не знал, что он таким образом работает","548":"конверт туда\nконверт сюда","549":"Сейчас","550":"Пошто ты всё время перечишь?","551":"И вот в случае с точкой реально возвращается Page().","552":"но это если тебе надо сделать параметр не обязательным скорее","553":"на ксамле","554":"Всё ещё не до конца понимаю\nЕсли на примере выше, то сделай метод расширение Clone<T>","555":"задача стрелять по воробьям пока","556":"Ты без синхронизации с вызывающей задачей (джойн любого вида или евейт) не узнаешь что там произошло.","557":"Есть еще чатик про языки и компиляторы, вот там всегда оживленно","558":"кто ни будь знает что это за тема в райдере ? =)","559":"Я в синтаксисе не шарю вообще, мне предпочтительнее ц Шарп и джава","560":"Ну, в смысле, никто не запретит GetAwaiter().GetResult()","561":"JavaScript?","562":"1. Строгая типизация - наше всё\n2. Рантайм","563":"((","564":"Всем привет! Подскажите плиз, как можно достать значение DisplayName?","565":"Та же самая ошибка в браузере выходит","566":"Ты на понял.","567":"не суть, не работает любым образом","568":"Polly","569":"Один фиг на шмот геншин не ломануть","570":"взаимоссылающиеся","571":"Каким образом об этом плагине узнают люди? \nНужна для этого экосистема...или я чего-то не понимаю..","572":"`!` нужен для подавления предупреждений :)","573":"тебе скажут позицию где говно","574":"Сейчас прогуглю","575":"а еще есть экстеншены =D","576":"поэтому нет, не удивлюсь","577":"спасибо","578":"public Rectangle Rectangle => new Rectangle((int)Position.X, (int)Position.Y, Width, Height);","579":"Кто нибудь мб знает?\nВ матлабе есть функция mam2sug перевод из мамдани в сугано , пакет fuzzy, есть ли обратная блядь функция?","580":"😐😠","581":"Что делает Monitor.Enter можно прочитать здесь https:\/\/docs.microsoft.com\/en-us\/dotnet\/api\/system.threading.monitor.enter?redirectedfrom=MSDN&view=netframework-4.7.2#System_Threading_Monitor_Enter_System_Object_","582":"они ж наоборот, на фреймворке обычном не саппортят","583":"А какой в Windows ГСПЧ, и почему его обплёвывают? Если не нравится стандартный, то можно взять Вихрь Мерсенна, хаотическое отображение, линейный конгруэнтный, энтропию посмотреть, статью в журнал написать и всю жизнь юзать свой. Но это только если очень хочется, потому что можно посчитать вероятность коллизии в 122 уникальных битах и понять, что не нужно таким заниматься.\n\n> Assuming a perfect source of entropy on each device generating random GUIDs, there is a 50% chance of collision after 2.7e18 random GUIDs have been generated. That's more than 2.7 million million million. That's a lot.\nhttps:\/\/blog.stephencleary.com\/2010\/11\/few-words-on-guids.html","584":"А-ля: жди, гружу","585":":(","586":"Я на ноесисе лучше, там и рендер сразу не зависимый от системы. Сразу буду знать как выглядит везде","587":"У тебя гугл сломался )","588":"лол, челик косит или является заднеприводным, а проблемы у меня, ясн","589":"а если инта внутри ссылочного типа - вместе с ним в хипе","590":"попробую","591":"Спасибо! Попробую :)","592":"ты просто подумай поиск по индексу против тупого поиска да еще и с десереализацией)","593":"ну вот dotnetfiddle сейчас выдал IndexOutOfRangeException на ^0. тогда анализатор такую конструкцию может просто обозначть как ошибку, таким образом защищая программиста.","594":"там чтобы обратиться к расширению нужно знать его ID\nглубже тему не копал, т.к. не нужно было мне по задачам.","595":"у тебя роли для каждой связи пользователь-чат уникальные что ли7","596":"о смотрите раба раздают","597":"ну обычно биндят на него а дальше сетевой форвардинг силами ОС и докер рантайма идет","598":"Пробовал заменять на синхронную версию методов?","599":"по условию высота этого массива только 2","600":"А передача более ранней формы в более позднюю при помощи конструктора (для использования информации из неё) не считается плохим тоном?","601":"та не","602":"округление до 0.5 как сделатл","603":"@striped  за сутки 2 раз этот мемчик)","604":"используй одновременно штук 30","605":"Согласен.\nЯ и сам не стану на 100% утверждать что это нужно и очень круто. На мой взгляд выглядит так, но надо проверить. Я не раз ошибался в этой жизни. И так же в прочем не раз был прав.\n\nСейчас контексты уже можно сделать на уровне фреймворка без применения новых функций языка. И даже вообщем-то не так сложно сделать в базовом варианте.","606":"я голосовые знаю)","607":"В общем да, нужно именно это. И сделать это без конкретики вроде ```if (classname = \"Laptop\") { и тут код для внесения модели конкретно в Laptop путём прописывания и занесения данных в соответствующие поля }```\nВ идеале за один-два цикла я планировал обработать входные данные и распихать по бд","608":"что за бред","609":"У тебя же внутри place есть floor\nА внутри placedtotrash есть floordtotrash","610":"Чем нотация this_is_the_super_method отличается от ThisIsTheSuperMethod?","611":"А что бы я сделал, если бы мне надо было рефлекшеном порезолвить метод, включая экстеншены?","612":"Еще можно лямбдой, Comparison. Без класса компаратора.","613":"типа с семафорами проблем не будет?","614":"а кто то и в целом студию","615":"да можно, но зачем? )","616":"","617":"Да. Ниче не произошло","618":"не. Там именно обёртка над плюсовой есть, а есть чисто шарповая - я это имею в виду","619":"А чего ты хочешь добиться? Какая конечная цель?","620":"Метанит для изучения норм, там примеры есть","621":"","622":"я, канешн, ноду не знаю, но уверен, что на сервере никакого дома нет","623":"нет","624":"у меня класс Book имеет поле Author, отдельного класса для Авторов нет","625":"ну вообще да, Guid норм тема","626":"Бля","627":"прочитай контент в MemoryStream","628":"или только ручками через много циклов?","629":"Сори май инглишь из нот гут","630":"а подскажи, пожалуйста, как лучше всего выйти из этой ситуации, метода то ToIEnumerableAsync нет. Или лист возвращать?","631":"как правильно сделать расскажет преподаватель","632":"object ctor(params object[] parameters)","633":"Ну не(((","634":"так получается Таблица тестов ,таблица вопросов ,таблица ответов ,\nА в таблице ответов для фронта что бы понять которыйответ правильный,может держать столько же полей сколько и ответы   имеются и там тип тру фолсом разделить ?\nНУ например вопрос номер 2 , а там ответы правильные первы второй и третий,,,я имею поля напирмер сназваниями answer1,answer2,answer3answer4,answer5, и ссответственно  ,isAnswer1,isAnswer2 isAnswer3 isAnswer4,isAnwser5","635":"Как минимум материал очень поверхностный и не дает вообще никакого понимания, как \"это\" работает и почему так, а не иначе","636":"UseDefaultFiles() тоже?","637":"да, god object","638":"Rider и под линуксом выглядит 1в1 что на винде","639":"Да, это функция включена. Но удобней ctrl+d. Как поменять горячие клавиши. Не могу найти в настройках","640":"😔","641":"вообще правильная ли идея так запустить ?","642":"Попробуй руками десериализовать тело ещё","643":"Спасибо не знал !почитаю","644":"да можно, размечаешь всё атрибутами, а потом пост-обработкой сборой засовываешь то что тебе надо","645":"Ну я больше охуел с вот этого","646":"при чем тут компилятор казалось бы","647":"Это оптимизует?","648":"Компилятора и фреймворка в тч","649":"А что продают?","650":"мож интересное будет))","651":"Всем привет!","652":"Всем привет. Скажите, как исправить ошибку при создании миграций? Наверное, дело в кодировке, я уже, вроде, зашёл в каждый файл проекта через блокнот и пересохранил в utf-8, не помогло","653":"И кстати ни разу в жизни не видел кода с Update'ами","654":"короче у меня есть проекты где Шарп и нода вместе - там csproj генится вебпаком и в партиалах садо-маза творится ) так что не всё прям так просто","655":"а стоп, т.е проблема в том что не видит драйвера? так это ж access надо поставить на комп чтоб работало","656":"Бля","657":"че там","658":"Классы в C# передаются и хранятся по ссылке","659":"Внезапно\nТы написал, что функция возвращает int[], как компилятору догадаться, что вернуть?","660":"в чём претензия?","661":"switch constExpr {\n}\n\nvs\n\nexpr switch {\n}","662":"Обосрал дотнет человек с ником дотнет","663":"около 7к и уперлось в проц мой так как и генератор и слушатель на одной тачке","664":"(да, это разные вещи)","665":"Такого какого?","666":"NDA, возможно","667":"а то ты так далеко не уйдешь","668":"Этож нужно для приватных ридонли полей","669":"автоинкримент в базе?","670":"Сразу отвечу на следующий вопрос: используй Авалонию, конечно же :)","671":"Свой OpenID провайдер","672":"http:\/\/hg.icculus.org\/icculus\/lugaru\/file\/97b303e79826\/Source\/GameTick.cpp#l7276","673":"Ну вон, да","674":"namespace Foo.Bar.Shit\n{\nusing Lol; \n\/* ... *\/\n}\n\nnamespace Foo.Lol\n{\n\/* ... *\/\n}","675":"Опять же поиск сквозной можно делать - как по чяту так и среди личных","676":"Гуглили. Не срабатывает стандартная команда ексит","677":"Да. Не возвращать ДБшные сущности","678":"Что не умеют? Вызвать нормально метод? Почитать доку? Там везде написано, как надо делать и как не надо.\n\nДля криворуких челиков, которые боятся sql. Ну или для тех, кто хочет подключить 100500 провайдеров, и работать со всеми одинакого (хотя я это не совсем представляю, когда у разных баз данных разная функциональность)","679":"Продублируй плз, сроки чего оцениваешь ?)","680":"https:\/\/learn.microsoft.com\/en-us\/dotnet\/standard\/serialization\/system-text-json\/migrate-from-newtonsoft?pivots=dotnet-7-0#jsondocument-and-jsonelement-compared-to-jtoken-like-jobject-jarray","681":"номер 0 это просто его порядковый номер","682":"да, давайте фронт на SQL писать!","683":"Через where","684":"Вы ширнулись?","685":"Понято, спасиб","686":"Из-за блокировки тг, наверное.","687":"Просто скачиваешь тыком нужный дистрибутив и подключается по порту localhost:5951 по ssh, vnc или xsdl","688":"Я уже понял)\nЕсли честно, до абстрактных фабрик ещё не дорос, но интересно то, что вы имеете в виду\nЕсли не сложно, расскажите подробнее","689":"Если не в message.Text, то понятно почему","690":"На самом деле, вот точка входа: http:\/\/paiden.github.io\/Nett\/api\/Nett.Toml.html","691":"купить 600гр ноут и радоваться жизни","692":"а мне не это нужно, мне нужно чтобы окно которое было открыто вижуалкой не закрывалось","693":"Ошибка CS1061 «IEnumerable» не содержит определения «Select»","694":"в условии цикла вроде не так","695":"https:\/\/prnt.sc\/qxkdef","696":"посмотри какие ограничения у GetCollection","697":"В WPF были массажбоксы?","698":"`JsonConvert.DeserializeObject<TResponseModel>(responseString, converters);`, где converters - это `JsonConverter[]`","699":"пасиб, поищу в нём эту фичу","700":"А про пайтон тут чат есть вообще на 50к людей","701":"мб тут ответят","702":"Естественно если ты при этом сам не распиздяй","703":"А он и имел в виду F# :)","704":"как будто новости из зазеркалья читаешь","705":"Ага","706":"нужно было сделать структура для расписания. Абстрактный класс содержит общее для преподователей и для студентов, а дальше идёт разделение. Структура различается 1 переменной","707":"Я говорю идёшь на собес на джуна, а тебя алгоритмами давят","708":"Но это оказался развод","709":"Или  в sqlite","710":"так он разницу хочет показать лол","711":"Галочка \"действия\", скорее всего, то что нужно","712":"В следующей версии NET методы будут депрекейтед, он заранее подготовился к миграции просто","713":"Один матершинник сегодня уже тут был сегодня приговорён к расстрелу, если что!","714":"Дело не в мегабайтах на машине, а в скороти загрузки с сайта, интернеты все еще далеко не у всех 100 мбит","715":"Периодически и сюда врывы случаются.","716":"Кайф же","717":"там невозможно обнулить","718":"Лол лист и так потокобезопасен","719":"но всё-таки","720":"Кстати, а какие ограничения на ту же матрицу расстояний? Сделал 102 на 102 - получил TooBig.","721":"контекст в запросе с какой либы","722":"В системе не установлен gnu c++ compiler library","723":"О, это же пример почему нужно иметь нормальный байт-код. Кстати, какие преимущества у нее над шарпом?","724":"обращался и так. уже 100500 вариаций сделал..","725":"`File.Create(\"path\")` и поехал","726":"противоречит концепции =) \nнапример, в бизнесовой модели мне нафиг не нужны Id","727":"хмм","728":"Это всё пишется для некоторой либы. Мне кажется, что вынуждать пользователей использовать StructLayout - это заставлять его рыться в кишках либы","729":"Тот же тред, не нужно диспетчерить вызов эвейта, асинхронное выполнение. Каеф, одним словом","730":"кроч забейте,  я хуйню придумал, хуйню спросил (удалил свои тупые сообщения)","731":"ахахаха","732":"А зачем тебе антифоргери-токен? Ты его передаешь в том месте, откуда отправляешь форму?","733":"В формате PEM в base64","734":"И чем это делаешь","735":"нет","736":"И в Delphi ♥️","737":"а зачем","738":"а опоздал","739":"Так и считается","740":"Нет","741":"вообще не связал!","742":"","743":"Да, неплохо.","744":"Ну паттерн же тот, не?","745":"Ребят, такой вопрос, как провести сериализацию словаря, если там есть свой класс?","746":"Вы как то понятия выдумываете) потому что такого понятия в С++ нет","747":"что тогда я не так сделал","748":"Чтобы получить и его?","749":"очень странное приложение","750":"можно разумеется - смотрите фильтры в неткор как работают","751":"🤔","752":"И опять не вижу связи с логами в базе","753":"Нет","754":"Душные*","755":"Продать себя по-дороже и по-быстрее нагуглить решение, да.","756":"Угу, только 99% проектов до этого уровня никогда не доберутся )","757":"Получить что","758":"Ember.js... интересная вещица","759":"А зачем?","760":"вполне возможно? Тут прям нечего сказать. Это может быть какая-то константа вообще, которой и в памяти-то нет\nНу и что ты подразумеваешь под местом в памяти? адрес? величина поинтера в инте?","761":"да","762":"с экспрессом так же будет работать, но можешь поставить локалдб да","763":"Просто удалить папку моделей и контекст?","764":"да, по тому что тут \/\/do something,\nнужно что то делать","765":"ну так выше была просьба посоветовать что-то из-за ошибки","766":"ДА НОРМАЛЬНО","767":"Но можно","768":"🙏","769":"а у меня нельзя","770":"на русском скинул","771":"хорошая безопасность","772":"нужно выделить эти данные в отдельную сущность, которая как раз и будет заниматься получение, обновлением и оповещением об изменении. И заинжектить ещё в нужные тебе vm.","773":"он оказывается аж 2020 года","774":"Уже генерирую","775":"Любая альтернатива в сравнении с wcf - православная","776":"прикольно","777":"Ребят, какой аналог using System.Net.Http; есть в фреймворке 4.0? Решил с 4.6.1 перейти на 4.0","778":"а что за дети панели? это что то про шлюх?","779":"Написал прогу по загрузке картинки, но нариованная картинка резко перестала рисоваться и загружаться. Хотя все правильно вроде (ошибок нет). Писал через Ajax запросы на стороне клиента.","780":"да","781":"а то меня нахер шлет)","782":"Это как?","783":"Можно ли чем-то воспользоваться, чтобы по формату А4, А3 и тд получать размер в мм, дюймах и тд?\nНу или по формату и dpi, получать размер в пикселях","784":"Как-то можно сделать так чтобы прога никогда не прерывала исполнение при получении ошибки?","785":"так зачем спрашивать тогда эти вопросы","786":"Иначе никак, если нк указать где","787":"??","788":"рекомендация гугля","789":"блядь","790":"+нужно понимание DI и контейнеров","791":"Лол, я подумал, это ты так даппер назвал","792":"сразу грузит\\","793":"Я все равно советую айдентити. Да, там много того, что тебе не нужно, но оно не мешает и пользоваться этим всем не обязательно. Зато гибко, все из коробки работает и куча примеров - явно не пропадешь","794":"ааа","795":"возможно у меня нихрена не работает, тк это пост метод","796":"Вот теперь полная цепочка","797":"Ну ты жёсткий чел однако. Раз решил что такое EF скушает :D","798":"даже название библиотеки не дал","799":"Rider","800":"блин, поменял - ошибка ушла... Спасибо!!! Я бы и EventHandler не использовал, но пока не понял как (он есть в куче примеров, а на VB мне половину и не надо было указывать)","801":"напиши тест в 2 строки и убедись сам","802":"У тебя подчёркнуто","803":"И зачем он нужен?","804":"Я вот лично так и не понял что ты хочешь сделать.","805":"и SDK по идее надо поменять","806":"понял\nзаписал","807":"https:\/\/api.whatsapp.com\/send\/?phone=\"NUMBER\"&text=Hello+World&app_absent=0","808":"придет","809":"А как по другому выгружать то что уже не нужно?\nВот надо тебе запустить строннюю библиотеку и в случае если в ней исполнение где-то надолго повиснет - завершить исполнение и выгрузить её из памяти","810":"в будущем и избавиться от них потом проще будет","811":"","812":"Каждая прослойка это оверхэдик сверху","813":"https:\/\/lmgtfy.com\/?q=cmd+change+username+windows+10","814":"Пробовал?","815":"как ты сделал","816":"есть бенчи? мне не верится","817":"Из какого? У нас есть стандартный шаблон для WPF? Я что-то явно пропустил.","818":"хотя если не хотите во фронт","819":"","820":"а они не знали, чо меня на защите спрашивать","821":"для начала прочитать что такое git","822":"Ну это","823":"Просто интересуюсь возможно ли","824":"Хитро","825":"по всякому. правда через судо ворнинги сыпит, но в интернетах пишут что это пофиг","826":"А какое максимальное кол-во юзеров в видеозвонках будет?","827":"ReactiveUI+DynamicData называются","828":"Осталось дело за малым: нагугли, как оттуда дефолтовый референс исключить.","829":"^","830":"Можно, но типа нельзя 😬, это мы на практике в колледже делаем","831":"ага, нашел статью на метаните, буду читать. спасибо за помощь)","832":"если что сеттеры так и работают)","833":"Ну и кстати еще не нашел, завершаю иттерацию собесов","834":"Это мне так везет или тренд такой?","835":"имхо, лучше не надо бросать в конструктор EnsureCreated","836":"Если привяжешься к тикрейту - получишь баг как в старых дос играх","837":"Обычно максимальная гибкость и оптимизация- это разные истории","838":"а студия разве это не умеет?","839":"и ты там сможешь закрыть форму","840":"я нет, а ты?","841":"Они по очереди все исполняются","842":"Проблема вот в чём:\n`lock = LockInput.Player;`\nпотом проверяя \n`Lock.HasFlag(LockInput.Player)`\nон пишет false","843":"а как?","844":"или если на цепочке ивентов что-то взорвалось","845":"Так а в чем тут баг то","846":"я же говорю, это для случая если ключ известен и надо только матчить тип","847":"че","848":"httpclient и vpn , есть ли жизнь?","849":"Берешь и идешь на них и получаешь работу","850":"+","851":"А насчёт гитхаба, у них должно быть обучение по работе с визуальным гитом, если нет то на битбакете с текстовым точно есть","852":"Я правильно понимаю, что единственный способ реализовать похожее - создать интерфейс с методом, например, Add?","853":"Так что в этом отношении наш String не отличается от С++ wstring","854":"Может сделать типа конвертора в классе (implict opertor)?","855":"Типа у шарпистов более распространен подход когда используют гет\/сет","856":"метанит?","857":"это что за процы то?","858":"честно, нз. а что за пометки?","859":"Это даст ответ стоит ли использовать или нет","860":"хмм","861":"Пришёл, и с линем не работаю.\nХотя тут не для статистики утверждение","862":"А можно делать проверки с типом int не переводя в string?","863":"В mssql есть st_distance","864":"Никак, если ты его как ресурс кладешь, он не редактируемый","865":"Можно получать список конвертеров из DI, а при необходимости у каждого конвертера спрашивать список поддерживаемых форматов.","866":"Мид+","867":"Действительно. Я же не хочу никогда использовать там net standard по человечески, правда?\nhttps:\/\/github.com\/dotnet\/sdk\/issues\/901","868":"?","869":"Можно на тактильные ощущения опираться","870":"Стектрейс?","871":"Прогай, ебаш и все выйдет","872":"@valera413 надо очень много именно писать, решать задачи, не просто воспроизводить примеры, а самой себе давать задачи и стремится их решать. Теория очень быстро забывается","873":"спс","874":"он","875":"Про утекшие соединения - были проблемы в 5.7, на нестабильных клиентских каналах","876":"Угу","877":"И меньше проблем, нервов и времени убьешь","878":"Это вообще писать не надо","879":"","880":"так а чо. ты можешь под существующую бд с данными нарисовать руками контекст и пользоваться","881":"У Вас в процессе оптимизации вычисление Count будет проведено 1 раз. И не вылетит от Remove? Ну-ну","882":"await нужен на таску","883":"Причём, скорее всего, оно даже в EF подхватится, и будет бодро тебе генерировать гуиды прямо в СУБД.","884":"ну как, сначало я принимаю джсон, потом хочу по объектам раскидать и эти обекты в еф и в бд","885":"и под линукс и под мак","886":"ваще необязательно","887":"","888":"take reverse спасибо) дошло","889":"Как? Декомпелировать приложение?","890":"вот и вопрос, как это сделать","891":"Да юзайте что хотите, просто мне показалось что для человека, который спрашивает можно ли классы с маленькой писать, этот будет понятным и достаточным для ознакомления","892":"Мне нужно по названию игры найти сам матч и сделать ставку, после инфа о матче должна будет записаться в эксельку, через неделю я посмотрю как оно) Если пропарсить и занести в ексель труда не составит, то вот именно сделать саму ставку - сложно","893":"Тогда вообще ничего не запустится","894":"А вот наоборот - уже есть проверки кое какие (но они несущественные должны быть)","895":"А как сделать, по банальному, вообще не шарю((","896":"Тут банят за этот сайт) Чекни правила)","897":"не","898":"А что за список объектов? Контроллеры делаете?","899":"Изначально я хотел занести это в этот параметр        \n``` public TimeSpan Duration { get; set; }\n```Но не понял как с месяцем сделать","900":"ForMember(e =>e.Field1, f => f.Condition...)","901":"А что это за файлы такие, в чём их смысл?","902":"Ну да, конечно. Нужно парсить куда нужно.\n\nБольше тебе скажу, нужно делать то, что нужно. А то, что не нужно, делать не нужно! 👆","903":"В CoreCompat где лежит?","904":"может для его кейса вообще не нужны касты","905":"500$ в час и я твоя","906":"😂","907":"в таблице недостаточно полей или слишком много?","908":"https:\/\/docs.microsoft.com\/en-us\/windows\/win32\/shell\/start-menu-reg?redirectedfrom=MSDN","909":"А запрос как выглядит?","910":"Столкнулся с подобной проблемой:\nhttps:\/\/gist.github.com\/aaronhoffman\/e33715dc4e28a025299762aedcaeec3f\/b9f59091a6e2dbbb6b22da8945da679e89ae172a\n\nКод не мой, нагуглился, когда пытался найти решение. Суть в том, что не пойму, как инжектить зависимости в AuthenticationHandler. Везде вроде инжектят в миддлваре, но у меня не работает, выдаёт ошибку, типа нет конструктора с двумя аргументами (он по дефолту сам передаёт как раз два параметра).\n\nВот ещё пример нашёл, тоже в миддлваре инжектят:\nhttps:\/\/zogface.wordpress.com\/2016\/09\/13\/custom-authentication-in-asp-net-mvc-core\/comment-page-1\/\n\nМб это только в коре работает, а у меня Owin?","911":"Да норм любой - насколько знаю от знакомых ) Никто в гугле тебя про язык не спрашивает (но смотрят на каком пишешт и не наделал ли ошибок))) Типа язык можно за пару недель подтянуть при наличии опыта, алгоритмов и структур","912":"Это странный препод\/наставник. Не надо учить мёртвое, там сам гугл уже даже столько средств вбухал, чтобы перетянуть людей с AngularJs на нормальный ангуляр, там даже интероп ещё остался, если не ошибаюсь","913":"куда в аспнет коре копать, чтобы такие сделать","914":"прокси.","915":"F# есть в вижуал студии?","916":"ну по физике там в вузе были неочень преподы, но я застал преподов 10 лет назад, по математике учился у легенды вуза Весятка, он шикарный, но сейчас его скорее всего нет","917":"сейчас точно есть, но тем хуже джуну","918":"Вообще там естт прочто жирные движки автодополнения подсказок и тд","919":"+","920":"Чтобы чужой скрипт продавать под видом своим,чтобы пройти модерацию на форуме,хочу сделать GUI который будет взаимодействовать со скриптом.","921":"Кто их тогда покупать будет?","922":"полностью знать с++","923":"у меня там массив был, я не ту случайно взял","924":"тригерит )","925":"Наверное, можно подтянуть, но обычно там `App(Web).config`, и config-трансформации во время билда.","926":"Я уже сказал ему))","927":"А, блять","928":"Приходим к тому, что еще один проект нужно делать","929":"Частенько этого хватает","930":"Джиту сложнее оптимизировать https:\/\/t.me\/DotNetRuChat\/841089","931":"Я понимаю, чем refasm отличается от нормальной сборки, но пакет у тебя хитрый, и первое подозрение падает именно на это.","932":"это как спор об ЕntityFramework, думаешь все классно а как правило это велосипед и проще использовать классический Ado.Net","933":"Хорошо, сделаю так","934":"Это я тебе пример офф апи битрикс привёл, там точно php :D","935":"и нужно же всем разослать","936":"Вот Рома может тебе пояснить наверное","937":"первичный ключ задай","938":"Когда делаешь set","939":"+","940":"мне выносит ошибку","941":"Дальше через какие-нибудь таблицы мэтчинга сделаем.","942":"Да. Но вам придется очень постараться","943":"Всем добрый вечер! Можно ли использовать TcpClient через socks5 proxy","944":"@Okeanij Оказывается, да, GeekBrains и GeekUniversity это одно и тоже. Мне просто попался последний.","945":"Ну вижу я","946":"Я бы тут не согласился","947":"👍","948":"Это крайний случай, ведь раскрыто может быть несколько записей. А при такой реализации только одна может быть отображена.","949":"оркестрировать","950":"Вон видишь там даже кнопка есть про журнал","951":"@Prunkles","952":"я ща решил совместить приятное с полезным. Майнкрафт сервер поднимаю.","953":"Ага сделай констрейнт )","954":"`int i = 0; foreach(var item1 in index1.Value)\n                    { index2.Value[i]; i++ }`  Сделал вот такой костильваген, что-то типа итератора. Длинна элементов-то одинаковая.","955":"не очень объясняли\nлибо я не понял)","956":"Не знаю, с чего вы это взяли. 2 или 3 года назад переехали с mssql на postgresql. Как раз за счёт ef переезд получился не самым болезненным","957":"там не либу над, а просто численные методы открыть и реализовать.","958":"По линии же видно, что подвис","959":"А попробуй в постмане там где работает, в Accept-Encoding убрать бротли, и оставить только gzip и deflate","960":"так я для этого и написал )\nЧем интерфейс отличается от класса со всеми методами абстрактными? )","961":"Ок, уже понял)","962":"Кто-нибудь знает код этого варнинга?","963":"А в чём проявляется то, что он \"забит\"? Какое количество запросов приходит?","964":"всмысле? по твоим словам условие проверяется до цикла, как только цикл начался, и условие изменилось, то выйти он оттуда не может. начало цикла => изменение переменной => проход цикла и его завершение","965":"а как должно быть? агрегат типа?","966":"ага, на форуме это чудесного сервера видеомониторинга нашел, что можно писать строку как есть, только сначала надо заменить некоторые символы","967":"но мнение имеет","968":"Помогите, пожалуйста.","969":"Лучше видеть весь класс, но скорей всего, контекст диспозится, после того как поток, сделанный таймером, завершается. И ты обращаешься к задиспозеному контексту.","970":"можете подсказать почему sqldatareader возвращает вместо значения null или пустой string","971":"слабый человек))","972":"Здравствуйте. Подскажите, пжл, что значят квадратные скобки и \"uint\" : [FieldOffset()] public uint Time","973":"а не строчное","974":"ну в лс то можно","975":"у кафки, на сколько я знаю, прикольные стримы есть. Можно на тамошнем секуеле запросы к очередям писать","976":"Привет. С коллегой не можем решить, чем может быть вызвана ошибка: \n\"Я не пойму, какого чёрта код вылетает только на этой строчке!? \n \nоно нормально маппит А в В, В в А, List<A> в List<B>, но падает на маппинге List<B> в List<A>\"","977":"Когда это было то, пофиксили уже многое","978":"У тебя есть оффер? 150 тыс это ориентир. Можем планку вниз и вверх обсудить оплату труда в месяц","979":"Это неправильно.","980":"На «легаси» бывают примеры","981":"зачем если есть райдер","982":"Ну э","983":"то наверное намного проще","984":"А нельзя это на баке реализовать?","985":"Может есть какой то стайлкоп и выбрано нечто такое ?","986":"Тогда бы юзали не его а мозильную штуку, но юзают то его","987":"кто ни будь знает что эта за ошибка?","988":"мне теперь всю программу переписывать","989":"на ef core","990":"Если использовать только hasone то создаётся отношение один к одному. Добавь hasmany для один ко многим","991":"Т.е. этого не должно быть, да и должно фикситься полным написанием","992":"Попробуй гуглить, это помогает","993":"Вас наглым образом обманули, впереди самое интересное","994":"можете подсказать почему ошибку даёт?","995":"Хм, а можно метод с делегатом как то переделать, чтобы он работал нормально как и второй? Я не совсем видимо делегаты понимаю, что конкретно просиходит когда мывызываем delegate(BalanceResult r)","996":"Можно, у распбери вроде даже нугет есть pihole","997":"список действий это не уровень базы)","998":"Linq2db ток","999":"Ну да"}}