{"text":{"0":"https:\/\/www.litres.ru\/dzhon-vlissides\/priemy-obektno-orientirovannogo-proektirovaniya-patterny-proektirovaniya-16419747\/","1":"Все удобно","2":"Всмисле не роляет","3":"Из любимого есть редактор nano. Пришлось ему оторвать почти все сигналы и попытки поиска termcap :) Очень удобная вещь в cmd 😆","4":"то есть предположительно и мк тоже","5":"удивлён что крупная инвестиционная компания выложит код на D и еще с mit лицензией","6":"Ничего не вижу уже","7":"просто, кажись это не работает :(","8":"Это да","9":"Поля,кольца тоже","10":"Другого что долго собирается на Ди я даже и не знаю","11":"что-то про битность не написано ничего)","12":"=)","13":"И делают веб)","14":"А возраст у них какой? Щас молодеж плюсы вообще учит?","15":"каждое из приложений похудело от 300 до 700 кб, но фобос 5.8мб, рантайм 1.5мб","16":"While the #dlang forums are down (hopefully to be resolved in a few more hours), remember that's only a web interface to an NNTP server. You can access them with a news reader or via mailing list: digitalmars.com\/NewsGroup.html.","17":"помимо vibe.d есть arsd.cgi у Adam Ruppe: http:\/\/arsd-official.dpldocs.info\/arsd.cgi.html","18":"в чате радиотов можно спросить - они что-то подобное недавно юзать начали","19":"Опенсорс опенсорсу рознь.","20":"Ну и моди в майне на реверсе вроде основани","21":"Ну да","22":"Лул","23":"Для статьи на хабре","24":"пока не особо. По ощущениям на 20% быстрее, но я ещё не сравнивал","25":"Мотив написания языка какой?","26":"`req.session.set( \"isAdmin\", true );`","27":"но вообще - std::expected","28":"Блин а почкму нельзя просто в миксин темплейте код написать\nА токо декоарейшни","29":"ну логично","30":"при использовании ClearFlags в самом последнем классе(в любой ситуации, когда их дофига), лежит примерно такое рандомное значение 14444444458345(в пределах этого числа)","31":"Кстати, как там вопрос с сортировкой решился? Кто-то пару дней что-то отсортировать хотел. Массив интов вроде?","32":"Я проорал","33":"Он разочаровался и ушел за несколько недель до","34":"module testapp;\n\nimport std.stdio;\n\nversion (Windows) pragma(lib, \"lib.lib\");\nexport extern(D) int my_summ(int a, int b);\n\nvoid main(){\n writeln(\"Hello World\");\n writeln(my_summ(3, 2));\n}","35":"ЧЗХ?","36":"Я вообще был в шоке когда осознал что у вас хоть как-то собирается под андроид впринципе","37":"А вы знали что в dub есть ключик --build=release-debug ?","38":"Тут прям подмывает оставить едкий комментарий в сторону golang - там везде ошибка это часть нормальной работы программы походу :D","39":"По отношению к другим странам","40":"Чела этого в Ди хорошо бы заманить конечно. но он не пойдёт я думаю(","41":"написал длинно пост где рассматриваю языки для gtk хех https:\/\/twitter.com\/gavr123456789\/status\/1443337327506567170","42":"есть алиас","43":"As for bitfields.html, it won't go into Phobos2.\n\nhttps:\/\/github.com\/dlang\/dmd\/pull\/13568","44":"Что не так с божественным Кодом Дурова?)","45":"да","46":"ООП тут не ваще прям, а в контексте Д","47":"Я там не работал и не видел","48":"наверно буду ковырять потихоньку","49":"Это старый прекол","50":"у зига получается в сравнении с betterC синтаксис более эзотерический и менее удобный для перехода с сей. Но поскольку betterC никто особо не занимается, то вангую, что победит зиг.","51":"внедрение зависимостей же","52":"Ну какой замысел?","53":"Это после того как прочитал что было в programming language design или до?","54":"```test:\n  echo $(TEXT)```\nто есть вот тут еще надо дописать таргет который выведет 3 разных текста","55":"ну да, у нас же тут D 😘","56":"Тут произошло отделение от общей k","57":"Число - это тоже объект. Хотя и более лёгкий","58":".","59":"что примерно надо написать?","60":"Зачем?","61":"Это не метод. Это простая ф-я.","62":"Это частный сектор максимально узкого софта который работает прям на границе с внешними вра`х`ами.\nЕго хорошо если 3% тырпрайза.","63":"Вот по этой причине мы и хотели сделать форк LDC, потому что те кто там сейчас есть вообще не шевелятся что-то менять","64":"Toyota для мультимедийных голов использует Flutter — и на этом рынке убивают куте","65":"Без доп плагинов","66":"> принимают решения что нужно, а что нет. пишет большие доки по тому, какие должны быть либы. а потом уже коммунити или конторы пишут либы.\n\nверный способ написать тучу говнокода","67":"Жесть","68":"хм значит в 2011, окей вродь логично ни у кого нет потребности","69":"Есть раздел где проводится сравнение с языками","70":"Согласен) там в комментах заруба норм продолжилась)","71":"на каждую девелоперскую машину? а что такого?","72":"Так переиспользуй без гц","73":"Кстати, я тут ридонли несколько лет уже почитываю иногда и помню как товарищ Чеботаев задавал тут кучу крайне глупых вопросов. И прогресс за это время весьма неиллюзорный. Я за это время куда меньше вырос :)","74":"да, так-то в симуляторе пересекается всё - физика, математика, география и т.п. предметные области со своими дикими формулами, нюансами и т.п. дичью.","75":"https:\/\/gitlab.gnome.org\/albfan\/flappy-gnome-tutorial\/tree\/master","76":"но вообще лучше явно преобразовать","77":"странно тогда что васи","78":"Ну так ты отрицаешь очевидную вещь. Если бы тебе раст был безразличен, ты бы и не писал ничего.","79":"мув вообще офигеная тема","80":"А что думает Уолтер и ко об этом? Мб они предлагают какую то внятную альтернативу?","81":"это если например данные пришли не в том формате","82":"её в отдельный файл класть надо чтобы заинклудить?","83":"вот так и не появись пару часов в чате...","84":"нет инета на конечных местах потребления","85":"конечно","86":"Либо в какой-то другой момент закрой, после того как conn точно больше не нужен. Тут тебе виднее.","87":"д - изврат","88":"У треугольника есть 3 стороны и 3 угла","89":"Какие ещё варианты?","90":"да","91":"а блин","92":"или просто писать редактор отдельно от игры","93":"щас минуту перекомпилю его","94":"потому что взаимная блокировка становится достижима","95":"и этот свич какой то огромный стал","96":"Для всяких смартфонов я пока не знаю на чём там в Ди писать интерфейс","97":"еще раз - прочитайте про ренджи, масса вопросов отпадут сами собой","98":"runTask()","99":"Да я имел в виду релиз","100":"Он не очевиден, как по мне) Видишь логические выражения, но их результат нигде не используется","101":"поэтому в HTTP существуют именно такие \"глаголы\"","102":"json это ни markup, ни extendable","103":"опасненько","104":"Наверно. Но блин JSON это же хипстерский стандарт уже лет 10 как, а там такое","105":"","106":"у них ксамарин который они себе забрали на гтк","107":"А это самая вкусная часть как раз, да.","108":"не, посоны, не будет)","109":"Но я могу объяснить. На постгресе я просто рисовал таблички, устанавливал связи между ними, писал запросы, и оно работало, но в mysql это так не работает","110":"У питона очень много делается скрыто, под капотом","111":"а используя его слова","112":"Я не подойду. Я не синьор D. Я лорд D!","113":"скорее правки \"фич\"","114":"Вообще это очень интересно получается, но я к сожалению не сильно разбираюсь в теме С++, так что на этом откланяюсь.","115":"да, кстати, ассоциативные массивы, получается только через static this() инициализировать можно?","116":"Зато кроссплатформенее","117":"в далекие времена gtk 2","118":"В продакшене можно и в compile-time парсить. Максимально возможная скорость получается","119":"No active polls in this group. Use \/newpoll to create a poll first.","120":"Если immutable, можно смело шарить. А с мутабельным уже надо думать о синхронизации.","121":"Может тебе РвМьютекс нужен","122":"а зачем тебе нужно именно прям по стандарту? Есть в твоём компиляторе - и вперёд","123":"То и то","124":"Но по файлам уже сейчас мог бы компилятор в отдельных потоках их компилировать на CPU, не знаю, он так делает или нет","125":"Не пользуюсь. Мне нужна инплейс подсветка ошибок.","126":"ну тут зависит от того, насколько гибко там можно настроить условия","127":"Это малая часть от Ди","128":"И что по его скорости","129":"Из иссуи выше\n\"Using Regex is not a substitute for human eyes and I would not trust it. Any developer who instantly thinks using Regex as a solution to a problem, now has suddenly got two problems (1 the original problem, 2 How do i safely write a regex to solve problem 1). In my experience you will spend more time developing a solution to solve problem 2, then you would have just rolled up your sleeves and fixed problem 1.\"","130":"что конкретно не так?","131":"В своих","132":"Так же есть видосики, как дымились нефтяные вышки Саудовской Аравии, которые защищались Патриотами. И что теперь ?","133":"а существуют ли тулзы для бенчарков event loop, асинхронности и вот этого всего? что-бы можно было пустить 10000 клиентов на эхо сервер, на веб и т.д. ?","134":"ну и кстати, не проще ли всё это дело через extern(C) сделать?","135":"неужели ты предлагаешь неоригинальную озвучку?","136":"*вроде*","137":"у них как великий кормчий скажет, то так и должно быть. Если у них сверху что-то идёт, то это очень сложно поменять","138":"То есть не создать","139":"Если это класс или структура надо будет работать как-то так:\n`auto line = file.readline();`\nЕсли дескриптор:\n`auto line = File.readline(file);`","140":"чтобы там ошибку посмотреть — может что напишет","141":"D is very C++ language which looks like C#","142":"Ору","143":"как же тогда массив структур работает?","144":"Вряд ли это кого-то устраивает","145":"Не обязательно. Как минимум для rust.","146":"Жывой язык с жывым пивом","147":"Долго вникать если толькл начал писать","148":"тут походу смешаны 2 разговора - одним D медленный и они пишут быстрый код на С, а другим руби медленный и они пишут быстрый код на D )","149":"следовательно чисто ct должно быть","150":"Не нужно","151":"Ты не путай\ncore - это core\nА std - std)","152":"))))","153":"Гм. Ну ладно","154":"Да","155":"это следует из моего примера с английским и физикой","156":"Можно было ассерт сделать встроенный","157":"Ну мне надо чтобы всплывашка с отформатированным значением выскакивала, так правильнее","158":"Ну вообще да","159":"Понял-понял) А у вас к языку вообще никаких требований?","160":"а ldc2 сразу","161":"Ну короче вез синглтонов жить вполне можно, особенно когда есть DI и там контейнер еще. В этом случае в начале создаем инстанс контейнера, и всегда используем только его. И нормально живем.","162":"Может, разные версии libev? У меня libev-dev 1:4.22-1","163":"Ты так пишешь, как будто там GC - отдельно, а RC одельно :)","164":"Ваще если так подкмать","165":"Появились разработчики фронтенд приложений, которые пишут у себя полноценную бизнес логику, и бэкенд который отвечает за предоставление серверного API и проверки прав доступа.","166":"я ж дергал","167":"Ага, платиновый член чего-то там - сокращение издержек?","168":"но его лучше не использовать вообще никогда","169":"Ну в принципе ожидаемо же","170":"ето мой, шоб аргументы просто через запятую писать а они сами в стринги превращались","171":"можно еще сделать не помню как называется, функции возвращают специальный объект, в котором есть признак ошибки","172":"D - сын полка.","173":"ммм.... если он работает в терминале, то можно забыть скорее всего о выборе графиков по рандомным точкам и прочие удобства десктопных приложух и мышкокликства.","174":"Аргумент непонятный. Потому что, по крайней мере я, про разработку и говорю. Не про стоматологию же?","175":"И что?)","176":"+++","177":"x86_64-pc-windows-msvc — это из настроек LDC, там такая конфигурация прописана","178":"на С++ большинство ошибок выглядят как хер пойми что каскадом ломятся иногда так, что изначальную ошибку не видно, но разговор не об этом\nвнешний кодген это внешний тул, не является частью языка, а следовательно у каждой реализации будут свои фишки и плюшки, это никак нормально дружиться между собой не может","179":"Дешево же","180":"Якщо ви новачок, не переживайте, це перевірка на бота","181":"Напиши решение","182":"Ты же понимаешь как гит работает?","183":"тоесть ты несёшь в свой личный проект подход, который принят у вас на работе?","184":"обернуть С++ строки (уже сделано) и СТЛ-контейнеры в Д-обертки, добавить сахара\/оберток\/методов для ренджей, и всё - юзай их без ГЦ.. плюс интероп будет проще.. чо бочку то катить на ГЦ","185":"хотя это наверно и ненужно","186":"представь что ты вычисляешь длины тысяч векторов","187":"Понімаю","188":"Вообще","189":"удивительное дело, как бы не остаться без работы","190":"не","191":"но так как на стороне разработки есть такой аргумент - доплатите за улучшение, а то вообще работать не будет (не будем старую либу поддерживать и т.п.) - то получается вечный перекос в интересах.","192":"всмысле пишу программы на D под arm на работе","193":"FP?","194":"хотел вопрос, кст, по этому поводу задать. Хочу попробовать реализовать Entity-Component-Systems на сообщениях. Мир запускается и обрабатывается отдельным потоком, когда происходят какие-то изменения, они пачкой отправляются ECS и обрабатываются до следующего frame-а. Изменения рода создай вот такие сущности с такими то компонентами или повесь\/убери на этот\/с этого сущности компонент. Всё остальное должно происходить вне сообщений.","195":"эмм... вроде всё необходимое показал: всё сводится к тому что мне нужно из функции вернуть `string`, который я хочу сделать из куска динамичсекого массива чаров 🙂","196":"у вас там в луа-паблике я смотрю тоже формируется \"своя атмосфера\"","197":"ссылки (ref) используются только для передачи аргументов в ф-ю","198":"Который реализует интерфейс для всех репозиториев","199":"уже","200":"Ребят, кто в Behavior Tree шарит, есть такие?)","201":"Например в клетке содержится по 23 хромосомы от обеих родителей","202":"я так по-началу делал, когда с Go переходил","203":"@Mak_Trefa шо","204":"Ну, епта, как я в мета коде всю сигнатуру правильно скопирую","205":"to! не работает тут?","206":"Можно ли его использовать везде? Да. Целесообразно? Вряд ли","207":"Так и я про што, то что в одном языке считается best practice в другом считается дурным тоном и наоборот. И на такие неочевидные мелочи уходят годы, а до этого пишешь говнокод","208":"а не тупо сидеть гадать почему оно падает","209":"ну у xaml есть и свои прелести","210":"Если сосед - мудак, то надо репортить","211":"или какие опциональные, здесь тонкая граница\\синонимичность с дефолтными f(x=\"y\")","212":"Тебе уже ничего не поможет, давай по второму разу","213":"Хз, у меня сцен граф, сделал две функции newNode, deleteNode и все работает без gc","214":"В целом таки имеет смысл подход Go. У них нет женериков, только интерфейсы, но, в случае чего, есть рантайм рефлексия","215":"Полностью совместимый с сипипи!","216":"это проблема старого гнома вроде","217":"и может зарепорчу","218":"правильно настроить сервис systemd","219":"это надо сначала проверять на empty() перед вызовом in ?","220":"Короче лично мне Zig не кажется проще, чем D.","221":"Почитай про .init – после вызова move восстанавливаются дефолтные значения для структуры, без вызова конструктора","222":"не встречал. но поиском находит в куче либок из ldc. попробуй залинковать в проект одну из ldc_rt.lib","223":"https:\/\/crystal-lang.org\/reference\/syntax_and_semantics\/macros\/hooks.html","224":"но да. можно и D","225":"Мтак, у меня получилось всего лишь 5 rss-лент по D: сабреддит r\/d_language (r\/dlang выглядит мертвым), офф.блог, lhs-blog.info и две ленты из релизов dmd\\ldc их репов на гитхабе. Хотя релизы проходят и в блоге, и на реддите и еще, по наблюдениям, через тот же r\/programming, но решил подстраховаться. Как я понимаю, форум позволяет подписываться на сообщения в теме, но нет ленты на список тем в ветке, поэтому как источник новостей не слишком годится. Можно подписаться на ленту тэга на хабре, но у меня уже есть общая хабровская лента, так что увижу если что. Еще есть какие-нибудь живые источники новостей, я что-то упустил?","226":"Первое я бы решил чем-то типо @__attr(\"nothrow\")","227":"LTO в LLVM + любой нормальный язык с тредами  (Ди, конечно) гораздо лучше","228":"Может загрузить откуда-то извне и установить","229":"смотрю разрабатывают его много людей и вроде видные участники сообщества","230":"Чтобы можно было хоп-хоп и в продакшн","231":"чо он такой не популярный","232":"А ещё метамфетамин тоже мета","233":"ненене, я не пытаюсь свести процес описания алгоритма к самой его примитивной форме, а выразить алгоритм максимально сжато, имея определенный набор инструкций в языке","234":"Нет, там маллок лол","235":"ДА","236":"Внутри фирмы там","237":"В сервисах на питоне или пыхе такое тоже можно)","238":"профит в магии. если иметь правильную схему можно магически получить маппинг в твой класс на любой поддерживающей это библиотеке в любом языке","239":"не, мне стыдно такое выкладывать","240":"dub исходники качает, обычно dll не кладут с ними (хотя некоторые так делают)","241":"Ага да","242":"допустим, что в модуле ну пусть 3 кастомных исключения. Приложение разрослось до 10 модулей - это уже минимум три десятка классов. На ранних итерациях опять-таки важна скорость компиляции, разработки и быстрота отмирания неудачного кода. Насколько эта возня с десятками классов оправдана... особенно если оно там бросается по 1-2 раза, тут вопрос. Ну и обратная сторона ООП - риск получить быстрое переусложнение кода и запутывание его в адовую лапшу, если рост классов не сдерживать. Они, конечно, тут все простые и однозначные, но хз...хз.\n\nНу т.е. нужно помнить, что ООП не просто так ругают\\ненавидят\\хейтят и есть за что. Альтернатив, правда, нормальных не предлагается, поэтому приходится как-то пытаться сдерживать его рост.","243":"https:\/\/www.facebook.com\/photo.php?fbid=10215636895216658","244":"Вот class C : A подожди это работает?","245":"короче мы о разных вещах)","246":"а точка что значит?","247":"над юзать gdk_threads_add_idle","248":"короч не надо недооценивать оптимизатор ldc-шный","249":"го ворс по джом маркету? шо за бред, даж в россии вакансий полно","250":"Зачем ты споришь со мной?","251":"примерно на треть бинарника, базарю","252":"да, unspecified, нет и никогда не было. люблю ++","253":"ну вот","254":"на динамический массив ссылку правильно передавать через ref?","255":"А при чем тут сорт?","256":"так что спасибо не надо)","257":"не только. есть вариант - ядро ++, ui - pythhon","258":"Хочу сетозаливалку сделать","259":"Заходишь на любой сайт какой-то маленькой компании, а там жпег на пол экрана","260":"взять либу, с помощью gcc развернуть весь препроцессор, результат использовать в D даже в ct","261":"Лучше камел","262":"или там есть какое-то правило на эту тему?","263":"а мало чтоль?)","264":"Если удалять чинно, то надо искать в рантайме функцию типа gcRemove и передать это дело сборщику мусора. ..","265":"Да) уже видел даже несколько. Хочу попозже посмотреть на неё","266":"то бишь если в чем то чтото прайват оно не импортится из модуля, а так не везде?","267":"中華 в правом столбике второе снизу это не Китай?","268":"Error: absolute minimum reached","269":"это какие-то приколы ленивых функций?","270":"там своих приколов хватает","271":"This module implements integral arithmetic primitives that check for out-of-range results.","272":">virgin @safe walk\n>chad @system stride","273":"может и не дичь, конечно, но чёт смахивает","274":"Телеграм именно такой","275":"Ты случайно не в колледже их взял, у нас в кабинете истории были такие","276":"если проитерироваться по ResultRange, то будут все элементы. вот он и итерируется, вставляя по одному в массив","277":"Ну для консольных приложений это может быть и пойдёт)","278":"это как не до конца покрыть важную часть кода получится по сути","279":"терминалы — это вообще боль через боль)","280":"по нужном направлению.","281":"**Result**:\n```---```","282":"меня вот больше удручает, что DIP про @nogc исключения в качестве эксперимента запилили, но в betterc исключения все равно не компилятся","283":"Ахах","284":"Александреску действительно существует? обалдеть. как живой.","285":"Короче ржака","286":"\/start@PollBot","287":"Адам Руппе?","288":"Выглядит немного по спартански, внешним видом чем-то отдаленно напоминает delphi, мне понравился хороший автокомплит.","289":"конечно можно","290":"есть работает флаг arch для исполняемых файлов, то значит он так и думает","291":"короч можно брать и пилить","292":"ни крупных проектов??","293":"Можно добовлять в зависимости вот этих субпакеты другие субпакеты без указания в них пути","294":"+","295":"Ну тогда надо было объявить это как const shared string[] или immutable shared string[]","296":"не выделил память под класс или удалил её к моменту вызова?","297":"нет, в стеке лежат только значения переменных подряд друг за другом)","298":"и тебе остается тремя командами сделать нейросеть для анализа бигдаты с записью в блокчейн сделать","299":"Ну смысла нет только для си","300":"ну у меня мапа типа значения - хочеш - копируй. не хочешь используй указатель","301":"точн, помню","302":"да?","303":"То есть снять с плеч программиста рутину по настройке системы сборки","304":"Но поэтому я предпочитаю JS CoffeeScript","305":"все выше перечисленные серверы - с федерацией, есть куча других, но все они без неё","306":"Софтварно* имел в виду","307":"имхо лучше вручную","308":"А в чём топик с byLine?","309":"для любителей unique\/shared_ptr, которые уже привыкли работать без gc, есть","310":"Ну скажем, элемент тренировки тут тоже есть","311":"https:\/\/github.com\/nin-jin\/go.d\/blob\/master\/app.go ?","312":"просто не будет проверок и все. Проверки можно сделать по-разному - можно относиться к функции как к контракту - проверить вход, проверить инвариант, проверить выход. Если ошибки на каждый случай обрабатывать сложно, то можно выкинуть вход и выход, оставить что-то самое важное и то не факт, написав об этом, например, в доках. Тогда если код ляжет, то всегда можно сказать, что клиентский код сам виноват - не читал доки к апи. Это полностью снимает проблему строгих контрактов.","313":"а е-мае, там ldc","314":"для чего? ты хочешь передать класс по значению куда-то?","315":"Да","316":"на вики есть небольшая заметка о ди https:\/\/wiki.osdev.org\/D, и там ссылка на тутор с ядром.","317":"сдулся?","318":"Это была не опечатка)","319":"https:\/\/gitlab.com\/ita1024\/waf\/-\/tree\/master\/","320":"Не существует абстрактной SQL базы в вакууме","321":"Часто используемых? о_О","322":"Дайте IDE с подсказками - и разработчик будет добавлять фичи в 10 раз быстрее","323":"Я уверен, что ТС именно об этой секунде.","324":"Нет, в смысле, я прочитал как \"все файлы могут резко начать вместе писать\", то есть да, такое может случиться","325":"как-то так. за подробностями - смотри gtk","326":"Это типа демонов линуксовых?","327":"Тогда что ты тут забыл?)","328":"А зачем одна концепция?","329":"Но никто не мешает мои приватные репы держать в меркуриале. :)","330":"Ннада искать новую работу крч","331":"это просто баг","332":"Ну в целом норм результат для хаскелля, средний программист на нём такой бенчмарк и получит.","333":"у кого-нибудь ldc2 падал?","334":"не понимаю","335":"Правда скорее на betterC надо будет\nЧтоб без GC","336":"Vala","337":"нужно было своп включить 😏","338":"живы они ещё","339":"А такие ошибки как отлавливать?","340":"От оно супернужно","341":"Шаблон с неизвестным количеством параметров.\n\n`template<typename ... Pack>`","342":"Ну ты в курсах, что как минимум скролинг у тебя не получится плавный?","343":"В статическом массиве понятно, это работает. Но куда в new вписать значение?","344":"```import gobject.Type;\nimport gtk.Main;\nimport std.stdio: writeln;\n\n\nprivate:\n\n\n\nextern (C) {\n\nstruct TTTClass\n{\n    GObjectClass parent;\n\n    static void init(TTTClass*) {\n        \"test\".writeln;\n    }\n}\n\nstruct TTT {\n    GObject parent; \n\n    static GType ttt_get_type () {\n        static GType type;\n        if (type == 0) {\n            static GTypeInfo info = {\n            TTTClass.sizeof,\n            null,   \/* base_init *\/\n            null,   \/* base_finalize *\/\n            cast(GClassInitFunc)&(TTTClass.init),   \/* class_init *\/\n            null,   \/* class_finalize *\/\n            null,   \/* class_data *\/\n            TTT.sizeof,\n            0,      \/* n_preallocs *\/\n            null    \/* instance_init *\/\n            };\n            type = Type.registerStatic(GType.OBJECT,\n                                            TTT.stringof,\n                                            &info, cast(GTypeFlags) 0);\n        }\n        return type;\n    }   \n}\n\n\n\n}\n\nint main(string[] args)\n{\n    Main.init(args);\n    auto t = TTT.ttt_get_type();\n    Type.createInstance(t);\n    \n    return 0;\n}```","345":"Я тут конструкцию:\n`nothrow @safe {`\n`try {`\n\nувидел т.е. получается функция nothrow обрабатывает исключения внутри самой себя так?","346":"Такое ощущение что автор там чем-то упоролся","347":"тут соглы, ну можно в виртуалке пробнуть","348":"просто задрали. выглядит же будто есть библиотека для того и для сего","349":"Кал-бэк. Ты сам все понимаешь. :)","350":"АХХААХАХАХ","351":"и структуры, кроме тех, что на себя ссылаются","352":"Я вот щас подумал что возможно все не так как мы хотим сделать. У меня кажется скомпилировалась правильная схема в голове )","353":"Ну, я понимаю о чем ты. Так то звучит логично, а на практике что вышло, то и работает, при чем норм.","354":"Когда он не хочет сравнивать просто инт и нуллабл!инт)","355":"Опять двадцать пять. Приходят умники, последний раз смотревшие на вайб в прошлом десятилетии и городят чепуху.\nВайб давно уже порезан на сабмодули. не нравится встроенный хттп-сервер - не подключай его и он даже скачиваться не будет. Можешь только ядро подрубить и на голых вайбовских сокетах пилить свой http с блэкджеком и шлюхами. Не нравится роутер? Напиши свой и подруби к вайбовскому или своему хттп-серверу. Монолитность, извините, у вас в голове, а не в вайбе.","356":"UPD. Яндекс переводчик вроде как поумнее: Большой удар, особый удар, перевод Байду. Вот так, пожалуйста, поймите.","357":"Не хипстота, короче","358":"и оно будет смотрется красиво, нативно и с анимашками","359":"напиши пример ключевого слова? :) как видишь ето","360":"не знаю","361":"На самом деле класс еще может быть определен внутри функции. тогда тоже создается `this.outer` содержащий контекст.","362":"`Since:  Qt 5.12`","363":"там надо рандом делать было","364":"а всё. это решил","365":"ldc2 тоже падает","366":"Да, он им не нужен","367":"А что тогда показатель? Оно даже в нише никому не нужно.","368":"Я думаю можно","369":")))","370":"может даже найти какой-нибудь material ))","371":"может я неправильно понял, о чем речь. но ничто не мешает из запроса так же назание класса вычислить. $class->new->$method. рефлексия не поможет прочитать из несуществующей таблицы","372":"1 ботан, а второй дополнительно какой то проект пилит, так вот второй первого по навыкам уделает)","373":"правильнее хэш-таблица","374":"Ну вот а когда начинает что-то тормозить, можно и переписать на компилируемом. Тем более что такие проекты всегда умирают если один из создателей уходит.","375":"докер вещь не идеальная, но жить вполне можно, а уж для деплоя жизнь сильно упрощает (не в проде конечно)","376":"Мне больше ruby нравится ИМХО","377":"Для мелочей он нормально сидит","378":"Меня на собеседовании одном попросили скл запрос написать","379":"И в исходники не залезть. Только заголовок есть","380":"Про это","381":"Дык это код - могут забыть что-то важное. Если протокола официально не публиковали то реверсить его лучше не надо.","382":"через вот эту опцию? http:\/\/vibed.org\/api\/vibe.http.server\/HTTPServerOption.distribute","383":"Это все типо генерится","384":"но real.max не занимает полностью всё","385":"Мде, тут бы редактор нормальный найти)","386":"но явно не так","387":"Ладно это некоструктивный разговор. Я не знаю как измерять дикость хуйни.","388":"Правильно, усугубляешь её","389":"","390":"его ж первую версию написали за пару недель","391":"`longer[0 .. 1] == shorter\n\n`И в данном случае сравнивается \"диапазон\" с... просто аргументом\n\nПочему не\n\n`longer[0 .. 1] == shorter[0 .. 1]\n\n`Или\n\n`longer[] == shorter[]\n\n`Не понимаю эти моменты","392":"А это O(2n) ?","393":"Windows 10?","394":"однозначно","395":"ну он же ускоряет разработку..","396":"Подумай заодно как бы обойти этот момент с DUB, когда он с одной стороны рекурсивно всё читает, с другой может прочитать название модулей в их начале, но всё равно надо чтобы внутри soruce\/ было всё согласно иерархии расставлено","397":"Приду на работу и заявлю: посоны, я буду в проект писать на Ди. В ответ: ну, иди отсюда, пиши.","398":"А, да я забываю сразу как рыбка","399":"в своём коде лучше пользоваться std.traits. в __traits есть смысл лезть очень редко","400":"тут где то били лайфахаки по среднему значению\nкрч лучше ничего не делать мне кажется","401":"при том, что давно пора бы поднять себе зп где-то до 120 как минимум","402":"ищи version","403":"а не мог бы ее объяснить, я не совсем понимаю что там написано","404":"500 мегов максимум, на старте 200","405":"Сами клиенты программировать всё равно это не будут, а для себя удобнее текст.","406":"Был бы нормально оспроектированный стандарт, такой, обобщенное системы, вот было бы норм","407":"Но D не обрабатывает SEH исключения","408":"`UserRecord user = UserRecord.get(id);`","409":"Вопрос в том что туда писать","410":"Кто?","411":"баффер оверфлоу через обработчик ошибок в gc в druntime","412":"они сделали asm.js )","413":"Очень приятный язык","414":"можно конечно накатывать патч при каждом скачивании исходников, но эт какое-то извращение","415":"Да я не про сис диск","416":"CSP это свой подход, когда он чисто реализован, все красиво. Когда начинаешь смешивать с шаред параллелизмом и локами, красота теряется, начинаются сложности.","417":"Да, сорри я с телефона","418":"поехал в гугл","419":"У них вроде было это в планах","420":"Ты делал и песочницы для интерпретируемых языков и для бинарников?","421":"Вот у меня в Убунте после обновления, какие-то функции глючить начинали","422":"сделал пример","423":"а что там за значок, если не секрет, больно похожий на RSS слева от звука?","424":"Так неинтересно\nВот лучше языки, у которых есть крупные проекты, которыми пользуются большое число людей. Это уже интереснее","425":"Сначала надо предикат посчитать","426":"а ты смоллтолк знаешь?","427":"тогда уж цги какойнить сделай)","428":"Так я и не спрашиваю.\n\nЯ спрашиваю: \"а если в другом месте вставить?\"","429":"что самое интересное, если целиком метод помечать как `synchronized` то он становится `shared` и просто так его не дёрнуть","430":"да не просто, щас с GeoIP вожусь","431":"Я где-то читал что с тех пор многие разочаровались в языке и ушли","432":"Нужно ли его делать глобальным","433":"Есть. Нету защиты памяти и сломанные таски могут вредить данным других потоков.","434":"Косвенная есть. И она скорее всего обратная. Чем проще код тем сложнее то, что под ним прячется, в том числе шаблоны.","435":"кст про них. Ничего лучше Intellij IDE с плагином нет?","436":"Шкильник?","437":"неа, там тупл","438":"в этом случае можно даже не трогать windows","439":"ммм.. просто я смотрю большая часть туторов жс-вских на самом жс. Следовательно, выдирать сниппеты из туторов проще тоже на жс и делать класс-обертку на ts для либы. Значит класс или отдельные методы должны аннотироваться для включения динамики, а остальной код - нет. Хотя... наверное я ищу аналогии с груви, кгм...","440":"вот именно сама сериализация и интересует","441":"не нравятся каменты? возьми прогерпай и проставь их везде в таких местах","442":"Всё что ct","443":"он понял, что д - путь в никуда","444":"час же","445":"первый вопрос: тебя не устраивает, что прога занимает в памяти 200Мб?\nвторой вопрос: у тебя самый основной массив данных есть, почему ты не вывел на экран (ну или в файл на крайняк) его sizeof?\nтретий вопрос: ты уверен, что тебе нужен полностью весь массив в памяти, если тебя запаривает занимаемая память?\nчетвёртый вопрос: если всё парит, надо как-то оптимизировать и на производительность ты пока клал хер попробовал ли ты в цикле вызывать GC.collect?","446":"потому что тоже попробует закрыться","447":"mysql отлично умеет крутить данными на терабайты, ну и что","448":"","449":"используйте дак дак го и покупайте их футболки","450":"да, приоретизация была раньше в syslog","451":"свои бэкенды написать?","452":"И причём это либы спец под реакт","453":"Я наталкивался на предложения чтобы любые pure функции вычислять в CT, но Уолтер не хочет и это называется partial compilation","454":"Студия вроде одна","455":"Моя задача - написать код, без багов. Доказано, что тот код, который проще для восприятия, содержит меньше багов. Я так понимаю, у вас обратная задача?","456":"https:\/\/dlang.org\/library\/core\/memory\/gc.minimize.html","457":"Как по мне логичнее было бы в данном случае выводить окошко или ещё где-то мол некорректный ввод","458":"да","459":"Если используешь шидулер, то этот файбер может выполняться в другом треде","460":"Все можно делать , только нужно понимать что ты делаешь","461":"Refinement?","462":"Это к ним не имеет никакого отношения","463":"оо, генту, кто-то сказал Гентуу","464":"Ну круто!","465":"Finite state machine","466":"хотели рефлексии? ешьте!)","467":"ну наверное да","468":"Зато можно в {} объеденить","469":"Они, правда, не удобные","470":"Очень странно сделана передача шаблонного миксина в качестве аргумента шаблона\n\nя не могу просто взять и написать\n```mixin template Mxn1(alias str)\n{\n    enum b = str;\n}\nstruct Str1(alias mxn)\n{\n    mixin mxn;\n}\npragma(msg, Str1!(Mxn1!\"qwe\") );```","471":"Там вот вопросы :) куда тебя твои цели приводят? С тем и иди :)","472":"Ок, приведи пож пример, когда betterC помог, а nogc  нет.","473":"Угу, пасибо.","474":"тогда надо прилагать \"meson это круто, используй meson, исправляй проблемы meson\"","475":"в результате получим классический MVC","476":"Ну и вот смотри, язык в принципе не хочет развиваться под Android. До сих пор проект собирается с костылями. Про iOS вообще молчу там ещё хуже","477":"На Go какая то модная очередь была. Забыл название. С работы гляну","478":"extern \"C\" {}","479":"Эээ а нахуа?","480":"Дык этож не про завтипы.","481":"Хз, для меня куда сложнее начать что-то и закончить","482":"в смысле?","483":"как делать A\/B тестирование если не разворачивать несколько разных экземпляров одного приложения?","484":"Есть вроде уже","485":"Кого?","486":"не, я про TLS","487":"он там не запаривался по оптимизациям","488":"immutable разрешает инициализировать данные всего один раз","489":"(но гтк определенно часть гнома)","490":"Ты наверно про гошку пишешь, а я про плюсы, если что.","491":"Но не менее важная конечно","492":"Я бы им сделал","493":"с этим согласен. но если злоупотреблять этим понятием, то так можно любые инициативы и креатив запороть. трудно вобщем ответить.. так бы C никогда небыло","494":"Ну если бы сервер был на расте, мне бы было проще перенести модели и не думать о том как сериализуется\/десериализуется","495":"> поддержка динамической типизации и встроенные средства для параллельного программирования. Синтаксис Julia близок к MATLAB с заимствованием некоторых элементов из Ruby и Lisp.\n\nкакое лютое нинужно","496":"а что у тебя входит в структуру события?","497":"в первый раз увидел пользу в @safe","498":"Вопрос , а как дела в deb  с arch например?","499":"В данном случае я думаю, что другая причина, т.к. классы не писал","500":"Но спрос на реакт огромный, что самое смешное 😄","501":"а если тебе клиент прислал заголовок content-type, а ты пытаешься найти Content-Type?\nХотя, не аргумент, можно названия к нижнему регистру приводить принудительно.\nНо автокомплиту ничего не противопоставить))","502":"A new version of dub package [lwdr](http:\/\/code.dlang.org\/packages\/lwdr) **0.1.0-beta** has been released","503":"То ли <10^^5 то ли <10^^6","504":"Ну если базу выключили и она закрыла соединения то ты пооусишь не таймаут а успешное чтение 0 байт. Если сервер выключили то будет таймаут. Если выключили и включили то будет ошибка, нааерное connection reset","505":"это постоянно дочери говорю )","506":"Мне на ди не надо","507":"Я его не смотрел ещё, даже не знаю, как он выглядит","508":"А юнионы есть?","509":"А при этом деструкторы вызываются? Хм","510":"и так ее и назвать","511":"Форт простой и полезен иногда","512":"нее, это ведь наоборот неинтересно, java C# python","513":"он разворачивает всякие конструкции и т.д.","514":"Разве? Те что в ИмпортСи добавили?","515":"нельзя было переписать участок с raii","516":"Ну, по идее, шорткат функции уже вошли в компилятор из эксперементов, надо посмотреть","517":"у друга тоже OSS ?","518":"он раз в 5 медленнее обычных винтов лол","519":"просто масштабы использования с++ намного выше","520":"я упомянул к тому, что раньше кое-где школа сильнее развивала кругозор.","521":"Структура сама удаляется, когда выходит из саопа","522":"Нащо воно тут, якщо це чат по D","523":"Через ldc.attributes и ещё что-то такое\nА не через Intel-intrinsics","524":"при том, что до этого там была ошибка с Nullable, пришлось развернуть","525":"еще вариант. для установки значения нужен TreeIter, он не может где-то там в цикле копироваться или еще как-то дублироваться многократно?","526":"Перелинковывается","527":"xversion? - версия используемой оригинальной либы","528":"при старте вызывает проблемы","529":"для чего?","530":"кто нибудь активно пользовался ProcessPipes?","531":"например, в функцию передается массив как шаблон (можно такое сделать?) и в зависимости от того, какой тип элементов массива, в функции делаются разные действия","532":"тамый топчик по читабельности это стринг mixin-ы\nвот это вот говно, просто каеф:\nhttps:\/\/github.com\/vibe-d\/vibe-core\/blob\/master\/source\/vibe\/internal\/async.d#L124\nа в конце эту строку форматишь ещё, и потом миксинишь и обмазываешься своим ЖИРНЫМ бинарником.","533":"Нет","534":"Вот мой запрос:\n```sql_test = \"\"\"\n      MERGE INTO CONTRACT_PROCEDURE_FZ44 p\n      USING (SELECT \n       :contract_id as doc_id,\n       :contract_publishDate as PUBLISHDATE,\n       :region as region\n       \n       FROM DUAL\n      ) v\n      ON (p.doc_id=v.doc_id)\n      WHEN  MATCHED THEN\n        UPDATE SET \n         p.PUBLISHDATE = TO_DATE(v.PUBLISHDATE,'YYYY-MM-DD'),\n         p.region = v.region\n\n      WHEN NOT MATCHED THEN\n        INSERT (p.doc_id, p.PUBLISHDATE, p.region)\n        VALUES(v.doc_id, TO_DATE(v.PUBLISHDATE,'YYYY-MM-DD'), v.region)\n\n\"\"\"  \n\n```Он и значения для связывания передаются в функцию:\n\n```    def save_to_ora(self, asql, abindvar):\n        try:\n            if self.cursor.statement != asql:\n                self.insert_prepare(asql, self.cursor)\n            self.cursor.execute(self.cursor.statement, abindvar)\n            self.conn.commit()\n        except cx_Oracle.DatabaseError as e:\n            print(\"error save_to_ora: \", e)\n            self.oradisc()\n            sys.exit(1)\n\n```При составлении SQL запроса руками легко ошибиться и по ошибке передать больше ключей, чем нужно. Тогда Oracle выдаст ошибку. Так же я каждый раз должен проверять корректность имен ключей. Я это как-то все инифицировать хотел, чтобы просто в функцию передавать ключи, а в ней просто описать как я хотел бы мапить значения. Ну что-то типа такого (псевдокод):\n```xml_tag_name.MapTo(\"ColumnName\")```","535":"а как оно, без GC живет там, где нужно выделить память?","536":"а что, тоже неплохо! на скорость не влияет","537":"@chebotarevp возможно ты прав, я кажется нашел что-то подобное","538":"еще какие-то good и bad","539":"Да","540":"додумывались, но боялись вскрывать тему","541":"Сори!","542":"ubyte buffer же","543":"Вот именно что частично","544":"Крайне","545":"@Mak_Trefa привёл в порядок тот код, про файберы с асинхронным io","546":"вот это никто не щупал?","547":"ибо это хороший знак","548":"С иелефона тяжко писать","549":"они обычно мокаются в сборке без профайлера","550":"И для этого не нужен универсальный язык. Живут же люди как-то сейчас, без универсального языка и даже не всегда скрещивают жаб с гадюками.","551":"исправлять надо dcd - он не все фичи языка поддерживает","552":"strBuilder.reserve(100);","553":"Lowmem?","554":"Вот сейчас изучаю тайпклассы, очень похоже на трейты","555":"а что это?","556":"знакомые приборку автомобильную на ём делали","557":"Ого, ты пишешь в ЖЖ в 2019 году?","558":"Да не. Мне просто надо уведомления слать в канал.\nТам полноценный бот не нужно","559":"вот именно","560":"оно и переподниматься будет","561":"потому что он несовместим с новым проектом","562":"самое печальное, когда требуют то, что не понимают","563":"Лучше вижуалстудии ничего нету)","564":"радуйся, ты чуть не попал на галеру","565":"Значит я не понял про что ты","566":"у нас самописная на cpp","567":"Ну всё зависит от того, откуда ты запускаешь","568":"Можно написать","569":"короч да. сейчас - косяк и аргументы из разряда \"но стороние тулсы в типы умеют\"","570":"Там много присунувших против ,ЧСХ!","571":"А еще коль ты тесты показываешь, я на GitHub полазил посмотрел как кто делает и понял, что ну как кто хочет так и может. Вы тесты не создаете отдельными файлами а прямо в описании модуля пишите?","572":"Тут проект 15 лет писали не пойми кто, а всё для того, чтобы я сейчас сидел и выкидывал всё нахрен.","573":"ну или брал бы и подключал самые быстрые парсеры и прочие либы","574":"Инкремент","575":"Так то лучше","576":"ок а про второй ПР?","577":"Ну вот","578":"Да","579":"Вот пусть он сделает работу по объяснению что куда возвращается какого типа","580":"@ahdenchik неужели нашел роботу на D?","581":"Может ты ещё не знаешь как квн расшифровывается?","582":"А лол","583":"Ничего — это будет не первый вид, который вымер","584":"Ну у меня есть стойкое подозрение, что асинхронное логирование даже если не забывать await будет источником проблем. Потому что никто порядок вызова асинхронных функций — это уже в каком-то смысле внутрянка, на которую полагаться не стоит.","585":"Нашел цитату царя о хацкеле:\n```И вот наш мамкин гений, вооружившись помойной методичкой из запарты - идёт и рассказывает мне об очередном хаскеле, что вот типизация там статическая - типы ведь есть. Но нет. Это такая же описательная типизация. И любого запартыша с подобными предъявами - можно тут же слать нахрен.```","586":"список возможных пиров большой?","587":"Там сразу отличие видно","588":"сорян)","589":"в функции waitEndOfRead оно не детектит этой проблемы с сокетом","590":"зачем их выкидывать?","591":"не вижу разницы например между ворнингом и ошибкой линтера","592":"а есть смысл использовать install.sh, если есть .deb и .rpm?","593":"тлг рулиз","594":"В данном случае - это тот разработчик, у которого нет доступа на запись к репозиторию проекта.","595":"D (libpq, gtkd) + C++( boost)","596":"Хз, в примере не видел","597":"А ты сделал именно так, мне кажется","598":"Или ты все просто списываешь на CTFE?","599":"А так да, идею понял, ничегошеньки выглядит, забавно","600":"Ну и в целом линкер на vscode завелся у меня (без дебага), не завелся на студии","601":"чо, не красноглазик чтоли? Зачем редактор формочек, когда есть вим? :)","602":"хорошим вариантом был XULRunner, но его поэрили","603":"опять плетёмся в хвосте таким образом","604":"Ну го код в студию","605":"Почему следующий код (кстати он в онлайн-компилере не работает) \nhttp:\/\/codepad.org\/BkLvT5Ln\n\nВыводит  \nworker: 1\nтолько один раз","606":"можно, ворпос в том что такое \"успешно\"","607":"Немного пять копеекипро себя... Когда работал фулстек разработчиком то бекенд писал на шарпе а вот фронтенд на ангуляре тобиш тайпскрипте, и я всë игрался с дизассемблиром MSIL или CIL или IL цель была - понять как работает под капотом си Шарп... Это всë обсуждал с коллегами по работе и пришли к выводу что тянет меня всë таки производительность(за ассемблер я ничего не намекаю) просто хочется иметь глубокое понимание того с чем работаешь, а на шарпе всë абстракции да абстракции... Понимаете, я так устраивался на свою первую работу программистом, и мне было о сути всë равно на каком языке писать, а теперь всë поменялось взгляд стал падать не на популярные ЯП а на закономерную эволюцию, имею ввиду си устарел а по описанию D является лучшим из C\/C++","608":"везде через заднее место))","609":"в нем тесты норм, и документация","610":"Может по кол строчек меньше, но куда вербознее","611":"Переопределяешь методы логгера, который передается в writef, а методам логгера такими генерик быть уже и не надо.","612":"Чтобы проверять правильность кастов","613":"А сколько там строк генерится?","614":"В линуксе же как то без этого обходятся","615":"на vala писали  софт под нокии когда они были на маемо (","616":"__traits(getFunctionAttributes,","617":"У тебя на этом моменте появляется несовместимость с С++","618":"Интересно. Можно ссылку на соседний чат?","619":"а разве сейчас вайб не libasync по умолчанию использует?","620":"Я тогда еще сказал, что было бы круто каждый месяц столько получать)","621":"а вообще есть std.path","622":"А с gc проблема решаема?","623":"Ну ладно:(","624":"Оба варианта в разных случаях мешают","625":"оторванная голова редкость вроде","626":"","627":"причины не говорили","628":"С чего бы? не заваливало вроде","629":"`=` копирует данные","630":"А вот в расте получается стат полиморфизм не запланированный выкидыш плюсовых шаблонов, а что-то продуманное изначально","631":"jEdit выглядит как из прошлого века","632":"А скорее local immutable","633":"А в Ди атрибуты без параметров :)","634":"зачем переезжать с андроида и кучей ПО на новую ОС только потому, что она новая?","635":"код неэффективным будет же питоновый, откомпиленный","636":"Тупой биндинг","637":"Вот настроил всё и что потом?","638":"+ некоторые тупо принимают *arg, **kwarg","639":"Если кто-то сможет быстро решать такие задачи - такой им подойдёт на любом языке :)","640":"Гонять строки между ди и плюсами идея не очень, я бы постарался избежать этого. Особенно массив сишных строк","641":"в случае, если делегат возвращает true для элемента диапазона, то этот элемент становится частью выходного диапазона","642":"ГЦ можно не отключать","643":"И что такого особенного в этом вашем Swift?","644":"но походу автор этого не знал","645":"никаких кастомных настроек внешнего вида у меня не было","646":"знаешь, с ++ у меня как-то меньше мороки","647":"мона такой костыль ёбнуть, вместо наследования классов и переписи конструкторов 😃","648":"ну да, зачем плодить недопрограммистов?","649":"в мск 1сники не зарабатывают?","650":"либо jvm, либо js, либо с++","651":"Надо использовать ту, которая подходит больше.\nНапример если мне нужен полиморфизм, то что из этих четырёх лучше использовать ?","652":"при чем для меня это загадка зачем так много","653":"платы то да. у мення даже cnc гравер лазерный есть.\nно проц ты так не сделаешь","654":"вектор это набор чисел","655":"отучаемся говорить за всех)\n\nнужен классический сишный? он таки даден","656":"и автор не может его пофиксить","657":"в виртуальную могут включаться и заммапленные файлы к примеру","658":"о_О","659":"в расте оно нафиг не нужно, блин хочу язык как vala но с бэкендом раста вместо си, вот это было бы круто, V такой, но когда открыли код оказалось внутри какахи сплошные на уровке кола курла для скачки файла","660":"Бота на Ди пишешь?","661":"Это для vim именно? neovim не подойдет?","662":"Там всем все равно на диплом","663":"короч","664":"(если конечно вы не пишите под встраиваемые системы, тогда да, проблема)","665":"Если за расположение сам грид отвечает","666":"В Julia вроде её нет и нет проблем там никаких","667":"почему?","668":"кстати, что такое WAT?","669":"там в любом случае получается определённый разброс. В портируемом коде именованный Math, где-то math, а где-то просто импорт и x(), а где-то селективный импорт math: x. Тяжело за всем уследить.","670":"sdl по тому же сделали","671":"спасибо","672":"И если ему надоедает конкретная библиотека или Ди в целом - они сразу отмирают","673":"просто можно же по идее:\ntoken: \"base64-строка....\" которая будет перекодированный токен содержать","674":"Никак нет. В контексте истории меркуриала проблема была именно в том что они хотели подружить код двух версий питона, которые ну кардинально разные.  Вывод из этой истории надо делать ровно такой же: если выйдет питон 4 (или D3, или вообще что угодно) и сломает кучу вещей, не нужно дружить их вместе.","675":"log log log log","676":"стандартный читает весь файл","677":"что-то типа: натравил функцию а-ля `serialize` на объект\/структуру, она вернула ленивый Range","678":"Ты переобуваешься через сообщение","679":"вот для меня учить программированию не объяснив как работает память это и есть \"что-то не развивать или развивать слабо\"","680":"Я про scope объекты","681":"По-моему збс, джва года живу с этой идеей","682":"хотя если без GC, то рантайма считай нет","683":"вотвот","684":"но это неэфективно же","685":"А когда граница нарушена паника  все равно будет, только сегфолт","686":"K+R C это довольно старая вещь. Если не ошибаюсь, то там был прикол. К примеру если вызвать функцию foo, а её объявление отсутствует, то автоматом создаётся объявление\n```int foo(...);```\nчто приводило к ошибкам","687":"Я конечно понимаю что можно и пяткой ухо почесать, но зачем? Чтобы превозмогая трудности? Есть язык разметки в котором все ровно и явно делается. Зачем отказываться от него в пользу старых решений и наворачивать костыли?","688":"перенс функцию сразу с ее зависмостями","689":"так это и есть мет считай","690":"А так, просто посмотри на мир, мы переживаем кризис рыночной экономики.","691":"вроде как да, в куче под контролем GC","692":"ок","693":"щас найду точно формулировку","694":"Думаю, что в коде, где я пишу Value pos, он вместо класса Value подставляет какой-то другой Value, который имеет тип VariantN","695":"Это убивает кучу проблем на самом деле","696":"Ну значит есть","697":"да поробовал","698":"короче я кажется нашел проблему в компиляторе. смотри, вот так вот будет работать: https:\/\/run.dlang.io\/is\/uyHiZZ","699":"ну и вкусы ещё. выбирай язык, который больше нравится","700":"То есть если будешь продавать хорошие продукты то честь и достоинство не важны?","701":"Из чего напрашивается вывод, что чем больше тебе на собеседовании ебут мозги - тем хуже шарага","702":"Ну теги то именованы и, если они не одинаковые все, то скорее всего я сразу же в это и упрусь. А скобки они все одинаковые. Правда поля есть, но я могу их как произвольный набор ключей считать. Обходится дополнительными обертками в принципе. Ну хотя да, если структура продумана, то более-менее норм должно быть. Однако с парсерами\/сериалайзерами по прежнему есть неоднозначности. У нас где-то как раз из-за несовместимости было два жсон парсера для связи с разными сервисами.","703":"Я придумал новый термин для царя, динлюбопытный","704":"Ну нет","705":"Иной раз получается в разы мозговзрывательнее чем приложение-монолит","706":"поскольку веб мне интересен в последнюю очередь, то конечно нет)","707":"это так же позволяет между потоками кидать данные","708":"но вообще, конечно, идея с гитхабом более реалистична, чем призыв всех и вся в телеграм, как мне кажется)","709":"гальваническая развязка, кстати, много стоит? а то usb->rs48t с гальваникой вообще не 1000руб","710":"Первый семак устройство архитектуры ЭВМ идёт паралельно с плюсами потом структуры данных, и второй семак уже с++ с ооп","711":"намекаешь, requests пора выкидывать из телеги?","712":"и один зеленый блочит все рассчетом?","713":"Фатальный Недостаток","714":"https:\/\/habr.com\/ru\/post\/324984\/","715":"Lua, и туда его не добавляют как раз потому что есть `goto` : )\n\nКорутины — специальная штука, чтобы писать асинхронный код так, как будто он синхронный. Условный псевдокод:\n`bool makeRequest(bla * Request) {\n   auto bla = Socket(...);\n   bla.writeHeaders(Request->headers)\n   bla.writeBody(Request->body)\n   bla.readHeaders()\n   bla.readBody()\n   return 1;\n}\n\nwhile (!makeRequest(req)) {Sleep(.1)}\n\n`Пока сокет принимает данные, функция выходит из самой себя, и программа может делать свои дела. Потом программа вызовет эту функцию снова, и она продолжит работу с места где остановилась, снова попробует прочитать из сокета и так далее, пока не отправит\/не примет всё что нужно.","716":"Я и не писал, что в либевенте, я писал \"в движке libevent\"","717":"ксяоми","718":"Зачем???","719":"главное чтобы микросервисы, бигдата и машинлёрнинг","720":"о","721":"Некоторые скриптовые языки не все динамические кстати, хотя может у меня своё определение динамики как возможности рефлексии и переопределения всего и вся по мере выполнения программы","722":"А кто у нас вообще из контор юзает D?","723":"да ето так","724":"Ну если в таске не перехватить исключение, то оно просто писало в лог, что такой-то таск внезапно сдох и продолжало работать и дальше. Меня такой вариант устраивал.","725":"Пометь","726":"https:\/\/lore.kernel.org\/lkml\/20200722234538.166697-1-posk@posk.io\/","727":"SQL конечно пора уже переписать","728":"Пока головой не ударишься не поймёшь же","729":"это не от dbus","730":"Накладных расходов на классы больше","731":"Прошел д-сурвей. Поныл, что хватит новых фич, сделайте старые нормально, выкиньте половину странных вещей. Я до сих пор плохо сплю от inoutа.","732":"Потом смотрю на пример для сяшки: https:\/\/benchmarksgame-team.pages.debian.net\/benchmarksgame\/program\/binarytrees-gcc-2.html\nИ охуеваю: `#include <apr_pools.h>`\nА ЧО ТАК МОЖНО БЫЛО?","733":"Но вся вот эта концепция шаблонов и UFCS хорошо вписывается в функции, на первый взгляд.","734":"но это догадки","735":"https:\/\/snapcraft.io\/docs\/remote-reusable-parts","736":"напрямую","737":"Нет","738":"Это можно автоматизировать, но фабрику фикстур придется писать полгода, на это нет времени","739":"а изначально оно тормозило потому что он дебажную версию тестил","740":"скорее так. В функцию прилетают данные и она ходит по одной и той же структуре. Это не совсем конвертация ИМХО т.е. слово конверт наверно не в тему","741":"когда это событие происходит, нотификейшн менеджер уведомляет об этом всех подписанных слушателей","742":"Похоже мне придется сериализовать с помощью vibe а десериализовать с помощью asdf","743":"Хотелось бы посмотреть на железки, которые спроектированы, чтобы контроллировать поток песка. :)","744":"По хорошему его выпилить надо","745":"\"Ну и где твой самолёт?\" (Спор курильщика с некурящим)","746":"Может сейчас лучше стало","747":"https:\/\/forum.dlang.org\/post\/lneshgqjxlhpazcckwlv@forum.dlang.org","748":"запуск != отработать расчет","749":"вот да","750":"SSSE3 я там задействовал","751":"получается я в коробку пихаю данные и внутри коробки описываю как с данными в ней работать?\n\nЭто как итерация ranges так?","752":"нет","753":"А я сегодня с необработанным исключением возился.","754":"Скажу вам как человек, который не одну ногу прострелил себе на этом: gtk кроссплатформенный, на винде запустится, но потребуются танцы с бубном. Вообще, у меня где-то был мануал по этому делу, но правда для чистого C. Может и для D подойдёт, не знаю.","755":"Сбербанк чем не угодил?","756":"Заводишь работу фултайм, двоих детей..","757":"но чето не сработало","758":"А кто акцент делает?","759":"И на techempower benchmarks он тоже есть","760":"А ваще @ukrainian_rustacean ты пробова лангсервер писать?","761":"а там у них ссылки size_ptr","762":"А что имеется в виду в задаче, когда пишут: \"используя адресную арифметику (относительной индексации быть не должно)\"? что-то не пойму","763":"В D и так полно вещей, чтоб сделать безопасный читаемый код. Есть еще такая вещь, называется статический анализатор, но у D их пока нет кажется","764":"Написал коммент в опеннете про наш чатик - ждём новых людей 🤣 которым тяжело найти работу на Ди","765":"Ну чет такое себе. Всм докер тут особо не виноват - заглючить могло что угодно и где угодно, нужны логи и метрики, которые однозначно характеризуют состояние приложения.","766":"как жаль что у нас нет static if","767":"такой же эффект","768":"как би кейс описать","769":"@chebotarevp думаю ты можешь быть заинтересован в этой либе https:\/\/forum.dlang.org\/post\/vocustlarsadbankufjk@forum.dlang.org","770":"Если ты его регистрируешь как желаемый для чтения (или соединения)","771":"достаточно купить устаревший телефон и он будет лучше этого","772":"очень смешно","773":"Так это и есть объединение меша","774":"Уолтер сам?","775":"Ну было бы прикольно","776":"\"properties\": {\n          \"prop0\": \"value0\",\n          \"prop1\": 0.0\n          }","777":"Ты диплом на питоне или дишке будешь писать?","778":"А какой смысл экономить коммиты. Ну разрастается, ну и пусть.\nРелизы метками обозначены","779":"У мя в рандомные моменты как по таймауту рандомное количество текста просто пропадает, на десктопе","780":"Илья не починил asdf!","781":"Нет, просто нет.","782":"почти все)","783":"Я жду","784":"Го тут что забыл?","785":"А китайский grpc сложно к вайбу прикрутить?","786":"Логично аж донельзя","787":"Второй тест идёт непосредственно в кубе, который тестируется на том окружении, для которого оно преднозначено","788":"Почти заставил","789":"эм, open?","790":"я даже не могу понять где он его нашел","791":"Он там не тру ФП кастует, а нормальный структурный проект","792":"","793":"Заходи на канал интересующего тебя языка и ищи. Можешь резюме скинуть","794":"ну, вот за emacs например не видно особо корпораций 😊","795":"Например кто-то сравнивал запись в Mongo и в PG и первая с большим отрывом побеждала. Потом выяснилось, что Монга ACID не поддерживает совсем. А как только fsync в PG отключили, он догнал Mongo,","796":"Мне надо было, чтобы он возратил например строку \"int\" и я её вставил в текст, создав соответствующий тип","797":"вот сейчас там вродь все внутри обджекта, вместо самих виджетов, значит нужно ямл транслировать в xml с учетом этого","798":"а в ди это нужно то что выше?","799":"как железяка макбукпро - супер, как юзерский софт и девелопер приложений - тоже ок","800":"конвертирование предполагает и множество всяких разных проверок:\n\/\/ConvException: Conversion positive overflow\nto!int(long.max);\n\/\/ConvException: Input was NaN\nto!int(double.nan);\n\/\/-1\nwriteln(cast(int)long.max);\n\/\/-2147483648\nwriteln(cast(int)double.nan);","801":"Сначала 1 раз в минуту, потом 1 раз в секунду, а потом оказывается что мы теперь хайлоад. Тру стори, прямо щас такое перепиливаю.","802":"dbeaver юзает эклипсовский osgi, насколько я помню, поэтому часть конфигов еще будут в рабочей директории с .metadata, разбросанные по папкам с плагинами, а часть в General. Путь к директории с конфигами можно скорее всего установить через конфиг или же поменять дефолтный каталог через -Duser.home или как там его по аналогии с эклипсом. На старых версиях в линуксах он создавал папку в домашней директории, как в новых версиях не знаю.","803":"ну мне больше нравится идея компиляции в машинный код у клиента","804":"и не надо ебаться с подключения пайтоновской вм","805":"что за баззворд?","806":"хранится то хранится на битбакете, но тут платно и типа ещё куда-то...","807":"Судя по описанию хорошая вещь🤔 одно http\/2 чего стоит","808":"Потому **концептуально** мне очень нравится идея с betterC","809":"А что мешает писать модули ядра на D?","810":"Типа чтобы умел сервить но делал это просто и хорошо","811":"но бесполезная","812":"для взаимодействия с типом","813":"на ютюбе качество звука не лосслесс вроде","814":"> русской наукой и культурой\n\n...И нарезал руки колечками","815":"403 ошибка при скачивании","816":"Потом мне опять вводить := как в питоне?","817":"1 мин","818":"В идеале в функции должен быть один return","819":"лет 15 назад собирался на zsh переехать да так и не решился","820":"У меня такое ощущение, что человек на ди, как на плюсах пишет","821":"gdb на проде тоже не поможет. Ну или поможет если прод позволяет остановку на минуты или сколько нужно","822":"Вот с поддержкой и мейтененсом (read fast) на мой взгляд хуже","823":"А термин \"папа\" и \"мама\" для разъёмов делает тебя красным?","824":"ну как сказать. Терминал просто завис на середине и все)","825":"ну так смысл функцию в классе объявлять","826":"срезанные уголки только для отрисовки, а для управления их можно игнорировать, я по-моему встречал такое  и было нормально","827":"Ты про chroot?","828":"Этот ньюанс будет бить тебя по лицу, если вдруг захочешь писать асм сначала без stdlib, а потом добавить stdlib","829":"а лайфтаймы нужны именно чтобы отследить время жизни объекта","830":"а, ну тогда норм, просто по опыту могу сказать, что сделать хорошо быстро не получится, там много нюансов и большая документация) я когда этим увлекался, когда добился хорошей отрисовки, понял, что все ресурсы уходят на саму отрисовку)","831":"Да, для растофилов","832":"d - тоже так мог бы, если бы в нём было бы по-меньше ошибок","833":"Именно то, что написал выше","834":"Потому что раст не ооп?","835":"С таким же успехом можно утверждать, что и ты копируешь чужой код.\n\n»\"Он не пишет код сам, он вообще тупой в этом плане, тн просто во время \"обучения\" запоминает комбинации букв в конкретном контексте и потом их комбинирует.\"\n\nОн это запоминает примерно по тому же принципу, что и мозг — при обучении в нейросетях устанавливаются соответствующие весовые коэффициенты, в результате нейросеть превращается в набор фильтров, из которых формируется алгоритм её работы.\nВ мозгу нейросети примерно так же работают. И обучаются примерно так же.\nРазница лишь в схемотехнике — если принять мозг за суперкомпьютер, то этот бот — это всего-лишь калькулятор.\nСделай такую же сложную схему нейросетей, как в мозге и результат будет соответствующим.","836":"@DarkRiDDeR","837":"А чем вообще константа не устраивает?","838":"¯\\_(ツ)_\/¯","839":"boost::property_tree ( https:\/\/www.boost.org\/doc\/libs\/1_65_1\/doc\/html\/property_tree.html )","840":"Увидел ту строчку","841":"да это мы обсуждали уже...","842":"а видимо многие только по главной странице синтаксис учить начали","843":"Когда говорят об \"экономике китая\" имеют ввиду именно это","844":"Можно","845":"Или я не в ту репу смотрю ?","846":"есть чувак с годом опьіта, работает \"на отьебись\" - получает соответственно","847":"не уверен, что лямбды в ++ создают контекст сразу в куче","848":"Лол","849":"зачем еесли можно D: \"hello, world\".writeln;","850":"Обычно когда кода много, то особо не сделаешь безупречно, опираясь на костыльную инфраструктуру.","851":"Потому что это запутало бы всех","852":"Я где то не досмотрел, но можно ли очистить консоль средствами стандартной библиотекой?","853":"Это значит что у тебя любое приложение с обычным плюсом — ub ¯\\_(ツ)_\/¯","854":"А ещё в D миксины без костылей с CRTP есть","855":"ну а так да, мы называем это СКАБ — система мониторинга аккумуляторных батарей","856":"Они нужны мягко говоря нечасто","857":"по-хорошему конечно надо пофиксить) чтоб дефолтный параметр юзался)","858":"путь вникуда","859":"считается весь до конца, да","860":"В адресном пространстве приложения","861":"Почему не свести вопрос к \"почему нет?\" Ну типа чем люди хотят тем и занимаются","862":"в рантайме","863":"если `ss` будет меньше `str`, то что было в конце `str` так там и останется","864":"Я сейчас с телефона","865":"ну раз сами хавают то может оно норм?","866":"сделай если есть желание)","867":"надо токо поебаться","868":"и получается ты обрезаешь себе мощь процессора при компиляции","869":"А много ли людей в восторге от asio? Да и asio мягко говоря не vibe.d","870":"ну потести, я хз, я говорю в плане десигна готовый вариант","871":"так что c++ покачто вне конкуренции","872":"~~тогда почему не переименовали питон3~~","873":"как это нет?","874":"Кстати! Указатель в D тоже не требует разыменования) Очень удобно","875":"просто я не пойму что ты пытаешься выяснить: пропагандировать файберы или нет?","876":"потом `export PATH+=:$HOME\/cross\/i586\/bin`","877":"да","878":"https:\/\/t.me\/dlangru\/285810","879":"Так что думаю вы были правы в том, что может быть не совместимо","880":"Для сервисов чтоб на малинке хостить навернон норм","881":"Мне кажеься лусше на форуме єто написать","882":"но!","883":"Ну мне нравятся штуки вроде voxlap, веселья добавляют.","884":"Уже нет, я работу сменил","885":"Нет, не аргументированно","886":"это же интерпретация","887":"Просто хороший GC нужен всем - вот прямо в точку!","888":"есть ещё один нюанс: кортежи нельзя собирать инкрементно","889":"и наоборот у GC остановка мира, а у RC нет","890":"придумат интерфейсы для event loop и дать возможность разных имплементаций","891":"короч я пью водку 365, может дело в этом","892":"Во первых, не все, во вторых, рогалик это больше головоломка, со всеми исходящими выводами. В реальной жизни она мало помогает.\nВ третьих, ты взял рогалик что бы можно было юзать все и всия. А это, как показывает мои наблюдения, большинство игроков не переваривают. Слишком много правил","893":"советую сразу не выпивать, а чуть присахарить еще и по бутылкам\nчисто малиновое на три мес в бутылке оставлял - получалось игристое, женщинам нравится =))","894":"Не делать шаблонную функцию","895":"некая задача\/последовательность инструкций, выполняемая в треде или в файбере","896":"зато без фигурных","897":"Или так да","898":"Юзкейс: загрузил файл сгенерировал код в миксин, выкинул файл ибо не нужен в рантайме","899":"это понятно","900":"Не ну файрфоксе, дискорд, дропбокс","901":"в терминах фп их можно было бы назвать тайпклассами с некоторыми ограничениями","902":"ну да","903":"Видишь у меня какие ошибки ?","904":"Ну, да. Пауки наплели паутятины)","905":"да бляха, еще раз повторяю: порядок вызова ~this не гарантирован","906":"у меня только 17к на бенз уходит(","907":"там втыкай ручное управление, сям втыкай, в итоге только строки и остаются. Накой нужен такой GC?","908":"А беттерC нужен только когда нет минимального рантайма","909":"ну конечно, как плагин","910":"их превью видны","911":"У тебя возникает какая-то потребность в процессе разработки, и ты понимаешь что нужен метод. Вот если эти потребности сесть и продумать перед тем как работать, то получится готовый интерфейс.","912":"или как-то так","913":"какоое?","914":"вопрос то в кодинге. я вот не верю, что нельзя было сделать совместимо с старыми процами","915":"Неужели для вас ява хуже яваскрипта?","916":"Не оч понял\nПишут не подерживается арифметика\nНо есть с++ синтаксис\nТо есть он не полний?","917":"В C\/D\/JS я привык использовать Sublime Text, без всяких плагинов. Мне не проблема по быстрому заглянуть в документацию, когда надо, потому что часто я и так знаю нужные методы.\n\nА вот с C# проблема. Ничего не знаю из стандартных классов, настолько привык использовать автодополнение.\n\nПлохо это или нет, сложно сказать.\n\nХотя, вот с одним разработчиком из соседнего отдела тесно общаемся. Передаёт \"знания по React\" мне. Так вот он использует какую-то IDE для JS. По итогу обычные `indexOf`, `find`, `findIndex` и подобные его путают.","918":"Ну да, особенно программистам на Д с их гц","919":"А в том, что ты с этими итераторами хочешь одновременно что-то вставлять и удалять","920":"и наоборот)","921":"Раст тоже позволяет, разница в том, что у плюсов всё начинается со стандарта языка, который гарантирует только то что ничего не гарантирует и имеет тысячи подводных камней","922":"Не, сделать Range, который по мере необходимости будет читать в массив куски таблицы, скажем, в размере 10 строк,  когда next() подойдет к 11-й строке, читается следующая порция из 10 строк, и так далее, а снаружи его можно будет использовать как обычный Range, со всякими .each!(), .map() и так далее","923":"а другие ждут ввода из каналов","924":"Ну да.","925":"Мне хоть такое и не нравится A a = A{} , но оно самое практичное. Ты его не спутаешь с другими вариантами","926":"это я попробовал переехать на libasync","927":"зачастую, транспайлеры не спасают от боли и унижения, а иногда и добавляют, если в скомпилированном js появляется какая-нибудь заковыристая бага)","928":"Там главное условие, чтобы объект не выходил за скоуп","929":"детский сад, восьмое марта","930":"так смысл писать фремворк с 0 опытом использования этих фреймворков?","931":"Кстати, у меня есть прототип графовой субд на D, но она пока не готова к продакшену: https:\/\/github.com\/nin-jin\/db.d\nИдеологически она близка к LMDB: https:\/\/symas.com\/lmdb\/","932":"неправда","933":"Я и ты. Обсуждение что является работой компилятора, а что — линтера.","934":"не увидел","935":"Не пробовал, могу позже попробовать","936":"стек и куча это еще одни абстракции для криворучек которые не могут нормально вручную управлять памятью.","937":"Не нужно ничего оборачивать, это на то и обобщенное программирование","938":"Я только про Circle слышал) (плюсы с улучшенными метапрограммированием)","939":"Нет. Он всегда только растёт. Причём порциями. Несколько запросов не меняется, потом процентов на 10 растёт и т.д.","940":"Типа, обертка writeln будет работать, а сам stderr нет","941":"Да, вебсокет","942":"Ну бэк вполне может дропнуть по таймлимиту","943":"С этим согласен","944":"Хотя это ещё макет","945":"Это я тебе как дишник говорю))","946":"конеш","947":"а под mmap это уже ОС с буфером разбирается сама.","948":"","949":"Вот корень различий","950":"Не считаем, мы знаем это :)","951":"Проблему вот как решил:\n```  rs = rq.get(\"ftp:\/\/ftp.zakupki.gov.ru\/out\/published\/\");\n  string [] list_of_folders;\n  foreach (line; splitLines(to!string(rs.responseBody)))\n  {\n    if(line.startsWith(`\/`))\n      list_of_folders ~= line;\n  }```","952":"а че ти думаешь что бот","953":"У раста норм с многопотоком?","954":"Ребятки, а тут на маке сидит кто? Кто какой ide пользуется?","955":"В статике оно понятно - там таблица символов","956":"Я на работе на Питоне пишу, дома на D. Иногда на работе жалею, что там не D, но иногда и обратное бывает.","957":"Хорошо","958":"не вижу таковых задач у себя","959":"нуу, все таки у ООП есть так сказать источник — то каким его задумывал Алан и это не чьё то мнение а факт, если в каком то языке ему не соответствует","960":"Хм","961":"у вызывающего и в мапе","962":"да кто бы говорил","963":"можешь сам посмотреть про core.sys.windows кажется","964":"Растовские","965":"сервисный токен это другое, там нету прав на лазанье по стенам","966":"а нет, в вайбе вроде главный цикл асинхронен","967":"челики наверное думают что ето просто часть ника","968":"вопрос как сделать MUD интересным, чтобы он не был тупым гриндом","969":"можно просто зайти к соседу в гости, без его ведома","970":"ничего я не далю","971":"x = (a + x) % k","972":"ебанутым нет покоя","973":"почему?","974":"и в issue кто-то написал что пробовал взять и просто поставить версию 3.9 и уже не собралось","975":"Но лично мне sequence даже не придет в голову в таком случае","976":"и много ревьювит","977":"Ну средние мб","978":"Че за ссылки?","979":"в срезе адрес остаётся прежним","980":"Но можно сделать миксин!","981":"Будет как в шутке про 11 конкурирующих стандартов","982":"В японском есть здоровый пласт звукоподражательных слов. Условно, дон-дон — стучать-барабанить, бари-бари — грызть или рвать, боки-боки — треск, шику-шику — всхлипывать. Их на самом деле очень, очень много, можно полноценно общаться одними звукоподражательными словами.","983":"И тебе придется все переписывать","984":"Чувак, я тебе говорю, мы зумеры в душе не ебем что такое камеди клаб","985":"но другие файлы есть","986":"Забей","987":"если вот только про эти 2 секунды пример.. там 60ая секунда кто-то посчитает это ещё 16 годом)","988":"Посмотри примеры кода для imgui","989":"Тут ребята от биндингов к Obj-C не откажутся :)","990":"Это ты сам себя ограничиваешь","991":"а что за софт, если не секрет?","992":"вообще хуею от программистов именно в том плане что у всех свои требования, которые надо как-то угадать","993":"Я имел ввиду, что короче не всегда понятнее и т.п. Взять Perl, к примеру\nВ общем, сравнивание ЯПов очень субъективная штука","994":"Окей.","995":"В питоне нет","996":"а что считать основным? std или qt?","997":"Не должна она быть одинаковой.","998":"да ну хз) зачем бы им это было нужно? вкорячат линукс внутрь и будут делать \"для линукса\", но вот только работать оно будет исключительно внутри внутри linux for windows subsystem","999":"vla"}}