{"text":{"0":"Yes, and there is a hosting","1":"Add({‘id’: id, ‘items’: listitems, ‘date’ : date}) but date is a datetime on retreive is opposite but date is a json[‘date’].toDate()","2":"Yea,, ve done dat... but how do I get all riders location,,,, how","3":"I'm requesting the date Everytime the app launches to check for expiry of my token, is it a good practice ??","4":"Go to indian group","5":"Guys if I'm using genymotion emulator for react native...does it requires Android studio also to be installed????\n\nFor Ubuntu","6":"Sms application?😅","7":"I have watched some videos and how to create a custom animation but wasn't satisfied with result","8":"permission to ask, sir, is there a sample for making midtrans🙏","9":"Thank you","10":"Can anyone please tell me how to solve this error?\nMany Thanks","11":"Seems special idiots cant read","12":"How often do you rebuild the UI?","13":"[Also this could help](https:\/\/www.google.com\/search?ei=tjpbXqDRCc76qwGox5vIAg&q=android+detect+other+app+launch&oq=android+detect+other+&gs_l=psy-ab.3.1.0i19j0i22i30i19l4.137623.146091..149304...9.0..0.164.4720.1j33......0....1..gws-wiz.....0..0i7i30j0j0i30j0i5i30j0i8i30j0i22i30j0i131j0i67j0i10.5UDEzCR9rG8)","14":"I know 💔\nI spent a lot of time on it","15":"What do you think about using riverpod with DDD clean architecture?","16":"https:\/\/www.youtube.com\/redirect?v=r5p-zhsrKUg&event=video_description&redir_token=QUFFLUhqbGNiN0Q4REk2YlEwV0ZtQ3NiX1dVRGVQUHdnZ3xBQ3Jtc0tsbTNBS3l2Q1MwVGNDMWVNRGxabWRjR2pMaHZ2aG1lVzRzQUpLbHFOXzlWUEtZU3dxdEYxa0VKMnZKUVllRGhtc25SR2hiWUxYSTRNMXpzMzhzRDMySG9KVFJEYjUyYmpfRzZ5OWNkdXFyOUJ3N25QSQ%3D%3D&q=https%3A%2F%2Fmedium.com%2F%40vipinvijayan23%2Fradiobuttons-radiolisttile-in-flutter-dee3013a70b1","17":"Really there are not so much\nProvider, scoped, redux, rx, bloc, mobx","18":"Read about both of them, then choose.","19":"Good afternoon, how to change this white color please?","20":"You mean to say via firebase terminal console.","21":"Allright.\nI actually had install dart in my Debian successfully.\n\nI'll be back, with question, if I have trouble, with other distribution.","22":"I currently using reorderableListView with multi-imagepicker it works but it is having issue when I reorder","23":"results is a list of geocodingresult instances","24":"You didn't even complete the request","25":"❤️","26":"lol","27":"What text? (Textfield text or suggest keywords form list)","28":"Using NeverScrollablePhysics makes scollable with other column widget too","29":"admob","30":"Use provider as dependency injection instead of this way","31":"Its been a while since i used flutter, i forgot how to handle this situation","32":"","33":"log from flutter?","34":"I use a standard VS Code functionality","35":"https:\/\/github.com\/purplenoodlesoop\/stream-bloc","36":"Can anyone suggest free course of dynamic links and deep links in flutter","37":"No","38":"So should i have to make two flutter projects","39":"3k","40":"A renderRepaintBoundary expected a child of type rederbox but received renderslivertoboxadaoter","41":"import 'package:deto\/controllers\/home_controller.dart';\nimport 'package:flutter\/cupertino.dart';\nimport 'package:flutter\/material.dart';\nimport 'package:get\/get.dart';\nimport 'package:google_fonts\/google_fonts.dart';\n\nWidget bottomNavigationButton(BuildContext context,\n    {required BottomNavigatorId btnId, required String title}) {\n  HomeController _homeController = Get.find();\n  bool _hasBeenPressed = false;\n  return Obx(\n    () => Container(\n      width: Get.width \/ 5,\n      margin: const EdgeInsets.all(5),\n      decoration: BoxDecoration(\n          color: _homeController.bottomHomeController.value.value == btnId\n              ? Colors.cyan\n              : Colors.transparent,\n          borderRadius: BorderRadius.circular(2),\n      ),\n      child: TextButton(\n        onPressed: () => _homeController.onPressBottomNavigator(btnId),\n\n\n        child: Text(\n          title,\n          textAlign: TextAlign.center,\n          style: GoogleFonts.getFont(\n            'Unica One',\n            fontSize: Get.width * .025,\n            color: _hasBeenPressed ? Colors.black : Colors.white,\n            letterSpacing: 0.7,\n          ),\n        ),\n      ),\n    ),\n  );\n}\n\nI can't get any further, can you help me with the rest?","42":"Yes","43":"sorry i'm not an english speaker","44":"Mic","45":"oke. so i think u should be use firebase of free ver. And if u app user is increas, free ver. is not enought, maybe u should buy pricing plan.","46":"I tried and failedd","47":"when it is just flutter answers & badges on `flutter dev's resume`","48":"Hope people from Google are reading this","49":"Hi everybody, I'm from Bangladesh. \n\nRecently I'm facing a issue in flutter that is,  I'm unable to pass json data (server) from Future builder to another screen. \n\nI'm tried as usual method......but I'm failed to pass data.","50":"nope","51":"https:\/\/twitter.com\/rodydavis\/status\/1271008619400658944?s=09","52":"hello","53":"Hello Guys, i'm currently working with RSA and EC keys provided by the pointy castle library, for some reasons i need to encode these keys in HEX format, but that classes doesn't provide a method to get the byte array in order to perform the following encoding with `hex.dart` package...Does anyone know how to do this?","54":"may be on the first start","55":"Just imagine the volume of the info and code this guy have to learn","56":"Welcome","57":"Ide","58":"","59":"Why using firestore Or firebase db","60":"I am inserting the data into a database on flutter. As one insertion request already executing then another request taking place. Because both requests having the same data","61":"What better for Fluter?","62":"postman","63":"Yeah bro","64":"Pure math","65":"Can i get a flutter development course for free because i want to learn","66":"Both make sense. You're asking them to merge your code, and to do so they have to pull your code","67":"Good morning guys, please i was following a project  bases tutorial and at some point it was working well but suddenly i started to have this error. i have searched and searched for possible fix but found none.please help","68":"now that provider can access, there is no need for me to put everything into a single class","69":"How can i set width for card of listview ? beacuse here is listtile i cant put it in sizebox","70":"Cool","71":"Ad i have no experience in ios","72":"I cant set fit: boxfit.cover","73":"bad .vmx file probably, Apple using mac's serial number as part of the authorisation process so you need find some faq to proper generate it for vm","74":"green.quantity = n.toString() in the update?","75":"thanks B1gzee, its resolved now. But thx for yours fime","76":"Yes","77":"No i mean do you see this part? That there is a line from the shadow and the white background? I want to get rid of that","78":"textfield2controller.text = \"${double.parse(textfield1controller.text) * 10}\"","79":"And using vpn would decrease the speed and users be kind of forced","80":"Blurred LoL","81":"Pls guys am having a problem running my first flutter up in android studio","82":"Yep ???","83":"and routing without context","84":"Im running 5 counter timers on a screen. When I click start button all clock will start running. But there is 1 second delay between timers. How to solve this? I'm using listview. Builder to create timers","85":"Gradle is a automation tool for building apps with multi language software development support","86":"Codemagic.io","87":"What is innderlndex ?","88":"I got it.","89":"Try move down Metadata into application instead activity","90":"👍🏻","91":"I have a problem doing a post request with flutter","92":"Python","93":"thats not what i want\nthere must be better solution","94":"what are you working on?","95":"Uncle Bob = Robert C. Martin. I would suggest anybody to read his books","96":"Ok then","97":"I got this method in a different dart file and I want to call for it in another dart file, how do I go about it please","98":"your problem is that you are trying to do this without any state management. of course you will have errors when changing the state of the list","99":"Hi all, could anyone please say on how to display 2 infinitely large data in 2 listviews in a single screen along vertical direction?","100":"eg does it do multiple passes of its heirarchy or does it simply do a single pass, passing everything it encounters to skia for it to figure out\n\nfor example, if the size of a widget depends on the size of another widget would it need to compute that widget's size before computing its parent widget's size, and so on for each child\n\nbefore it can start drawing the entire heirarchy","101":"I don't know what logic the functions carry out","102":"Hey there Abel, and welcome to Dart \/ Flutter! How are you?","103":"Okay i will try","104":"Hi I've issue while opening a new flutter project, I've installed flutter,dart plugin... And I've restarted the android studio, even though I'm unable to see flutter SDK path...","105":"you mean native code?","106":"The problem is that you send the response from the backend, it works and ok, but free hosting ads some java script code in the response and you have to remove this","107":"right now is: `{user: 34, survey: 1, answers: [{statement: Şu an kemoterapi tedavisi alıyor musunuz?, answer: Doğru}, {statement: Kaç kür kematerapi aldınız?, answer: 3,2}, {statement: Kanser tanısını ilk defa mı aldınız?, answer: Yanlış}], iteration: 1}`","108":"Help me please","109":"I think You should create a single table with chatId senderId receiverId bro.","110":"","111":"So what ?","112":"But in the list view the not focused on the center","113":"any ideas??","114":"now I'm facing this problem","115":"man, everything is easy when you know it","116":"","117":"As i remember it was made when flutter was still beta and things like search delegates was as a some kind of todo","118":"how to host flutter web in release mode","119":"yes my api is in the provider,which  seem to return the values I wanted it .","120":"","121":"It's very cool","122":"Yes, by adhoc you can transfer app from the folder of the mac the connected iphone","123":"This is it.","124":"Ok, what I want to do is a on application start user to be authorized with Google sign in.\nOn the first start he will to be authorized with his default account or Google auth will display the dialog with the lists of accounts installed on the phone.\nTill now I have realized this dialog on application start. But if I tap out of the dialog i'm getting blank screen. (Things are getting from the samples that have sign-in button).\nAt finally I want if user taps out of the dialog he to be displayed again till his authorization.","125":"yeah man, was somewhere else, now back","126":"btw I will appreciate if you share this group's link in your groups, just to have a central international group","127":"try reinstall and restart the ide","128":"Stack where second widget is position bottomleft column of colorfiltered for the left curve, row with the rounded box for middle curve and again first widget for the bottom curve\n\nCurves can be done as clipped rectangle of the color filtered - google for the widget with the hole","129":"When I put newly fetched  data then previous one goes and grid count remains only 20","130":"I have a list and my response should be... Something = 1,2 not something = [1,2].... How to do that","131":"App gets open if it is running in background and i click the notification but when i remove the app from recent apps and if i receive the notification.\nwhen i tap on it then it just disappears but never open the app.","132":"and then playrowlist[index]","133":"change the name of image to dua.jpg instead of dua.JPG","134":"Yes u need media queries then","135":"Hello every one i have some probleme please help me ``` Constantes.configApp!.productTypes\n                                        .firstWhere((el) => el.text == 'hello')\n                                        .toString(),```","136":"","137":"Users can change their date or time the phone uses","138":"","139":"Whatever you know","140":"Hey Please Help Me how to Download Dart\/ Flutter on Windows subsystem Linux Ubuntu 22.04","141":"Hello everyone,\n\nI have got this error during development. Can anyone   help me to solve this ?\n\nScreenshot URL: https:\/\/gifyu.com\/image\/mOMX","142":"usually backend first than go frontend","143":"Wrong group man","144":"Hey guys.\nI'm new here and new to flutter too..\nCan anyone tell me how cam I create a single layout and make it differently from others by passing on values?","145":"Hey\n\nHow to make a Null  RxInt obs?\nGetX","146":"Then? In expanded function","147":"Try to comment inside the onPressed code, just pass null","148":"Anyone worked on SearchDelegate with firestore I need help","149":"in side column create three expanded each with container","150":"But will you help me?","151":"you can create whatever your heart desires","152":"But you omit the username information that I want to use in my App","153":"True but I guess you could have mentioned that he can use plugins from Flutter side(most are incomplete),\n\nOr write his own wrapper\/Implementation as a Flutter plugin (will require Java and even Swift knowledge including Platform API know-how)","154":"no","155":"Some bro can explain for me :'(","156":"حصن","157":"But how??","158":"Request with cookie? Plz help","159":"Can flutter and rive handle 15000 animations in an app?\ndoes anyone understand this question??","160":"After initialization I want some default data to be added","161":"I know but is there any tool which is currently available?\nAdobe will take many months before they can release that tool.","162":"freezed, hook,riverpod, rive, bloc.....+....","163":"Apart from xcode is possible or not... in vscode?","164":"Yes try hot restart otherwise try closing and build it again","165":"Thank you","166":"How did you seen that message is not received by the app on terminated state?","167":"Hey there Nwani, and welcome to Dart \/ Flutter! How are you?","168":"and this is generated code. please guide me why there us error in generated code","169":"Check the official docs for the adaptive layout","170":"Is there any specific widget?","171":"Dropdown list widget","172":"Show then. What error message you got.","173":"[@CodeWithArman](tg:\/\/user?id=131886041) [`131886041`] warned (1 of 3).\n**Due to**: link to the source is mandatory","174":"pretty great solution","175":"That’s much better.. thank you!!","176":"Is this Telegram the most active place?  I also saw Slack and Discord channels listed for Flutter Devs...","177":"Please I need resources on using soap api in flutter","178":"Container","179":"That doesn't work only in release mode","180":"Um...","181":"That should do it","182":"Hey there Shiry, and welcome to Dart \/ Flutter! How are you?","183":"Coool?","184":"How I can change this icon ?","185":"Text is not adjusting how to fix please","186":"you may want notched-shape navbar","187":"can anyone help for ios ?? if its feasible or not and is its feasible thn how can i implement.. guideline will be appreciated ..","188":"thanks man","189":"you cant","190":"Realse.apk installed same output","191":"but no data return to me","192":"Guys how to show the api response in pop up menu while clicking the icon button","193":"Greetings everyone. I am using getx. I have the user do some operations on the bottomsheet, but when the operation is completed, the bottomsheet is not updated. For example, it selects a date, but the date does not change. When the bottomsheet is closed and opened, it gets the selected date. Can anyone help with this?","194":"You getting user account id and save him","195":"and how to implement it in your flutter code","196":"what is MyApp?","197":"yes , `final result = response.body`","198":"Dollar😳","199":"Appreciable idea.👍","200":"So you can manipulate state over current context changing widgets presentation","201":"Nope","202":"because in local its the a Same-Origin requests and they usually should be protected, will on production its Cross-Origin and they can be really dangerous for the server if allowed","203":"Error says: The argument type 'Function' can't be assigned to the parameter type 'void Function()?'.","204":"Arch","205":"where you download IDE's extension","206":"is the exactly same thing","207":"I am little confused what to learn first reactnative or flutter please help","208":"@flutterDev channrl is currently has 666 members. That is so evil.","209":"Like ??? Check on other packages u will find","210":"Anyone know any package that supports this type ui with header sorted tag as it is displayed 'A'\n\nWith null safety","211":"Hi guys, i have a gesture detector with a container inside, but doesn't work, how can i fix?  \n\n`GestureDetector(\n        behavior: HitTestBehavior.translucent,\n        onHorizontalDragEnd: (details) {\n          if (details.velocity.pixelsPerSecond.dx > 80) {\n            setState(() {\n              _giorno = _giorno.subtract(Duration(days: 1));\n              reset = !reset;\n            });\n          }\n          if (details.velocity.pixelsPerSecond.dx < -80) {\n            setState(() {\n              _giorno = _giorno.add(Duration(days: 1));\n              reset = !reset;\n            });\n          }\n        },\n        child: _grid(context),\n      ),`","212":"nice way","213":"Why?","214":"Thanks.","215":".","216":"","217":"https:\/\/t.me\/dartlang_group\/204461","218":"what i made wrong??","219":"Coz then.. The wallet will stay unlocked.. Even the next time they open the app. The wallet will be found unlocked.","220":"But we were like 2 members","221":"Any idea how to do this?","222":"flutter is giving me this error even though i have override the build method...","223":"Try flutter upgrade first","224":"I'm create new file  ager dealer input then is error show","225":"1st screen","226":"Can anyone give me a link of the tutorial for Dart language learning?","227":"I got this error","228":"Is there a reason why my message keeps getting deleted?","229":"inside the first folder there is only the second folder, nothing else.","230":"Show me code of another widget\nOn which u trying to navigate","231":"If I'd create a to do app","232":"Sorry","233":"official channel:\nhttps:\/\/www.youtube.com\/channel\/UC2d0BYlqQCdF9lJfydl_02Q","234":"I mean i coudl construct it outside","235":"Someone knows what can i do? Ive already tried flutter clean","236":"and the the gradle would start updating","237":"any one can help 😢","238":"GM friends. I Am looking for flutter developers who have work experience with web\/android\/iOS development. Anybody interested plz msg me in person.","239":"welcome to the wonderfull world of computers","240":"Yes","241":"Yes.first dart.","242":"Hi guys, I have question about infinite scroll.\n\nI search about it and almost all tutorials say same thing.\n\nYou have a list of items ,\nfirst request to server and get some items and put them into list,and when user scroll to the end request again and get some items and add it to list.\n\nIt's simple but what if we have a really big number of items?\nfor example 100,000 \n\ndoes this way make memory problems for us?","243":"when I use conditionally importing in mobile like this:\n```import '..\/Tools\/PlatformAPI\/Default.dart'\n    \/\/ ignore: uri_does_not_exist\n    if (dart.library.html) '..\/Tools\/PlatformAPI\/WebAPI.dart'\n    \/\/ ignore: uri_does_not_exist\n    if (dart.library.io) '..\/Tools\/PlatformAPI\/\/MobileAPI.dart';```\nwhen I Build the project for mobile, It also failed. the reson is that cannot use web api in mobile.\nwhy conditionally importing doest not become effective","244":"","245":"No, google search limits are over for today","246":"Where I can do this","247":"Learning how to write backend with php might help if your business data will expend","248":"Can anyone tell me what's error in between line 42 to line 48","249":"@masoud_dev","250":"I hope someones looking at the code","251":"Where your from k?","252":"What tshirts .. What credits? 🤔","253":"* What went wrong:\nExecution failed for task ':app:compileFlutterBuildDebugX86'.","254":"It works as an apk but when I put the flutter build appbundle in terminal this is a problem","255":"Os?","256":"Do you know dart basic??","257":"What problem with tou","258":"I want to force all users to download my own player and open all content in my app on my own player","259":"Additionally plugin has no documentation for how to write command and what are the functionalities","260":"Haha, nevermind","261":"","262":"[++BHAUMIK++](tg:\/\/user?id=606212442) void main() {\n  final String name = 'Bhaumik jadav';\n  List<String> alphabets = name.split('').toList();\n  List<int> indexes = [];\n  for(int i = 0; i < alphabets.length; i++) {\n    if(alphabets[i] == 'a') indexes.add(i);\n  }\n  \n  for(int index in indexes) {\n    \/\/ Print before\n    if(index != 0 && index <= alphabets.length - 1)\n     print(name[index - 1]);\n    \/\/ Print after\n    if(index != alphabets.length - 1)\n      print(name[index + 1]);\n  }\n}","263":"Did you adked leetcode devs why this happens?","264":"Loke BLoC, or Redux, MobX... U can choose some...","265":"may be the same https:\/\/github.com\/flutter\/flutter\/issues\/20416","266":"I have done this","267":"Can you use pastebin? Sending photos is forbidden","268":"Guys I want urgent help \nCan u ???","269":"","270":"And also how can I move that search icon up","271":"No, there is no problem in the debug version and it comes easily\nBut when I take the Android output from the project and install it on the real phone, the photos are not loaded","272":"So I don't even lnow where to start from","273":"Hello\n How use this in dropdown menu\nPlease  help  me.","274":"Help please","275":"Please how can I create a group by gridview?","276":"Any one get this message today?","277":"Maybe you need to add the key of the API in the URL strinf","278":"declar the number for the input of keyboard, is it right or wrong?","279":"","280":"I had a problem like that before, and I  couldn't run my app later. \nI had to remove the graddle folder then run the app again, then graddle downloaded successfully and I could run my app without any problem.","281":"And some other basics","282":"You should use a versioning system like git instead","283":"Response in the app generate empty container or like this","284":"Hey all can someone help me with oauth2 here ?","285":"[Manu](tg:\/\/user?id=983883798) [`983883798`] warned (1 of 3).\n**Due to**: english please","286":"My doubt is how to tell to the rest api that i am successfully logged without security issues","287":"So the deal is is a to use distributed counters - they are not realtime, or do fixes on db select","288":"I'm new to the iOs side. I don't even know where to begin","289":"it s stringify JSON？","290":"please i need help","291":"We should let me speak. What are his requirements 😅","292":"it will be based on response","293":"Followers are subscribes for the topic and you send push to the topic","294":"Hi folks. i wanted to use CustomPaint to create a shape...\n\nis it a tool available for this online?(i don't want to get stuck into CustomPaint widget.)","295":"User [آسمان آبی](tg:\/\/user?id=1152209418) has 1\/3 warnings; be careful!\n**Reason:**\nonly english","296":"Ahh cool","297":"i can write russian if u want or poland","298":"read the Suggestion","299":"I solve it sorry","300":"Hi guys... I need one help...","301":"Make one function for onTap and inside it check conditions","302":"How can I remove ?","303":"ViewModel and stuffs","304":"Have similar state update troubles at one app","305":"Yes i used the package","306":"Hello\nI have a question\nI need to get current location from every user in application and I want to know when I deploy application into google play google accept my application?","307":"try using keys","308":"","309":"It was working fine. Suddenly, it's giving this above exception","310":"Can u share which data u trying to wrap","311":"Hello,\nI need flutter code to be compiled for iOS but I don't have Mac. Can someone do it for me. I will pay . Also we need to upload on app store","312":"Happens with me too","313":"fromJson maps response data to the model class, toJson - doing json from the model data","314":"Their is any area graph package available with support x asix have string valu","315":"How to increase spacing between the lable text and input text in a Form field. I tried to use content padding, but not working correctly.","316":"With water effect","317":"Function works on backend automatically, but from front should be in transaction against some fail","318":"https:\/\/stackoverflow.com\/q\/55453856\/8894198\n\nHelp please","319":"Hi","320":"","321":"Hey all\nSuppose my app is using an external package.\nWhat will happen in case when the package is removed by its creator and my app is still using that package?","322":"I need periodically make an api call, sending data about steps that I made","323":"btw, that's my first blogpost, please share your thoughts about it 🙏","324":"Auth is different","325":"But when I use edge there is no problem, what could be the reason?","326":"Yes I use multiple GlobalKeys","327":"i alredy apply in android \/app folder give path also","328":"Null safety.","329":"Search for alt codes.","330":"Hey there Gohil, and welcome to Dart \/ Flutter! How are you?","331":"Article on Remote Config in Flutter : https:\/\/medium.com\/martinoyovo\/flutter-firebase-remote-config-14c7bab0d0e4","332":"How do I handle orders","333":"Any suggestion ?","334":"From standard basics - inherited widget","335":"It's just a Row with an Icon and a Text","336":"When I'm connected my custom domain to firebase. It is showing grey screen in flutter web app.\n\non the default domain. it is working well. any idea?","337":"Hello guy,.. i have a small problem... Im using a contractor to pass document details from one page to another... The page that is receiving data has multiple widgets .. HOW CAN I PASS THE DOCUMENT DATA TO ALL THE WIDGETS That are in the receiving page?? ... I have manged to pass data to just one widgets","338":"Might be would be nice idea to chech selected color lightness and with this color your things lighten or darken.","339":"I don't like to start learning from videos","340":"How can i find an online tutor for flutter ?","341":"Ok bro..","342":"","343":"you mean the PHYSICAL BUTTON only on ios because everything works fine on android?","344":"U running flutter build apk\nRight?","345":"Maybe some of your package is using location.","346":"Yes that's possible, and you should be taking a look at android developer portal","347":"🤔 don't know.","348":"Provider v4","349":"There is a property you declare and use to set state.","350":"i want to add .00 for number if doesn't have Decimal number then convert to string How?\ni just want to show price but not Integer i want to add .00 if Integer","351":"Looking for an expert flutter 5$ per hour inbox me.","352":"Docs are enough","353":"maybe he though he had to send the apk to Kamala Harris ?","354":"Nfc","355":"To manage your data from outside","356":"only english","357":"I did.not work buddy","358":"And current version of flutter is 3.7.7\nDart\n2.19.4\n\n\nSo it can still help with 98% of issues you have on flutter\n\nUnless you are trying to implement new stuffs from the current version","359":"Caused by: java.lang.UnsatisfiedLinkError: dalvik.system.PathClassLoader[DexPathList[[zip file \"\/data\/app\/com.binarybite.syncbeat-HDew16Q8MKZ8Z7GGjSNQKQ==\/base.apk\"],nativeLibraryDirectories=[\/data\/app\/com.binarybite.syncbeat-HDew16Q8MKZ8Z7GGjSNQKQ==\/lib\/arm, \/data\/app\/com.binarybite.syncbeat-HDew16Q8MKZ8Z7GGjSNQKQ==\/base.apk!\/lib\/armeabi-v7a, \/system\/lib, \/system\/product\/lib]]] couldn't find \"libmobileffmpeg.so\"","360":"Refrer to null safety Type string? Can be null but string can not","361":"I have donwnloaded cradle from gradle site and have added bin to path , ran on cmd and it was recognize and I changed the gradle path on android studio to the one I downloaded to see if it will work but it was still giving the same error","362":"Hi 👋","363":"Hey there Osama Mahmoud, and welcome to Dart \/ Flutter! How are you?","364":"Ok sure Guys . Thank You Very Much ❣️","365":"http.post and my api url?","366":"for flutter project","367":"i can not","368":"I asked regarding json data show in the app","369":"how do you ivoke this picker?","370":"Hello team, \n\nHow can we schedule firebase push notification and receive notification when app was killed from background and its possible to schedule push notification from frontend side ?","371":"","372":"What could be the solution  any help will be greatly appreciated Thank you in advance","373":"","374":"Like in a chat app, on the chat page. Real time firestore pagination","375":"basically anytime you want the widget to not depend just on its inputs, and you want it to hold its own personal memory","376":"how to rename","377":"Hi guys. Right now I have Pixel 2 Emulator installed, but I need a bigger screen size. Is it a good idea to install Pixel 3 ? Which emulator will you guys install for a bigger screen size for phone ?","378":"I mean without days","379":"Check the tutorial","380":"B patient","381":"Hello. I'm trying to run code when the app is not opened how can I? I try background service but that not resolve my problem","382":"In my app i have some list","383":"Ok","384":"So when you paste use this static font which you added font in pubspec.ymal","385":"not related => flutter\/dart","386":"Yes","387":"items!.length","388":"If I use StreamBuilder, for a Firebase collection, I'm wondering if everytime there's new\/changed data, does that count as. another read\/ write, \nfor example, if I would delte a document, does that count as one write for firebase?","389":"My problem is: flutter pub get never finishes ,not showing that I have issue and not finishing successfully, and in my main.dart file there 50 errors in code,but should not be like this ,because this is starting code of new project and  I didn't change anything ,","390":"has anyone worked with Sms autofill?","391":"Can anyone help in working with zefyr package in flutter for text editor I want to include it to my project","392":"How do i get something like this?","393":"Why zip file?","394":"https:\/\/del.dog\/laluparaxe","395":"Simple bloc or rxdart","396":"How to ask persion for notification , which code for add in androidmanifast.xml","397":"😅😅","398":"how to solve this.","399":"`Report sent`[⁣](tg:\/\/user?id=370663289)[⁣](tg:\/\/user?id=834091916)[⁣](tg:\/\/user?id=71744958)[⁣](tg:\/\/user?id=77816816)[⁣](tg:\/\/user?id=334936252)","400":"And if I had a filter search connected with an api? On search filter should I also change the store articles list right or create another one?🤔","401":"^^","402":"Not root user, from the project root. I dont remember things about flutter installation on linux, was years ago. You need to add path to the .bashrc or what it was to setup enviroment and flutter to have a permissions to write under your account","403":"well if I need to do email manipulation then maybe","404":"Why Google CDN isn’t good?","405":"Yes or on-field submitted","406":"You have to playrowlist.length","407":"thanks, i'll take a look","408":"Hi","409":"Then how cloud said that statement","410":"yes, I know flutter","411":"https:\/\/dart.dev\/guides\/language\/language-tour#parameters","412":"i resolved applying colors.trasparent to tooltip text color and color in a theme data widget","413":"u have to get sha1??","414":"https:\/\/medium.com\/flutter\/whats-new-in-flutter-3-8c74a5bc32d0","415":"It's in body","416":"Okay Stack widget is just like relative layout in Android Native","417":"tf","418":"how to can do this","419":"phone verification is not helping","420":"Ah dialogues aren't rebuilt like that","421":"Latest one with the layest version of flutter","422":"Well you can pass to the constructor.","423":"\/warn only english","424":"Hey, I have a Draggable which I drag into a timeline (drag target) but I am not able to track where the widget is dropped. I want to extract the time from the timeline where it is dropped but there seems to be no relation between the timeline and the dropped widget","425":"By the way if you wanna share i would love to know about the idea","426":"","427":"is there an automatic tool to migrate  a legacy project that isnt NULL Safety . I currently using dart 3.0 hence can't use the command `dart migrate`","428":"webdev serve web:8082","429":"Kyu ki agr string mai ni convert krta toh dynamic error de deta jai","430":"Might be google services version error in android\/build.gradle or you haven't updated you Sha-1 key in your project","431":"Mine is postgres 50 m records is at home pc with the 40mb connection and i5 with 16 ram","432":"this is the error","433":"It's not a ide's fault","434":"Here an advice. Don't use packages. Write it your self","435":"Yes solved","436":"make the row to column ?","437":"Anyways.\n\n\n\nClick on start and search the term \"environment\"","438":"Hey there Dan, and welcome to Dart \/ Flutter! How are you?","439":"What I want to know is if an application made for Android with Flutter works in LineageOS.","440":"Thanks for your assistance👍","441":"It should be avoided at all costs? :P","442":"Is anyone here already work on a AR project with Dart and Flutter ?","443":"how can i make my app bar to centre","444":"Ohk","445":"can anyone say why i am getting late initialization error","446":"this is the api","447":"Images , name","448":"yes yes, in debug mode I can write and read but when I generate an apk to use it as if I had published it on playstore I can't do it","449":"How do I fix please. I'm working with fire store cloud","450":"you want to make it `static` instead of getter","451":"Hey there Judith, and welcome to Dart \/ Flutter! How are you?","452":"#Help me pls","453":"I guess we all are here to help each other not to question on someones question.","454":"english please","455":"[@sivaram16](tg:\/\/user?id=549482788) [`549482788`] warned (1 of 3).\n**Due to**: link to the source is mandatory","456":"```TextField(\n            style: new TextStyle(color: Colors.white),\n            decoration: InputDecoration(\n              prefixIcon: Image.asset('assets\/images\/profile.png'),\n              hintText: Strings.whatIsYourName,\n              hintStyle: TextStyle(color: Colors.white),\n              helperStyle: TextStyle(color: Colors.white),\n              enabledBorder: const OutlineInputBorder(\n                borderSide: const BorderSide(color: Colors.white, width: 0.5),\n                borderRadius: const BorderRadius.all(Radius.circular(10.0)),\n              ),\n              border: const OutlineInputBorder(\n                borderRadius: const BorderRadius.all(Radius.circular(10.0)),\n              ),),),```","457":"i want to set my var stringBundle to my Model class. How to set? any help?","458":"thats app","459":"Thank you for answering 🙂\nWould you please explain more about restore the path back? I clicked but I didn't understand it!","460":"Use it","461":"Which honestly survive ... far too long","462":"@Liverpool_ballboy \nIt is imported by __import __`'package:flutter\/services.dart';`","463":"or maybe find flutter openings and not android openings","464":"`Report sent`[⁣](tg:\/\/user?id=370663289)[⁣](tg:\/\/user?id=834091916)[⁣](tg:\/\/user?id=71744958)[⁣](tg:\/\/user?id=77816816)[⁣](tg:\/\/user?id=334936252)","465":"Yeah😂","466":"i have made the images into list","467":"Standard behaviour, on refresh you restart the app, for the web use url strategy and named routing","468":"Firebase","469":"use expanded","470":"Where are you putting it?","471":"https:\/\/docs.google.com\/document\/u\/0\/d\/1in3T9wY3BDT6Kb-2Bq9YM1K-QhKOqvqhfmMWUoDrg6o\/mobilebasic\n\n\n\nAnyone tried this????","472":"Think to add kind of counter to the bot that counts gradle settings error","473":"Actually i have zero knowledge in flutter testing but i need to complete this task today itself.","474":"Oi Pessoal!                                                                                                                                                                                                            Estou buscando para um cliente dos EUA:\nVaga remota, pagamento em dólar.\nDesenvolvedor Flutter\/Dart com experiência em escrever no flutter para Windows.\n\nExperiência mínima de 3+ em Flutter \/Dart e 2+ com Windows OS (Windows 10\/11IoT Enterprise.)\n\nContato: +55 22 99105-4447\ncommercialtechrecruiter@gmail.com","475":"Sad.. not possible without cc","476":"","477":"https:\/\/firebase.google.com\/docs\/cloud-messaging\/send-message#send_using_the_fcm_legacy_http_api","478":"amazon had losses for 10 years and the CEO still became Billionaire","479":"Are u using Agora SDK or another tool?","480":"void main() {\n  String utcDate = '2022-11-14T11:38:05.0218088';\n  DateTime parsedDate = DateTime.parse(utcDate);\n  String formattedDate = \"${parsedDate.day} ${_getMonthAbbreviation(parsedDate.month)} ${parsedDate.year}\";\n  print(formattedDate); \/\/ Output: 14 Nov 2022\n}\n\nString _getMonthAbbreviation(int monthNumber) {\n  switch (monthNumber) {\n    case 1:\n      return 'Jan';\n    case 2:\n      return 'Feb';\n    case 3:\n      return 'Mar';\n    case 4:\n      return 'Apr';\n    case 5:\n      return 'May';\n    case 6:\n      return 'Jun';\n    case 7:\n      return 'Jul';\n    case 8:\n      return 'Aug';\n    case 9:\n      return 'Sep';\n    case 10:\n      return 'Oct';\n    case 11:\n      return 'Nov';\n    case 12:\n      return 'Dec';\n    default:\n      return '';\n  }\n}","481":"Buh it’s a drawer.. why would you want to change background color","482":"Don't forget your safe area as well","483":"Help me.... please","484":"is anyone having this issue?","485":"And what do you want?","486":"Bor","487":"data is a list of maps","488":"Hi guys, I need some help.. I upgraded Android Studio yesterday and I see lots of errors in my code","489":"Ok i will try.","490":"Yeah without api","491":"is the Text Type","492":"@Belokotov We wanted to make a webpage where you can drag and drop several flutter elements (buttons, text ecc), generate a qr code, then from the app you scan the qr code and the app downloads the layout from the web and displays it in AR","493":"But I need to play audio file","494":"","495":"I just install it","496":"Ok thanks","497":"Okay thanks; compared to BloC which do you prefer and why?","498":"https:\/\/youtu.be\/cRt43pTVZ84","499":"Hello ! I have a quick question on deploying flutter web project to GitHub pages.\n\nI followed the official doc on how to build a release \n“flutter build web -release”\n\nAnd then copy the build\/web contents to the root of the GitHub repo\n\nEnabled GitHub pages \n\nAnd run the app through the given url\n\nBut it just failed with some of the following\n\n“Uncaught (in promise) TypeError: ServiceWorker script at https:\/\/xxxxxxx\/flutter_service_worker.js?v=579402277 for scope https:\/\/xxxxx\/ encountered an error during installation.”\n\nAnd \n\n“Failed to load app from service worker. Falling back to plain <script> tag”\n\nAnd. \n\n“Loading failed for the <script> with source “https:\/\/xxxx\/main.dart.js”","500":"Hi, how to use two blocStates in Blocbuilder?\nI have data coming from two different blocs, after getting data from both i want to send to the third bloc ,also want to listen data from both blocs, like i have 3 different apis, anyone knows","501":"Hello \nLooking for Flutter Developer to work on Incomplete project of Shopify website with Flux Store.\nIf anyone can help pls DM via whatsapp 9375186540","502":"nope it was giving that kinda error even before adding hero","503":"Colors","504":"I need location and daily cost","505":"For move and explicit ops I am not sure Dart supports them at the moment. But Dart doesn't compile to Java","506":"depends from the auth version","507":"Only bashrc","508":"Ok. At least tell me","509":"Hey now it looks this way..","510":"So if var is actually an empty string that would return true, if it's an Int32 it will always be false","511":"Yes","512":"this my login data","513":"sending variable by link sometimes can produce a spaghetti code, I preffer stream patterns","514":"in which line","515":"Okay but what's the purpose of the string inside text:(\"\");  ?","516":"Which code extension should I use so that my codes looks more nice.....","517":"what is the parent widget?","518":"what dropshadows did u mean?","519":"when mqtt received new data , stream builder works and repaint google maps","520":"Hello all , i am facing a strange issue.\nKindly look into this please.\nI have installed my app in phone.And when I open it from launcher it says app not installed.And when I open the app from app settings then it gets opened.\nPlease offer help , i am stucked .","521":"Everyone here works on Android Native","522":"Yes","523":"Dartpad seems fine but not flutter.dev","524":"I thought there was a special button and I didn't understand the last word of it","525":"obviously u have to do it in the rest of the model","526":"Started emulators","527":"http:\/\/roi-graphx-liquify-dog.surge.sh","528":"admin.auth().updateUser(uid, {email: NEW_EMAIL})","529":"Does anyone know a way to run Dart code after a reboot?","530":"Thanks Hakaishin","531":"https:\/\/t.me\/dartlang_group\/190460","532":"Somewhere from the dart interals","533":"I want to have virtual emulator but when im trying to install it, this error is coming up","534":"And how can I use it know?","535":"ok","536":"or u can also use \"as\" keyword in import","537":"So that we don't need to share link manually everytime","538":"like a tab in a container with a column as its parent widget???\nIs that what you want","539":"In list view builder there is one component called padding in padding give edge insert zero","540":"Hello everyone, do you have an idea how to put border radius on flutter_google_maps please ? Thanks","541":"i need the possibilitiy to allow only 1 image","542":"BTW, did someone noticied about +5 MB in the app size on release after update to the new version?","543":"As i remember init and read was async","544":"Guys anyone...If u have a book just tell me...if you know any YouTube channel just tell me the name of it....","545":"But you are not using flutter😁","546":"yo","547":"Wave - no such symbol on mobile keyboard","548":"yeh, was just looking for other alternatives if there were. thanks for confirming 👌","549":"","550":"Stateless","551":"😂😂","552":"plz share ur app to me","553":"https:\/\/silicon-intelligence.blogspot.com\/2023\/09\/understanding-levels-of-artificial.html","554":"i have this problem","555":"How to do it using Querysnapshot","556":"It's literally IntelliJ but made for Android","557":"is the flutter docs website available for offline...","558":"Sorry\nI mean cd to your root where pubspec.yaml lays in","559":"Hey there Альбина, and welcome to Dart \/ Flutter! How are you?","560":"wait a minute sir, I'm still debugging","561":"İ have question about bloc, I have a method called blocreload and I am using to refresh the bloc in some page, but If I want to go back to old page there is an old state there, actually bloc is not working like consumer provider","562":"Change from icons.restaurant to icon","563":"https:\/\/pastebin.com\/buS8b8B5, i tryed to do this but i’m sure about the fact that i did something wrong","564":"oh got it , seems my day is dizzy","565":"Why two dots are used ? \nI implemented it using some example from google","566":"Probably both the machines may need same release certificate of the key. Check this (https:\/\/developers.google.com\/android\/guides\/client-auth). Here they have explained about exporting client auths","567":"Btw, the smart solution is a not to record whatever comes from the devices and generate a big traffic, but when changed from the previous value by some limits","568":"so rather than doing it i can write var abc= require(\".\/xip...\")","569":"thanks🌹","570":"ADB.exe is obsolete and has serious performance problems - Stack Overflow\nhttps:\/\/stackoverflow.com\/questions\/51240223\/adb-exe-is-obsolete-and-has-serious-performance-problems","571":"Fırst money great motivation","572":"Why?","573":"2 M in Indonesian is “Makasih Mas” which mean —> “Thanks my friend”… \na lot of project here in Indonesia cost 2M…. 😆","574":"You didn't google about it","575":"This is very tricky,  are you trying to refresh the whole ui?","576":"actually i searched about it they said no decryption of md5 but when i try  encrypted string in one site it decrypt","577":"Okok*","578":"In both ways you pass the doc id, not the object and you have to call on initstate to get the doc","579":"Good evening everyone, I hope I didn't disturb you.\n I have one small question.\n I recently ran into a problem here and now I do not understand what to do right now.\n\n Right now I’m ceating one social network and there, for example, we have our wall of posts, then through some post I can go to the profile of some person and there, as usual, there are subscription subscribers and also the wall of posts of this user.  So, for example, being in this profile screen by clicking on a like or creating a comment or subscribing, I have the state of this screen, everything is logical by this time, but I ran into such a problem that the screens that were before this profile screen did not change their state and that’s where it occurs  illogicality, since in one screen in which we have done something right now, the state has changed as soon as this screen is closed on the previous ones, everything remains as it was.  I tried a lot of things to transfer Bloc to the screen and change it there, but everything is not right, since changing the state somewhere, you need to change it on all screens.\n\n No idea how this can be solved?  I thought what if I make the data reactive, like in firebase, but I don’t know how good this idea is.","580":"","581":"Try this :\nAfter you update something in firestore then restart your app","582":"hi my app doesnt work in ios here is my error output \nXcode's output:\n↳\n    \/Users\/mac\/flutter\/.pub-cache\/hosted\/pub.dartlang.org\/image_picker-0.6.7+4\/ios\/Classes\/FLTImagePickerPlugin.m:149:20: warning: 'UIAlertView' is deprecated: first deprecated in iOS 9.0 - UIAlertView is deprecated. Use UIAlertController with a preferredStyle of UIAlertControllerStyleAlert instead [-Wdeprecated-declarations]\n        [[[UIAlertView alloc] initWithTitle:@\"Error\"\n                       ^\n    In module 'UIKit' imported from \/Users\/mac\/AndroidStudioProjects\/giby_customer\/ios\/Pods\/Target Support Files\/image_picker\/image_picker-prefix.pch:2:\n    \/Applications\/Xcode.app\/Contents\/Developer\/Platforms\/iPhoneSimulator.platform\/Developer\/SDKs\/iPhoneSimulator13.2.sdk\/System\/Library\/Frameworks\/UIKit.framework\/Headers\/UIAlertView.h:27:12: note: 'UIAlertView' has been explicitly marked deprecated here\n    @interface UIAlertView : UIView\n               ^\n    1 warning generated.\n    1 error generated.\n    note: Using new build system\n    note: Planning build\n    note: Constructing build description\n\nCould not build the application for the simulator.\nError launching application on iPhone 11 Pro Max.","583":"How to convert a network image to File type??","584":"List is similar","585":"I Have Open Jdk 11.","586":"+ ✊","587":"And u get delta times on when each event is fired","588":"The context of your current build method. \n\nMediaQuery.of(context)","589":"If you are using this as the url:  url: git@github.com:Account\/your_repo.git\nand you are using ssh for authentication, I don't know where the problem might be. I use it for my private apps and works perfectly\nCan you share the error?","590":"no, i have pornhub","591":"are you try AspectRatio?","592":"Can you allow me to do that?","593":"those are the dependencies i want to get","594":"The shadow is subtle","595":"see, google is playing with me, I typed earlier `CTOs` now it recommends me","596":"This is the error I get","597":"#ask\n\nHow to use input formater phone in TextFormField Widget?","598":"https:\/\/www.google.com\/search?q=position+cursor+at+end+textfield+flutter&oq=position+cursor+at+end+textfield+flutter&aqs=chrome..69i57.17360j0j4&sourceid=chrome&ie=UTF-8","599":"What should i do","600":"it's like doing ('.\/zip...')","601":"Read about inherited widget","602":"Hey anyone know how i can solve this?\nI have udated the miniSDK to 21 but still it's not working","603":"","604":"I have developed an app that lets you search recipes with the help of ingredients - RecipeTap.\n\nNotable Implementations:\n- Serverless Web Scraping (client side)\n- PDF Generation from data\n- Cool Flare Animations\n- Firebase Implementations with Push Notification and Routing users to a recipe or any screen using notifications\n\nGoogle Play:\nhttps:\/\/play.google.com\/store\/apps\/details?id=com.gauravxdhingra.recipetap\n\nSource Code:\nhttps:\/\/github.com\/gauravxdhingra\/RecipeTap-Flutter\n\nIn-Action:\nhttps:\/\/www.linkedin.com\/posts\/gauravxdhingra_flutter-firebase-dart-activity-6673963270581420032-JegO","605":"base flutter app size is around ~8mb","606":"yea but do it very simple like \n\n\nif  (  ) {\n\n}\n\nthats my suggestions, you will debug it easier like that","607":"","608":"Background","609":"Pleas how can I implement file picker in flutter desktop","610":"I love you guys 😭😭😭😭","611":"Hello everyone, i know how to set up google sign in.. can anyone help on how to create firebase user from generated uid","612":"any one please help while installing flutter","613":"experience = DateTime.now() - startTime","614":"Check your network tab","615":"Which function?","616":"where are you from?","617":"how do I use it well","618":"It detect 2 device","619":"Still buggy man.","620":"English please","621":"Ahaha","622":"https:\/\/pub.dev\/packages\/video_compress","623":"Ran out as well, went to buy some black label johnny walker today… 12 years","624":"Java\/Kotlin side?","625":"This is the console during Crash","626":"Migrate to android x","627":"But shows user was authenticated","628":"@Belokotov I can compile right? For Android","629":"Thanks I'll check it out morning","630":"future","631":"Where?","632":"Could be padding, margin, width","633":"Hi everyone 👋 \nI have an app that fetch data from Firestore Cloud as Streams , but i keep facing this issue everytime the page loads.\nYour help will mean great deal to me 🤘.","634":"you have something wrong in your code","635":"How do this using controller","636":"Application programming application","637":"ya i know that but i need to remove this from analysis file","638":"the thing is i am Creating UI object in home page and passing it to all the widgets in the sub trees ... sometimes the levels of tree are as big as 6 or 7 nodes.","639":"Need someone who can setup splash screen of my flutter application","640":"Hi","641":"Have any of you used the latest flutter version 1.7?","642":"Haha, seriously ?","643":"what is it","644":"?","645":"Like most of the other official packages😂","646":"Ok.","647":"ya al carajo, le meti un monton de sizedboxes 😂","648":"Call the state to open drawer","649":"so cant be cliprrect-ed","650":"I'm trying to do a realise for uploading to AppStore","651":"when I mean value,, I mean it should display inside the textfield","652":"are you using the 2.0 futter version ??? or the before version","653":"hello guyz can someone please help me out","654":"what u trying to achieve?","655":"Api means the app will use internet while i need to create offline app that use normal text","656":"Anyone use FB ads in their app?","657":"yes","658":"I have made an app which gets OTP by using Firebase for verification.\n\nNow I want that if sim is present in the mobile then it must fills the OTP automatically.\n\nHow can I acheivie it ?","659":"how to make this kind divider and this  yellow rectangle should  move on this divider","660":"then include it anyway cause you can receive more support in Kotlin\/Swift at the moment","661":"You cant use views in the widgets with undefined height","662":"How to solve the problem of inconsistent display of android and ios emoji ? 😀","663":"I tried both true and false","664":"Haha having the dependency doesnt mean it will break ur app","665":"thx bro","666":"this is a tutorial:\nhttps:\/\/www.youtube.com\/watch?v=FvwSNbq1RpY","667":"hello all.\n\ni need assistance with flutter. anyone to help me?","668":"What is the second brace after scaffold.of for?","669":"I am finding a flutter and blockchain developer.","670":"Ok thanks","671":"and the error JSON Parse failed","672":"Hello, Need little advice on upgrading the flutter version to v1.12.13+hotfix.5 . Is it realy stable?","673":"anyone faced this NotRegistered issue on ios ?","674":"I want to add double values in my custom model.\nLike :::\nList<POIModel> pois;\nNow i want to add 2 values (lat,lon)in this list.\nHow to add.. help me","675":"","676":"Command prompt open as administrator","677":"ahh thanks :9","678":"https:\/\/github.com\/flutter\/flutter\/wiki\/Release-Notes-Flutter-1.9.1","679":"Okay","680":"Nope, there is no padding no margin","681":"Picture from stackOverFlow","682":"import 'package:firebase_auth\/firebase_auth.dart';\nimport 'package:flutter\/material.dart';\nimport 'dart:async';\nimport 'dart:convert';\nimport 'package:allphanes\/view\/homepage.dart';\nimport 'package:flutter_sizer\/flutter_sizer.dart';\nimport 'package:fluttertoast\/fluttertoast.dart';\nimport 'package:http\/http.dart' as http;\nimport 'package:shared_preferences\/shared_preferences.dart';\nimport '..\/widgets\/constant.dart';","683":"in theme of my app flutter, what is the difference between use colorScheme or colors define in ThemeData?","684":"when I test it without 'post' in my browser \nit works","685":"Calculator","686":"I don't have good internet.  Is there an offline solution to fix this problem?","687":"We don't have if else statement in flutter","688":"The `versionCode` of the minimum version of your app that can open the link. If the installed app is an older version, the user is taken to the Play Store to upgrade the app","689":"how to sort this map by year wise??\n{2022: 10, 2024: 4, 2013: 5, 2023: 2, 2018: 1, 2017: 2, 2016: 3}\n\nany one pls help!!!","690":"How to ask permission for this in android using flutter while the app installing ... I can not able to find this .","691":"Oh it's fine 👍","692":"Tried that, Not working, any other ideas?","693":"use return keyword.","694":"So you mean we need native knowlage to do flutter?","695":"Assembledebug failed","696":"Hello friends\nHow can I disabled tap in the tab bar when a process running on the index 1 \nI want to disable 0 index and index 2 until the index 1 process not complete \nPlease help me...","697":"👏🏼","698":"How to setup this date to be a date after 14 days??","699":"Yes it's clear","700":"why .gitignore doesn't ignore pubspec.lock file?","701":"No i am using riverpod itself","702":"Does anyone have an experience with corellium pen tests, they require signed ipa file. Is flutter build ipa enough for this?","703":"why?","704":"Thank you very much","705":"Please have a look","706":"Please i am having an error from running 'flutter build appbundle'","707":"Thanks","708":"Stack, back one is an image and canvas with the drawing on top","709":"It's hard to read the error","710":"If you don’t know what the question means, the answer is probably no","711":"Having an iphone\nCan i connect my phone to my pc via cable and run my flutter project on it?\nI dont have mac and xcode","712":"Enough on contacts","713":"And by the way, you can use FractionallySizedBox for this","714":"As assets?","715":"You will find package do this in pub.dev","716":"Wrap the icon in GestureDetector or Inkwell to get tap gesture","717":"both sides mean form & image, you can provide `Flexible(flex:1)`  for both in row or check`LayoutBuilder`","718":"Thats the favourite model","719":"Can anyone help me\nI had to select image from gallary and show that image in modal","720":"Bruh.....that 2 images are supposed to be in one Carousel.","721":"xml mostly dying now so its not a big deal, but if you really need it no one prevents you from writing your own converter","722":"Only english","723":"Download google-services.json","724":"Reinstall the app","725":"","726":"https:\/\/github.com\/felangel\/bloc\/issues\/2002","727":"what sould I do to handle it","728":"Start with anything but start is good","729":"FREE WORK\nHi I am Flutter Developer I have 1 Year of Experience in flutter development and from some of months i skip coding for some of reasons and now I am back to code I am Currently free after (+5)5PM day so I want to polish my skills but I can work with team on a project for free to back again on track so is there any project, team so I am ready to work with them for FREE. \nIf there is any person who can help me out I'll be very thankful.\n\nWorked On: Flutter, Firebase, GetX.","730":"","731":"no issue found","732":"Yes","733":"How to fix this problem guys?","734":"you can inbox and i explain the steps that i took to solving this","735":"There are some things that i will never understand about Flutter ahaha","736":"But I am totally new I don't know how to use","737":"[3\/22, 1:56 PM] 🥰: I want use streambuilder in the body\n[3\/22, 1:56 PM] 🥰: If i use customscrollview so results is right but \nWhen in the body i use dricet streambuilder so error is showing\n[3\/22, 1:56 PM] 🥰: 🐱","738":"i am fresher  in flutter and dart platform pls give the resource and link","739":"1M ?  Sure 🤔","740":"Yeah","741":"Not yet man...\nYou have any suggestions?","742":"😂","743":"just to notice","744":"overlays are not removing on page change what to do?","745":"This issue is still opened for about a week","746":"how to fetch data from sql date wise while using sqflite?? please help","747":"Just open another nested scrollview with the tabs in the tabview","748":"Null safety","749":"on add click, check the field is empty or not, also you can use Form with validation","750":"Though I don't have a credit card to make a billing account, so I can't redeem it😂","751":"But this will overlapping page again and again","752":"Does anyone know how I can programmatically scroll to a certain index in a list view?","753":"hello","754":"thanks","755":"Hey guys how are you doing","756":"","757":"I put network image in center of top container","758":"hi guys","759":"There is plenty of ideias in the net","760":"add app bar in body with stack","761":"what is the problem here , why can't I give a default value to this attribute","762":"Coz.. I don't see it","763":"Welcome Юрий here we talk about Dart and its frameworks, especially flutter.io .\n\nsearch on Google your question before asking!","764":"position += (target-position)\/easing","765":"There is a package for it. The docs won't help you as it's not from Google, check pub dev. For gstreamer I would look into platformviews, might be easier","766":"I want when I press the edit button, it goes to a new page ready for editing","767":"I think you need to provide more description of your problem.","768":"","769":"Yep 😄","770":"Is there any possible solution for that issue?","771":"I have been trying to use block but it's kinda not intuitive to me and I have been learning it for a month still I don't get it well","772":"What is the way to setup color of the CupertinoTextField when enabled is false?","773":"i am facing this error","774":"https:\/\/api.flutter.dev\/flutter\/material\/SliverAppBar-class.html","775":"`initState` doesn't  have `context` that's why I've used `addPostFrameCallback`","776":"Yw If you wouldn't solve the issue pm me to help you, by showing your code because I can not figure what you want to do exactly.","777":"","778":"where you are using this string","779":"Hlo","780":"I mean 99% of cases u dont mess with contexts","781":"then what is this channel for?","782":"do anyone know what's wrong this is what happening after calling \n```await GetIt.I.reset();```","783":"it's not happening","784":"the app also works for ios?","785":"","786":"MANY Thanks","787":"you made a flutter app just for two links???!!!! 😑","788":"i did something like this for my game","789":"i am getting this error when i am sending data to the api. the response is success but the i am getting this error.  Unhandled Exception: type '_InternalLinkedHashMap<String, dynamic>' is not a subtype of type 'CheckoutModel'","790":"Anyone know what this error means?","791":"Show the error","792":"can anyone help me, many thanks","793":"open android folder as project and fix it in java namespace","794":"This is my progress so far…but I’m getting renderflex errors in di process of adding the white part on it","795":"Hie guys iam new to flutter ....I want to great a video calling application how best can i go about it","796":"Struggling with this since 1 day","797":"Someone worked with https:\/\/pub.dev\/packages\/g_recaptcha_v3\/ on Android IOS apps? Is that possible to use it on mobile side, it is working on web only","798":"I want to make such book app with flutter. Should I use pdf or other else?","799":"cosmic wave, alien send some secrets message 😂","800":"FutureBuilder ?","801":"","802":"hello everyone","803":"Y","804":"Sure, pay","805":"red line in console.\n**a Build function Returned Null**","806":"Means now everything is with firebase auth?","807":"Hello Good Day My name is Emmanuel. And I'm interested in developing mobile applications for both android and iOS. I'm just wondering is learning flutter especially going forward enough or do I strengthen it with other languages","808":"Hey, I am using vs Code and the hot reload isn't working","809":"Basically, i want to change the value of my_var in main() also.","810":"A video it's pretty much useless","811":"lol","812":"oh completed now","813":"We are trying to implement dynamic routing based on  api response","814":"So ,\nIn android\/gradle.properties file\n\nandroid.useAndroidX=true\nandroid.enableJetifier=true","815":"@StarvinMarvin : Are u a qa engineer and tried automating flutter mobile app on released mode apk ?","816":"Wrong","817":"Do u mean reflection?","818":"iterating docs , otherwise you should keep this sum in different doc in the firestore","819":"T.me","820":"I will try thank you so much!!!","821":"u have full tutorial cause i am a beginner 😄","822":"by implementing db with one-to-many table relationship for example","823":"Tried ` flutter build ipa --release` doesn't work","824":"How yo deal with it.","825":"I am able to fetch data but struggling in functionality. Please let me know if anyone can help me in this. I am ready to  pay as well.","826":"This for me is a good course for start in flutter https:\/\/www.appbrewery.co\/p\/intro-to-flutter","827":"Future<Geojson> getMapList()async{\n      final response = await rootBundle.loadString('assets\/data\/Map.geojson');\n      var data = await json.decode(response);\n      print(data);\n      return  Geojson.fromJson(jsonDecode(response));\n}","828":"How can i run flutter without android studio","829":"Network\nCheck your internet connection","830":"Ok at line 70 when you print out the image do you see the image path?","831":"","832":"with android you always can't say for sure","833":"thier is a problem in this dart package","834":"Lol me to","835":"anybody here from Minsk, Belarus?","836":"Dead","837":"Follow guides on the flutter.dev","838":"How to draw path in map between two locations?","839":"Get the position of the container?","840":"I only want 1 product of each id","841":"","842":"Good morning, I would like some help, if anyone can help me, it would be the following. I have this loadProducts() function that returns all registered products, I would like to know how I could make a function that only returns products with a certain category.","843":"flutlab can help in building apps on web... system is not compulsory","844":"i am trying to call url running on my local, getting this error","845":"but","846":"screen size 6.0 okay","847":"👍 got it thanks @Agonnoga","848":"Got YouTube and Search for Angela Yu and Smartherds tutorial. Follow through the instructions. This should be a starting point buddy.","849":"@Belokotov  your  master your skills in flutter? How u know everything","850":"is there anyone here uses getX now a days ?","851":"open your terminal and type `flutter doctor -v`","852":"Same kind of problem","853":"Then do same for that package too","854":"i want to run this project properly .but now i am stuck in firebase.dont know why is this happening .","855":"Fun making datepicker different in cupertino than cupertino","856":"Or products that are not related to any of defined categories or vendor decided to do not define categories and selling everything in one list","857":"use lunche widegt and google it u can get sample code","858":"https:\/\/fireship.io\/lessons\/flutter-push-notifications-fcm-guide\/","859":"https:\/\/dart.dev\/null-safety\/understanding-null-safety","860":"i want to share a text or image in to social media","861":"I can implement streams in MVP too... I have read one article that say: we come from android development so we used MVP by default. Then the project got big so we moved to bloc... Bullshit, same stuff","862":"You have to pass this controller value to other class or page","863":"CustomClipper","864":"Is that doable with a custom backend","865":"👍","866":"thank you","867":"I want to add these like buttons to my application","868":"","869":"Need an expirenced flutter developer here whose worked with the bloc design pattern in flutter before to redesign a couple of restful apis within my app and fetch data from the backend api","870":"Widget library reading willbe helpfull","871":"??","872":"No idea what is code runner, but seems it can't exec dart. Try dartpad.dartlang.org","873":"never used microphone before","874":"💔","875":"Flutter needs a logging library .","876":"see","877":"like just for this palate I spend few days","878":"you have to store the path that's all","879":"🤔🤔🤔","880":"yeah","881":"Right","882":"","883":"i dont understand what you just said🤔🤔","884":"Because I found the answer really quick. Next time, when you have a problem with a package search on his github at issues","885":"I don't","886":"english","887":"Debug it is not only debug console messages","888":"https:\/\/www.youtube.com\/playlist?list=PLR2qQy0Zxs_XqAj-WH9tln3NjdddGW_X3","889":"I think his channel name is mtechviral","890":"Try flutter clean and delete .symlinks and Pods folders in ios","891":"Always booc","892":"i made a focus blur shader as well… which maybe makes more “sense”  for the zooming… like the old Max Payne game when u did the slow-mo.","893":"nirancodelab","894":"Can anybody tell me which font is this?","895":"Google cloud platform billing is same as google map platform billing?","896":"Guys, hello. I need guidance on how to approach a certain flutter tasks.\n\nTask details: **Handle API request for saving data**(user & business info) \n\nMy idea is\/are:\n1. Create model\n2. Repository\n3. Api calls\n\nIs that correct?","897":"any work arounds?","898":"Have to do some simple things on stats for the future awards so do not calculate millions of dicuments in firebase later","899":"Would be awesome, thanks","900":"The client side","901":"And there is no helpdesk or support on demand. When people are available and have nothing to do but read blurry images, they will redoond","902":"Hello everyone!\n\nDid anyone encounter with ListTile castomisation through _verticalTile?\nI am mapping an Image to whole screensize width. The Image is not needed in the left, since it is required on the top. In ListTile widget this is impossible. It seems it is necessary to create containers, and to build ListTile from containers. Links are very welcomed!","903":"I searched, but wasn't able to any example for stop a async method.","904":"I place them on entity only when it communicate  with api 😅","905":"Can't use it with searchDelegate, or at least i couldn't figure it out","906":"Read the docs","907":"just pass dob.text","908":"The question was drawer not to be displayed over statusbar","909":"[@TechpreneurNitish](tg:\/\/user?id=559809451) [`559809451`] used a banned word. \n**Action:** Warn (2\/3) ❕","910":"Thanks guys 🥺","911":"I'm struggling to learn how to use flutter as the design is part of the code while I was always used to have a different file with the design in xml","912":"User [بنیامین موسوی](tg:\/\/user?id=5763468403) has 1\/3 warnings; be careful!","913":"Anyone help me in this...this is not taking the KEY after mentioned as dynamic also in Map","914":"@Belokotov @GitForker","915":"hi can anyone help me, please?   https:\/\/stackoverflow.com\/questions\/69568342\/flutter-drag-bottom-sheet-change-data","916":"Hey there Татьяна, and welcome to Dart \/ Flutter! How are you?","917":"Thala","918":"Is there a way to remove top and bottom borders from the ExpansionTile in expanded state?","919":"https:\/\/youtu.be\/kDEflMYTFlk\n\nI learn using provider structure from this video. And learnt many thing from this channel","920":"Should work..","921":"The method 'map' can't be unconditionally invoked because the receiver can be 'null'","922":"ye to h","923":"mmm I can just recreate it","924":"с помощью какого пакета можно сделать такой виджет?\nПо факту нужно отображение типа карты, остальное и сам выведу","925":"Lol","926":"No, i can add it to header","927":"discuss","928":"","929":"Good evening, I have a question to ask you, I am moving from one screen to another using the pushReplacement (), I wanted to ask you if it was possible in the passage from one screen to another, also pass variables, let me explain, I need to send an object between screens.","930":"Is there any way to use old plugin in flutter 2?","931":"https:\/\/stackoverflow.com\/questions\/53880390\/how-to-implement-in-app-purchases-subscription-in-flutter","932":"go_router always redirect error page if the initial location is '\/login'","933":"This is my code","934":"Row in the fractional box max help","935":"","936":"I thought this book \"`Flutter for Beginners - An introductory guide to building cross platform mobile applications with flutter and Dart 2`\" seemed like a good start, but barely understood after a few pages","937":"Is it okay if i get back to you after a couple of hours?","938":"https:\/\/pastebin.com\/f9dHpzmG","939":"[@a_t_a_a_0_1](tg:\/\/user?id=927324566) [`927324566`] banned.\n**Due to**: idiot","940":"i want to put space between each card(from 4 to 7)","941":"I want to know and learning dart and Flutter","942":"Try to remove version from that package.","943":"is this compulsory thing","944":"Send the screenshot lemme show u","945":"I am facing a problem in the iOS when I am sharing link of  text will be send but image is not going to share so in the share file in iOS","946":"Can any one help me","947":"Cuarantine Implementation Association","948":"I'm lost .... I want to connect my app to a localhost to test the login with a database","949":"","950":"About flutter releases - have ios feeling “wow, there is a new version, but let’s wait for a couple of weeks for the bug fixes”","951":"Listview with horizontal should be child of the something with the fixed height","952":"maybe you used getSafeAcceptedType() or eval() functions. They're only supported by SDK 21 and 19","953":"Your data model is messed up I think","954":"","955":"yes, it updates first level routes, the issue is happening to pushed routes only","956":"i need help","957":"Then","958":"usually on saving the file there used to be auto hot reload","959":"Hey guys am i doing it right or wrong? My intention is to decode hashes I just encoded of an image.  How do I decode ? My code Need reviewed  :: https:\/\/gist.github.com\/johnmelodyme\/700440e798f7aa853106dcea36204e64","960":"How to allow user to create and switch between multiple accounts in Flutter?","961":"👍","962":"Where?","963":"Console errors ain't informative","964":"Can anybody help?\nI am using getx package\nAnd using a variable with obs\nE.g (Selectedvalue.obs)\nNow when i  use\n\nOnchanged:  (value) \n{\nSelectedvalue = value;\n\n}\n\nIts gives error\nObject type can't b assigned to variable type RxString","965":"","966":"this is my code","967":"that does not seem like firebase","968":"Can you open kind of process and communicate with him?","969":"Please help any one","970":"only type sth","971":"https:\/\/github.com\/flutter\/website\/pull\/4981","972":"Show the solution","973":"Need help with this!","974":"Did you follow the platform specific installation instructions on the flutter website","975":"tnx man","976":"See this article guys","977":"the python server needs to run 24\/7 to update database","978":"Hello\nI'm using firebase phone authentication in web app otp message coming from local host only when i deploy it otp message not coming how i can solve it","979":"In my mind, the orders are getting completed together, not after one another, so, why would they take more than two seconds?","980":"I ve created a pdf in flutter which gets a temporary directory.how can i save it permanently to device storage?","981":"Done...","982":"what can i do in this my dart code","983":"If you are have experience developing app with flutter+ laravel. I do have some questions","984":"","985":"Hey there X\/nTream, and welcome to Dart \/ Flutter! How are you?","986":"4 gb ram","987":"I am having crazy bugs","988":"thanks man","989":"Yes but the strange thing is that in debug mode the exact same code works. I don't think it's a code problem. Maybe someone more experienced than me knows if there are any blocks, settings or something else","990":"[@sarifpandaaaa](tg:\/\/user?id=626560274) [`626560274`] warned (1 of 3).\n**Due to**: chat rules violation","991":"import 'package:flutter\/material.dart';\n\nclass Categorypage extends StatefulWidget {\n  const Categorypage({Key? key}) : super(key: key);\n\n  @override\n  State<Categorypage> createState() => _CategorypageState();\n}\n\nclass _CategorypageState extends State<Categorypage> {\n  final categorynamecontroller = TextEditingController();\n  final categorydesccontroller = TextEditingController();\n  int items = 0;\n\n  Widget? listsdd() {\n    setState(() {\n      ListTile(\n        title: Text(\"${categorynamecontroller.text}\"),\n        subtitle: Text(\"${categorydesccontroller.text}\"),\n      );\n    });\n  }\n\n  @override\n  Widget build(BuildContext context) {\n    return Scaffold(\n      appBar: AppBar(\n        title: Text(\"category\"),\n      ),\n      body: ListView.builder(\n          itemCount: items,\n          itemBuilder: (context, index) {\n            return listsdd();\n          }),\n      floatingActionButton: FloatingActionButton(\n        onPressed: () {\n          showDialog(\n              context: context,\n              builder: (context) {\n                return AlertDialog(\n                  title: Text(\"Category Form\"),\n                  content: SingleChildScrollView(\n                    child: Column(\n                      children: [\n                        TextField(\n                          decoration: InputDecoration(\n                            hintText: \"write a category\",\n                            labelText: \"Categories\",\n                          ),\n                          controller: categorynamecontroller,\n                        ),\n                        TextField(\n                            decoration: InputDecoration(\n                              hintText: \"Description\",\n                              labelText: \"Description\",\n                            ),\n                            controller: categorydesccontroller)\n                      ],\n                    ),\n                  ),\n                  actions: [\n                    ElevatedButton(\n                        onPressed: () {\n                          return Navigator.of(context).pop();\n                        },\n                        child: Text(\"cancel\")),\n                    ElevatedButton(\n                        onPressed: () {\n                          print(categorynamecontroller.text);\n                          print(categorydesccontroller.text);\n                          items = items + 1;\n                        },\n                        child: Text(\"save\")),\n                  ],\n                );\n              });\n        },\n        child: Icon(Icons.add),\n      ),\n    );\n  }\n}","992":"Can someone help me code this kind off pattern.","993":"Hi guys, I'm trying to create a flutter telegram client, I looked long and wide and tried to use the official library but I didn't understand how to connect it to my code. Can anyone explain to me or send me a link where it is explained? thank you very much 😊","994":"value must be >= minimum and <= maximum, that's what the error says","995":"when I call","996":"Try printing value to console","997":"Did u just installed flutter?","998":"Dart 2.18.2","999":"can you share link"}}