{"text":{"0":"Мне очень жаль, что твой код руинится форматированием. Это не было нашей задачей при реализации интеграции с Фантомасом!","1":"В защиту C# анонимные типы можно таки возвращать из функций","2":"так, и теперь с пояснениями)..","3":"`let sendInvitationEmail = service.GetService<SendInvitationEmail>()`","4":"Ну я вот сам только из-за ссылки на коммент в issue полез смотреть, не появилось ли чего-то в репе Жирафа.)","5":"будет как Task, синхронно ранится до первого бинда (евейта)","6":"\/\/ offtop\n\nЕсть смылс ехать туда?\nВсмысле отдыха, и новой культуры?\nА то лоукосты так и манят","7":"Это не будет работать.","8":"Safe-stack гугли","9":"а, ок.","10":"https:\/\/github.com\/fsharp\/fslang-suggestions\/issues\/430","11":"наркоманам нет преград!","12":"возвращаясь к проблеме с Slice","13":"Строго говоря, юзают. Я видел, и сам юзал.","14":"до этого в Париматче была реалтайм система","15":"у вопросов есть номера","16":"но мы обсуждаем подобное для фшарпа","17":"ребятки, делаю задачи на codewars по эфшарпу, вобщем задачка: \nYou are given an array strarr of strings and an integer k. Your task is to return the first longest string consisting of k consecutive strings taken in the array.\n\n#Example: longest_consec([\"zone\", \"abigail\", \"theta\", \"form\", \"libe\", \"zas\", \"theta\", \"abigail\"], 2) --> \"abigailtheta\"\n\nn being the length of the string array, if n = 0 or k > n or k <= 0 return \"\".\n\nВ общем мой код:\n```let takeNElementsFromMax n (xs: list<string>) =\n    let maxEl = xs \n                |> Seq.map (fun x -> (x, x.Length))\n                |> Seq.maxBy (fun (_, l) -> l)\n                |> (fun (el, _) -> el)\n    let idx = xs |> Seq.findIndex (fun x -> x = maxEl)\n    let idxs = [idx .. if (idx + n > xs.Length - 1) then xs.Length - 1 else idx + n - 1]\n    [for index in idxs -> xs.[index]]\n\nlet longestConsec lg (xs: seq<string>) =\n    xs\n    |> List.ofSeq\n    |> fun arr ->\n       if arr.Length = 0 || lg > arr.Length || lg < 1 \n       then \"\" \n       else takeNElementsFromMax lg arr\n            |> List.fold (+) \"\"```\n\nТесты проходит, но потом не проходит рандомные тесты, я не понимаю, что я делаю не так","18":"Ему буквально надо `String<50>`.","19":"я понимаю (и мне этот подход нравится), просто изначально эти строки планируется использовать только на чтение, вот я и подумал, что DU будет лишним оверхедом","20":"Хорошо идет в связке с \nhttps:\/\/github.com\/yatli\/fvim","21":"на примере там есть Option<List<Foo<Foo<int>>>>>\nи он внутри там изменяет последний Foo","22":"Если папочку назвать Giraffe","23":"Вон там апвеёр падает, потому что не может распарсить `[<Struct>]`.","24":"Да, у меня тоже сабмиссия это что-то из БДСМа только припоминается","25":"да. Но это не объяснишь  излишне убеждённым людям. особенно в таких холиварных темах)","26":"И сделать кастомную операцию","27":"но тогда и читать данные придется через мейлбокс тоже","28":"Надо починить. :)","29":"[<Struct; IsByRefLike>]","30":"А почему не поверим? В этом есть определённый смысл.","31":"А тут у нас просто storage — это память текущего процесса. До тех пор, покуда это документировано — всё норм должно быть.","32":"безусловно. Его бы энергию да в мирное русло","33":"А что не так? Я правда не в курсе, дайте мне курс молодого бойца.","34":"Можно посмотреть в C# код, в конструкторе создается агент с генерик-параметром класса.","35":"я думаю что в данном случае будет быстрее из одного потока всё сделать","36":"Третьим будешь!","37":"И депенденси через dotnet add package","38":"Можно присобачить из C#... Правда опыт был в обратную сторону: прицеплял F# к C#...","39":"С ней уже были проблемы xD","40":"поверю любому твоему \"я тебе точно говорю\"","41":"Про него документация отчего-то умалчивает :)","42":"Подожи, VDOM нужен что бы убрать тормоза от частого пересоздания дома в реакте, тк это дорогая операция.\nКак бы “Raw js + жиквери” это вообще другой подход и нельзя их сравнивать.","43":"Вторые резолвятся статически во время компиляции и в рантайме их нет","44":"Нормас","45":"Так как в системе типов F# без использования SRTP мы не можем назвать полиморфный `list-like` тип как тип возвращаемого значения `f`, то:\n\n1. Нужно вывести `int list` и получить ошибку при использовании `(+)`\n2. Или накостылять особенный constraint — `list-like`","46":"Я так и не посмотрел доклад Росса про иммутабельную виртуальную машину на TP.","47":"все мои дырки при мне!","48":"Я очень быстро свичуюсь. Последнюю неделю покоряю ноду","49":"Странно оно работает..","50":"Это очень сложная схема","51":"а можно какие-нить похожие глифы использовать? ну, типа как женерики в Го? )))","52":"Для перфа лучше обычный словарь","53":"да. я люблю спокойствие","54":"А msdos как тебе?","55":"это у имени класса нет токена? или я что то не так смотрю?","56":"ууууух бля","57":"Факт.","58":"Вот валидация одной модели, есть несколько функций проверяющих конкретные аспекты, нужно собрать все ошибки","59":"тем более там в некоторых версиях багули (привет таск билдер)","60":"В целом нормально без циклов обходимся","61":"в общем кажется что такой задачи не должно стоять) надо передавать данные, а потом матчить данные и вызывать функции нужные)","62":"ага, а откуда ты взял next ctx =)","63":"а где вопрос был?\nя просто не заметил","64":"я просто сча думаю какой роутинг для лямбды сделать, как в жирафе или поубирать все параметры из роутов в тело запроса и жить счастливо)","65":"вдруг там внутри 0 превращается в “ноль\"","66":"Или как там записывается","67":"@brud90","68":"учитывая что замарин имеет поддержку фшарпа это смешно","69":"Ну и в целом замарин очень любит ломаться на ровном месте","70":"Герой невидимого фронта)","71":"куда более интересно в программировании звучит \"Ох, там местами хороший код.\"","72":"В замариновал чате я вывешивал прототип elmish для замарин форм","73":"есть две функции defaultArg и defaultValueArg\n\n```defaultArg input \"none\"\n|> sprintf \"some %s\"```","74":"Попробуй явно в делегат обернуть","75":"ой, вот так пофиксила в общем, не очень поняла, конечно, почему фарш сам не вывел","76":"не, архетипы это SoA, не AoS. Ну, обычно. Но я понял, да","77":"Их можно друг в друга конвертить если каждый отступ превращать в блок скобок с убиранием отступа.\nЭтакий препроцессинг","78":"Не хватало ещё всякой химией травиться","79":"я больше не про красоту говорю, а про понятность флоу, когда все справа налево это гуд, когда все слева направо - тоже гуд. А когда смешиваешь их без скобок, то повышается когнитивная сложность","80":"Извиняюсь за бестактность, но еще не знаком с творчеством товарища . Я ведь правильно понимаю, что @ijsgaus из \"высшей лиги\".","81":"Привет.","82":"Вообще да.","83":"ну ещё бы этот уебищный ксор убрать","84":"Ловите наркомана","85":"Функция обычная","86":"Сделайте тикет в встесте","87":"Я вот знаю про ажур. Типа там грейны можно как бы серверлесс заливать в облако","88":"А сами вон как","89":"вот прям тут писали, что есть - но для одного человека","90":"А ты сам-то как думаешь? За то, что они выполняют задачи работодателя. Которые в идеале должны, но могут и не совпадать с задачами, которые интересны лично мне или тебе.","91":"остальные плюшки?","92":"есть ещё refit","93":"Ну мне хуй показали вместо ассистанта","94":"Никакой дополнительной аллокации-деаллокации, ничего не нужно","95":"будет","96":"Это иммутабельный массив.","97":"В таком варианте какой смысл весть if в задачу оборачивать?\nНу да, Task.CompletedTask не очень красиво","98":"смысле в том что, действительно Fable исключительно HTML5 приложения и все","99":"> обычной","100":"Значит его.","101":"ну, относительно первой версии, на которой пример в репе - версия новая)","102":"коннекшон стринг же идентичный... так что скорее всего так и сделаю!","103":"дай подумать... как насчёт, чтобы СКОЧАТЬ и УСТОНОВИТЬ?","104":"а воз и ныне там)","105":"\"Зачем я создал два одинаковых типа и теперь решаю эту проблему\"","106":"То что ты видишь в фшарпе остаётся в фшарпе)","107":"я так понял нужно\nasync {\n let! qwe = http.PostAsync() |> Async.AwaitTask \n}","108":"","109":"Там более простые вопросики обсуждают","110":"ну я обычно TODO в каменты забираю. там их райдер например находит","111":"Я во флудилке, кажется, рассказывал, что на втором курсе писал на плюсах в gedit. :) Ну, я шучу, конечно, просто реализация хорошего редактора может затянуться.","112":"да что-то не заработало у меня HTTP. Пытался побомбить свой АПИ, используя консольное приложение и нбомбер. Рисует красивые полоски, процессор загружается, а вот запросы до АПИ не долетают. Странно. В общем пока забил на это.","113":"Спецификацию обновляете руками? Проводите ли какое-то автоматизированное тестирование на соответствие апи спеке?","114":"Ну или есть возражающие?)","115":"думаю, что станет понятно, что с ним не так","116":"а как райдеру сказать чтобы он комплитил имена свойств?","117":"окей","118":"https:\/\/t.me\/haskellru","119":"Круто, а ЯП?)","120":"Я понимаю, но работаем с тем, что имеем...","121":"ты упрлся","122":"Ну и ещё бывает анонимный рекорд, для него определение не нужно писать, сразу используешь.\n`let x = {| a = 10; b = 20uy |}`","123":"Сделать c# api модуль отдельным проектом","124":"Не, она захардкожена","125":"красота!","126":"или core только в райдере не поддерживается?","127":"Ну да","128":"но большой боевой код я еще не делал","129":"Да, не работает. Ну тогда F.","130":"в качестве подарка?","131":"@Slavka_online осознал?)","132":"Ilx потом из него обычный IL генерит","133":"верно, основная практика для удобства это основные зависимости склеивать в один большой объект env, еще есть дополнительные ухищрения как это еще упростить на основе известной статьи, сча ее поищу","134":"или ReadAsync()","135":"то есть разница в том что Task сразу в шедулед стейте создаётся?","136":"потому как он перекроет глобальный оператор умножения для всего что ниже.","137":"| grep Russia | wc\n0","138":"я не очень понял) сижу я на .net 4.8.1 выходит F#8, я обновляюсь - не компилится, куда мне нужно заапдетить sdk? вы выпустите хак для 4.8.2?","139":"Или не доделали","140":".[0]","141":"Не говоря уже о вакансиях с описанием \n“React на беке, mvc на фронте»","142":"Для обычных команд всё понятно, но копирование и удаление файлов требуется достаточно часто, а разница в вариантах шеллов достаточно большая, чтобы дать свои команды системы сборки для этого.","143":"Если знать что делать, то там MSBuild Task, и 2 MSBuild файла. Только что делать и как это отлаживать знают наверное человек 10-20 в мире 😄\nНадо будет это задокументировать как-то и шаблон проекта выкатить 🙂","144":"https:\/\/pastebin.com\/CMPJF9f1","145":"Нет, но разглядывал.","146":"Не совсем, функции преобразования разные могут быть","147":"свой dsl, аля https:\/\/habrahabr.ru\/post\/116301\/ =), нейронка, парсер страниц, морской бой, блек джек, своя виртуальная машина + свой простой язык, плагин к Компасу 3d (внезапно), админка для сайта","148":"пащиму","149":"Интернал всегда имеет область видимости текущего ассембли же","150":"почему-то никогда не видел, чтобы кто-то его использовал. поэтому и сам отношусь к нему с недоверием. локи кажутся более надёжными","151":"Задача подразумевает множество, но у нас тут уникальность не по объекту, а по полю объекта. Я не знаю, как в сабже, но в хаскеле сет работает только с сравниваемыми типами (Ord тайпкласс, там внутри бинарное дерево (RB) скорее всего, раз Ord, а не Eq). Если на типе объекта определить класс Ord, который будет сравнивать айдишники, но множество будет работать как нужно. Полагаю, что-то такое можно сделать и на фшарпе","152":"а","153":"или насколько ФУНКЦИИ изоморфны МОРФИЗМАМ","154":"По какому поводу?","155":"@mitutee Я предлагаю написать бенчмарк, и посмотреть, устраивает ли скорость.","156":"Смысла тогда не очень много. Я бы уменьшил скоуп PR до статиков.","157":"там и в il тупля","158":"Блин, опять грёбаный module rec","159":"А что такое пустой кортеж?","160":"Поэтому интеллисенс сломан, всё сломано.","161":"Влашин получше","162":"Я уже понял что это тупиковый вариант","163":"Тогда пример кода в студию","164":"Недавно видел видео про Сбербанк (типa “введение в RN”).\nОни там напилил кучу своих личных RN кросплатформенных компонентов и на их базе шлепают мобильные приложения (прям на поток пустили).","165":"👌","166":"https:\/\/github.com\/veepee-oss\/Vp.FSharp.Sql","167":"хз, с таким раньше не встречался, навскидку сложно сказать, удобно ли будет в большом проекте, но по-моему, когда таких функций дохуя, уже не очень удобно","168":"У него обычная симуляция хкт, там ад.","169":"Василий, мы не во флудилке!","170":"internal sealed class b@11 : I\n    {\n        int I.get_A()\n        {\n            return 1;\n        }\n\n        string I.get_B()\n        {\n            return \"kjlkj\";\n        }\n    }","171":"Релизы языка и FSharp.Core в общем случае не связаны, можно их выпускать по-отдельности, и это правильно.","172":"Я к тому, что, ну, почему на польском-то? :)","173":"Мб подскажешь что-то актуальное для изучения .net? На английском\/русском","174":"Отлично, запустил локальную версию IfSharp. И предпросмотр XPlot работает, и R.NET. Кажется, что-то они в своем Azure Notebooks делают не так.","175":"оперидирую.","176":"Kdevelop мне понравился потому что это первая идешка на моей памяти что пыталась выпендриться как XCode визуальными прикольчиками. Красивые вылеты, плавные подсветки ошибок, подсветки закрывающих скобок подпрыгивающие как в XCode","177":"Ну или по пролетарскому-меньше кода, чище жопа :)","178":"EAP.","179":"Там ещё пачка таких мего типов появилась нынче","180":"Фп головного мозга, так же плохо как и ооп головного мозга","181":"жираф это ASP NET Core","182":"Может Fez взлетит? :)","183":"И разгребаю свой легаси-код","184":"не благодари :)","185":"Есть тут у меня одна задачка жызненная, упоролся прям прару месяцев назад. \n\nНужно составить календарь соревнования из N команд, чтобы миммум дней дллся. \n\nКаждый день играют не более трёх команд. \n\nКоманда не должна играть два дня подряд. \n\nКоманды должны состязаться между собой один раз в течение чемпионата.\n\nУчловия подлежат разумным уточнениям и дополнениям","186":"да это я щас так изучаю, играюсь","187":"хм","188":"@vshapenko Василий, глянь - там сверху - вакансия!","189":"Фшарплобби","190":"Это один из тех кейсов, когда хочется  op_constructor","191":"Для математических операций.","192":"Действительно, в релизе реф туплей не создаётся. Но почему только в релизе? Моя дебаг сборка страдает от сотней мегабайт туплей в SOH-е","193":"Подскажите как биндить модель не разрешая пропуск полей, и если бинд идти на след рокт","194":"Funogram","195":"Более читаемым???","196":"аа, ты про распределённую систему. Я не знаю, честно скажу, как это решается средствами ОС админов.","197":"Не знаю, я редко пользуюсь FSI.","198":"Посмотри на канале по кейворду json","199":"спасибо. попробую его, потому что у меня что-то с той репой не сложилось","200":"Привет!\nКак бэкграунд? Как с Английским?","201":"> Опускаться","202":"А в лс продублировать не было идеи? Ну вот как то логично же, что если дублировать для меня, то наиболее подходящее место - лс, а не общая группа.","203":"Я наверное даже соглашусь что это другое.","204":"Он самый","205":"в жс работает\nк тому же лет 10 назад в F# тоже работало (F# PowerPack как-то позволял делать, но сейчас всё давно поломано)","206":"'''type'''?","207":"Начнем с того ,что seq бесконечен","208":"Круто. Можно распространять?","209":"Ещё можно просто отрыть неймспейс","210":"Рекорд тупее и надёжнее","211":"Но я уже давно не видывал, чтобы референсы из DLL добавляли. Сейчас всё чаще нугеты…","212":"Если хочешь","213":"Иногда только перезапуски нужны, если совсем дикое что-то делаешь","214":"Для большой кодовой базы упрощается дерево зависимостей, а чем оно проще-тем проще саппорт. Если есть возможно на компилятор переложить битие по рукам за попытку полазить по данным извне-то надо этим пользоваться(я про спецификатор private на потроха рекорда). Минус(а по мне-это плюс :) ) такого подхода-в модуле должна быть объявлена функция конструктор","215":"раньше значение всегда выичислялось, а теперь вычисляется только когда его нет в кеше","216":"А вот если ты хочешь рил использовать провайдер в девелопмент-среде — тогда тебе надо второй солюшен. Потому что с одним солюшеном все очень хреново.","217":"https:\/\/repl.it\/KWI1\/0","218":"для пакетов нюгет","219":"Если многострочное выражение то нетб","220":"Гляньте апи ревью. Это сложная тема на самом деле","221":"Не понял тебя сейчас","222":"Регекспы вообще думал трогать в последнюю очередь)) Ну в общем понятно, \"просто\" не выйдет)","223":"ты ж сам можешь навалять такую функцию в пару строк","224":"ну да, да, дедлайн наступает","225":"провайдеры старые, FSharp.Data 2.4.6","226":"ээээ","227":"какие книги посоветуете по F#? можно на анг.)","228":"оптимизированный же в лобешник смотрит не пустые букеты, и если находит-натравливает Span.IndexOf на поколения, и если он больше 0-то устанавливает current ну и счетчик сдвигает","229":"с другой стороны, если EF добавить в базовую сборку, то и не будет проблем с версиями, как вариант","230":"тогда неясно чо сломалось!!","231":"https:\/\/github.com\/Microsoft\/visualfsharp\/issues\/5969","232":"DDD ложится на любую парадигму","233":"Спс","234":"просто по порядку подставляется","235":"вообще, изначально проблема была в том, что у меня вот этот код не работал:\n```let   inline  Length' elm = (^a: (member Length :int) elm)\nlet   E   = \" [ERROR]\"\n\nList.sum Length' [\"[->]   \"; E]\n```\n\nя решил проверить, убрав `List.sum`\n```Length' [\"[->]   \"; E].[0]\n```\n\nдальше я тупанул аля `\"оно не работает!!!\"`\n\nзатем мне мягко намекнули, что `\"оно таки работает о_О\"`\n\nзатем я вернулся к своему \"корыту\", а оно \"по прежнему разбито\" 🤣🤣🤣","236":"Ну например, ты какую-нить базу КЛАДР выгружаешь :)","237":"","238":"А, нет, всё нормально","239":"https:\/\/github.com\/dbrattli\/Feliz.ViewEngine","240":"ну вот как откажется, то будет двумя ногами в ящике, а пока одной только)","241":"Мда, смотрю на  AssemblyBuilder и не понимаю, как хотя бы стрим вытащить","242":"List doesn't implement IQueryable. So you should cast it using the extensions method `.AsQueryable()` (from the `System.Linq` namespace)","243":"Если кто-то к тому времени будет полностью понимать происходящее","244":"Здесь, может, и не нужен, но _ - вайлдкарт паттерн, он в основном для сопоставлений нужен, где неважная информация опускается и подойдёт что угодно, изредка для частичного указания типа пригождается.","245":"про даппер я тогда не слышал, потому прошел мимо его. но если поискать плюсы, то мой десериализатор - это три файла исходного кода. даппер думаю будет больше. следовательно, скорее всего самоделка работает быстрее, хотя утверждать не буду","246":"А пример можно с ограничением seq на мемберы?","247":"Мне кажется, в Core ничего не работает.","248":"там для сравнения по значению какой-то Seq.xxx есть","249":"Допустим","250":"Не очень приятная работа.","251":"Ну и был набор из чуть более сотни возможных графов, которые удобнее гораздо описывать на DSLке, чем пилить код, т.к. структура по ходу дела допиливалась, и хотелось максимально уменьшить издержки на изменения, а не сидеть и грустно пилить прорву кода в результате изменения структуры графа","252":"Акка стримы - это ж асинхронная реактивщина, насколько я понимаю?","253":"я хз мб для дженериков своё умное название есть","254":"могу доклад по теме кинуть","255":"Что-то я не уверен что дамы выше увлекаются F#...","256":"Persistent Queue","257":"В первую очередь я перевожу текст для сдачи в универе. Поэтому мне желательно сдать подряд идущий блок текста. Либо надо брать что-то с конца, либо подождать, когда я закончу с университетской частью. Можно помочь @techiedesu с первым текстом, он уже начал.","258":"Когда нибудь завезут","259":"При передаче функции вместо лямбды компилятор генерирует свои имена для аргументов.\n\n```Func<string,HttpContext,IResult>(Handlers.handle)```","260":"А можно сравнить с растовским аметистом?\nhttps:\/\/github.com\/amethyst\/legion","261":"В целом, можно фолдом свернуть коллекцию ключей","262":"Ну.. да :) это термин вполне себе :)","263":"Ну потому и райдер, что можно поднять на бубунте :) Да и есть большие сомнения, что ОС специфичная хня, корка она и в африке корка","264":"вот да!","265":"а тут в проде у кого то используют canopy ?","266":"Блин, пробросьте в Api функцию конфигурации и все","267":"ты хочешь в мсбилд вкорячить другой компилятор для моны?","268":"Так и должно быть?","269":"Или может твой DU должен какие-то рекорды носить","270":"Да ни фига подобного","271":"Я всё забываю его поюзать. Надо бы взяться","272":"+10 человек сегодня","273":"Синглтон же необязательно стейт хранит","274":"static member (+) ((Point(x1,y1)), (Point(x2,y2))) =","275":"а зачем там вот это - ``","276":"где cleandocs однострочник\n\n`Target.create \"CleanDocs\" (fun _ -> Shell.cleanDirs [ \"docs\/output\" ])`","277":"Которые вроде как призваны абстрагировать меня от хибернейта","278":"Надо там порядок навести","279":"Console.ReadLine()\n        |> Todo.create\n        |> Todo.add state","280":"Да это траленг был.","281":"Но надо сказать сетевой код SAEA еще более эзотерический, чем TPL подобный, без предварительного массажа мозга не все могут сходу ворваться :)","282":"и?","283":"Нечасто f# встретишь","284":"Всегда берётся последний найденный кейс, инфа типа из левой части или сигнатуры не учитывается","285":"`All of this will happen as a Task<'T>, and will be scheduled and awaited by ASP.NET under the covers.`\nscheduled and awaited как перевести чтоб уши не резало ни у людей, ни у погромистов","286":"Терпи!","287":"Перенос нужон","288":"Сорс генераторы прибиты к рослину. Придётся как-то его впиливать в фшарп. Плюс пилить конверторы из рослиновых деревьев в фшарповый аст","289":"Более того там можно  Assignees выставлять","290":"мы эту тему с PositiveDecimal тут недавно разбирали.","291":"Шота тут не так","292":"Но это тоже изврат по сути","293":"Ну, жираф хайпится немного на бенчмарках.","294":"Этот я уже знаю ) похоже он единственный)","295":"All ok","296":"Мы на проекте для highloadcup вообще делали какие-то хтонические ужасы на пулах байтовых массивов и сериализации `int` через `unsafe` 😆","297":"Нужен пример вызова функций","298":"Это добавление новых мемберов в тип после его инициализации?","299":"Интересует реальное использование, а не так: дома накидал для интереса","300":"🤔","301":"Звучит не понятно, но идею понял. Да, это валидный юзкейс (наверно).","302":"vnet, кстати - так и не подцепился :(","303":"Не пойдёт - нужно до первого бракованного","304":"а че не\n```Message = \n| Message1 of string \n| Message2\n| Message1_v2 of string * string```","305":"Я бы так записал, хотя смысл один в один 🙂\nКажется, что по сложности все равно лучше не выйдет\n```let getIndexesOfEqualKeys (prevColl: ViewElement seq) (newColl: ViewElement seq) =\n    let prevKeysByIndex  = prevColl\n                           |> Seq.mapi (fun i x -> x.KeyValue, i)\n                           |> Map.ofSeq\n    let newKeysByIndex = newColl\n                         |> Seq.mapi (fun i x -> x.KeyValue, i)\n    \n    let mapOldToNew (key, newIndex) =\n        prevKeysByIndex\n        |> Map.tryFind key\n        |> Option.map (fun oldIndex -> newIndex, oldIndex)\n    \n    newKeysByIndex\n    |> Seq.choose mapOldToNew\n    |> Map.ofSeq```","306":"ну VB же учитывают )","307":"```let vasya = map.TryFind 1\nlet petya = map.TryFind 2\nprintfn \"%A %A\" vasya petya```","308":"как это нет, когда только что тут упоминали форум разрабочиков","309":"ага","310":"У таски стандартной не такое поведение. Почему бы не сделать так же.","311":"спасибо...","312":"Есть там в проде f# код?","313":"почему?","314":"Судя по коммитам в TypeShape, Тцапалис скоро выпустит версию с HKT внутри","315":"Странно всё это, впрочем.","316":"Я сразу понял, что проблема в прокси, сменил пару-тройку прокси, но ошибка осталась. Потом колдовал-колдовал, вас уже вопросами успел достать. Сейчас сменил прокси и всё заработало","317":"Ну я про те блобы, что код в урл сохряняет и \"типа из файла будто\" - очень похоже на то, о чем ты пишешь (с поправкой на жс, конечно).","318":"","319":"стратегий реализаций множество, если начать считать-3 основных, и дальше подварианты для каждой реализации возможны, как-то: 1) отсутствие архетипов 2) архетипы в виде метаданных 3) полные архетипы с хранением компонентов чанках архетипов","320":"тогда у тебя таймер в IO должен уйти.. потому что это IO","321":"Дак ты его задай.","322":"у меня некоммерческая лицензия","323":"Ризонмл с помощью баклскоипта превращается в жс да, но ризонмл это не про фронт","324":"А что под \"каждый с каждым\" подразумевается? `[a; b; ...]` → `[(a,a); (b,b); .. ]` что ли?","325":"А так - будем ползать по коду провайдеров, исследовать магию и разбираться, как такие штуки имплиментить.","326":"Ну вообще да","327":"Уже нашел же.","328":"По сути весь этот матан на хер не нужен тем более для F#, и всё применение ТК в программировании легко объяснить на пальцах. Я выше скидывал ссылку на видео автора сайта F# for fun and profit (не помню имя). он там даёт более чем исчерпывающее объяснение","329":"Aggregate в LINQ","330":"Может ответить \"Что такое фшарп?\")","331":"Добавляешь файл, и сидишь тупишь пытаясь понять какого чёрта у тебя open не работает)","332":"все синглтоны можно объединить в один объект","333":"Вот если ты ее заюзаешь где-то, то покажет.\nОтправь ее в игнор","334":"да так же, только без ООП","335":"Я предлагаю так:\n- разработчики меняют БД, в девелопер-моде провайдер читает данные из БД\n- перед коммитом разраб, который менял БД и написал миграцию, обновляет DBML\n- на билд-сервере юзаем DBML","336":"а эта штука сразу в свагере рисует","337":"Ага","338":"ее сложно сделать?","339":"Ты смешиваешь две вещи в своем предложении.","340":"А, правда, его можно уже сейчас на русском языке послушать.\n\nhttps:\/\/www.youtube.com\/watch?v=05DyWjTBg0c","341":"Jupyter может отображать графики XPlot.","342":"Да","343":"Ну для меня это не проблемы. Если нужно в Premium или Dedicated или через HealthCheck","344":"Мне кажется, ему хочется доказать, что жираф фигня","345":"Этой магии бы нормальный синтаксис.","346":"Ммм не помогало, тем более если у меня внутри рекорда, map, queue и еще один рекорд  это их заинстантит?","347":"что за TP?","348":"Exception must flow...","349":"Фантазии редко совпадают с реальностью","350":"Тут не соглашусь. Взяли два напрашивающихся кейса с нулевой скрытой составляющей и затянули в либу. Не помню, есть ли в noda time аналоги, но проблемы DateTime к only версиям имеют опосредованное отношение. \n\nМне дали штуку, которая делает и хранит ровно то, что мне нужно в рамках моих пользовательских задач. И самое главное не лезет за пределы своей сферы ответственности. Когда юзер мне дату выкликивает в контроле, там ни времени, ни таймзон нет. Если надо, добывай отдельно.\n\n\/\/ Хотя в целом я бы хотел избавиться от  System.DateTime. Чтоб его вовсе не существовало. Ломку обратной совместимости готов потерпеть.","351":"это может быть на уровне аст","352":"member inline this.While (moveNext, cexpr) =\n            while moveNext() do cexpr","353":"Раз уж тут пошли раздавать советы, то посоветуйте как прокачать F#, если ты работаешь C# разработчиоком? Учить просто по книжкам и роликам с ютуба - поможет тока на первом этапе. Искать проекты куда можно контрибьютить?","354":"ты, по-моему, уже в обратную крайность впадаешь","355":"#вакансия https:\/\/m.hh.ru\/vacancy\/19708817?utm_campaign=new_vacancies&utm_content=2017_04_10&utm_source=telegram&utm_medium=microsoftstackjobs","356":"Книжка Рикардо?","357":"Я только начал изучать F# и до сих пор обходился только fsharp for fan and profit. Бегло прочитав последние сообщения, создалось впечатление, что стоит почитывать что-то другое. Не могли бы посоветовать какой-то ресурс\/книгу для начала?","358":"Похоже на брекингчендж или напишут как отдельный билдер","359":"Чаще можно попробовать сматчить и чаще работает, чем не работает","360":"так у одного параметра же один дженерик параметр","361":"Ну если бы ты на стороне CE не просто строку получал, а что-то структурированное, то мог бы докидывать кавычки.","362":"а как видео скачать?","363":"Но пояе у бы не писать то самое же на фаршике?","364":"ну, мало ли","365":"А как они fable и сервер связали?\nПолучилось ли шарить код?\nРассказал мужиками по этот чат 😏?","366":"А что там?","367":"Обновляется! )","368":"Надо развязывать стейты","369":"Они даже парсятся по-разному.","370":"добрый вечер, неподскажите как я понял f# в асинхроность может то с асинхронными методами из библеотек c#, опирался на то что в 3 видосах в доке у майков и на хабре всегда дожидаются либо выполнение метода из библеотеки либо задержки, это правда? Или все таки есть возможность запустить асинхроно метод?","371":"\\z не воркает?","372":"Сейчас приоритеты:\nНовые баги, регрешшны и интероп проблемы, которые мешают нам зарелизиться к нет5.\nВсе остальное :)","373":"а где должны лежать всякие вещи вроде .editorconfig  и appconfig там и тд","374":"Функциональщикам должно понравиться ещё Fable, например ;)","375":"Жаль, а то как-то подумалось, что такая идея могла бы хорошо на них лечь. Спасибо за помощь.","376":"Однако лол","377":"консоль пустая)\nне важно запускаю я leap, пишу любую свою функцию с выводом в консоль, там ничего нет)","378":"а чорд да мой фейл, `module` имел ввиду, сорян ))","379":"А как обычно? Забить на 5 лет?","380":"\"Упасть - не спать\" это почти как \"Умереть - не встать\" 🙃","381":"Как вызвать метод базового класса в CE?","382":"@grishace","383":"а еще atomic зарезервирован и parallel\nно это ни о чем не говорит кроме того что слово зарезервировано","384":"Табы! :'(","385":"ух ты, без круглых скобок вообще здорово было б","386":"Шутки шутками, а я бы сделал. Но лень бесплатно","387":"совсем левый","388":"в сишарпном проекте вообще ппц ориентироваться... на ровном месте зафигачат 5 классов, да по разным файлам ... хер проссыш... то ли дело фшарп - все 5 классов (без мусора!) рядом! их идея и цели считываются сразу. далее уже изучвеш функции вокруг их","389":"такая штука позволяет писать сразу dotnet myprogram.exe pipeline run -msgCount=10 -pipelineCount=100","390":"Моё утверждение были лишь сарказмом, и, как выяснилось, исходная реплика была не про тулинг","391":"Кстати вы явно описываете сигнатуры функций и тд? Просто сколько не читал сорцов на фшарпе, вывод типов как и в скале нигде не используется","392":"а, прочитал по клику) это приоритет перегрузок","393":"Это конечно холиварный вопрос, но Вью производительность работы в два раза лучше реакта даст, если не больше","394":";(","395":"а как fsproj выглядит?","396":"tl;dr Фреймворк, позволяющий тебе делать и бэк, и фронт на C# и F#.","397":"this","398":"если это не так, то это крупная подстава. я кстати тоже про буферы подумал","399":"ОДЗ известно, поэтому чудес не будет :) И вообще-констрейнт повесил на невозможность добавить более 1024 частей в Entity агрегат, ибо нефиг :)","400":"https:\/\/github.com\/OlegZee\/Xake\/blob\/296b1d3971bd6189ee417261e29db4fd3bb7a98a\/core\/Tasks\/Dotnet.Msbuild.fs#L56-L67 — вот это мне не нравится. Повторы вида\n```match settings.Target with\n| [] -> ()\n| lst -> yield \"\/t:\" + (lst |> String.concat \";\")```\nхотелось бы сократить.","401":"Он добавляет когнитивной нагрузки и решает проблемы с транзитивными зависимостями. Даёт больший контроль над версиями всего подряд, стратегии ресолва и пр","402":"Оказывается, алиасы на struct tuples надо обязательно брать в скобки.\n```type A = string * string \/\/ valid\ntype A = (struct (string * string)) \/\/ valid\ntype A = struct (string * string) \/\/ invalid!```","403":"@vshapenko Я все собираюсь написать в блог о том, что там было не так и как надо, но все времени нет.","404":"В лок файле ктрл-ф сделай по систем.буфер","405":"Ну тогда не ясно как тебе действовать","406":"https:\/\/youtu.be\/9zpG_hJsrL8?t=241\nТайминг приблизительный, потому что я без наушников.","407":"В твоем случае есть зависимость от глобального состояния.","408":"давайте во флудилку","409":"Привет!","410":"https:\/\/t.me\/fsharp_flood\/27290","411":"- https:\/\/fslab.org\/FSharp.Charting\/\n- https:\/\/fslab.org\/XPlot\/","412":"Ну типа такие доклады вызывают вечно кучи споров потому что мало кто пробовал это реально в проде. А реально в проде оказывается что всё не так просто","413":"Довольно живой чат. :)","414":"А было бы не плохо для подаванов","415":"ну тоже норм, да","416":"уже ж ТП предлагали","417":"let elem1 = ...\nlet elem2 = ...\nInlineKeyBoardMarkup [elem1; elem2]","418":"А тебе зачем?","419":"А логер куда скидывается по умолчанию?","420":"Это больше концептуальный вопрос)","421":"прост xDD","422":"Эта та что про `type extensions`?","423":"Пример вроде простой","424":"Ты переопределил генерацию стрингов вообще или для полей рекорда?","425":"Воще кул будет!","426":"Флудилка в соседнем чате, напоминаю","427":"Думаю, если еще позаниматься оптимизациями, то вполне можно уменьшить это время еще на 1 минуту и 24 секунды.","428":"но оно хотя бы тут есть)","429":"то что F# развивался, бесспорно. И синтаксис и фичи. Но всё же, всё же, именно OCaml был прообразом F#","430":"А то забуду","431":"неа, один фиг","432":"Второй заругается, если `+` - мономорфный","433":"если хочется побыть __нитаким__, то пиши уже `(box >> isNull) result`","434":"только я это чутка по другому вижу))\n```пытайся загрести жар чужими руками... ну а если дураков нет, то иди их искать - вдруг другие дураки уже сделали чё те надо))\n```\n😁😁😁","435":"Sort, filter вполне могут работать без создания нового массива","436":"Я бы хотел рельефную :3","437":"наилучшее предложение, которое есть в фп - ReaderT","438":"Не всё так гладко)","439":"у меня часто обратная задача возникает - исполнить на клиенте то что с сервера пришло","440":"@angmarr Ну, и тебе нужен будет не один класс Context, а набор классов, параметризуемых контекстом.","441":"Ого! Очень круто","442":"В большинстве случаев гораздо удобнее было смотреть на него как раньше, через Repository окно, и открывать только в случае необходимости","443":"(c d)","444":"Еще кажись, было недавно, File.Move не работал на флэшке или Rename","445":"Не, вариант с шудулером и офхип памятью круче - ты там можешь под каждую таску аллоцировать буфер. Более того, если таска\/джоба холодная, то и аллоцировать не надо. А если она отработала\/отменилась\/упала, то её буфер почистить и дать кому-то другому!","446":"Авалонию уже можно считать production ready?","447":"вот в том-то и дело)))\nа если б нынешний `fold` был бы `\"как reduce на стероидах\"`, то у меня бы был и нынешний `fold` и `\"reduce на стероидах\"`","448":"тебе никто не мешает его хранить в каком-нить ConcurrentDictionary","449":"Василий SqlClient портирует под неткор.","450":"им буду пользоваться многие кто окажется на сайте","451":"","452":"","453":"да не, Measure же на для алиасов нужны. это удобный способ сделать обёртку, которая будет помогать во время компиляции, но в рантайме от неё никакого оверхэда не будет","454":"то есть, даже в вырожденой ситуации начинаются сложности. что уже говорить про банальный пример из википедии","455":"Я - да. А ты?","456":"Можно. \nПрям помню, что тут обсуждалось как-то.","457":"А если несколько аргументов? А если нужно не одно выражение, а несколько?","458":"тогда было бы понятно, какая абстракция лучше подходит для решения задачи - конечный автомат или кастомная алгебра","459":"У тебя там больше или равно","460":"а","461":"проще тогда не хранить","462":"и конечное кол-во","463":"Спасибо!","464":"Не надо, очевидно","465":"Типа \"%custom\"?","466":"Запись приблизительно соответсвует:\n```type A = ...\ntype A with \n    member this.B ...```","467":"А если хочешь и акторы, и ажур и вижуал студию?","468":"Ну, тут логично. Там же тонна перегрузок, какую выбрать?\nТекст ошибки супер дурацкий, да","469":"теперь методы в типах можно не писать сразу под обьявлением","470":"И `ResizeArray`.","471":"вот наверное это https:\/\/t.me\/fsharp_flood\/231733","472":"А, нет","473":"Это был странный самопальный протокол","474":"Вообще может быть тоже дебаг вью, а в целом наверно потому что методы там выполняются на прямую же","475":"Скорее всего `AsyncSeq` придется тащить.","476":"я там вообще аборигеном буду. позже зайду, когда побольше узнаю :)","477":"Привет. :)","478":"А ответ был о том, что здесь он не нужен и вреден 😊 А если я хочу сделать что то в стиле ООП, то конечно никто не мешает. Просто хочется от него (ООП) уйти подальше, дабы не пах 😊","479":"констрейн на то что генерик является ненаследуемым типом?))))","480":"Тут еще сильно зависит от количества вакансий","481":"```open System.Collections.Generic\ntype DictBuilder() =\n    \n    member __.Yield (key, value) = Seq.singleton (KeyValuePair(key, value))\n    member __.Zero() = Seq.empty\n    member __.Combine(x,y) = Seq.append x y\n    member __.Delay f = f()\n    member __.Run (pairSeq: KeyValuePair<_,_> seq) =\n        Dictionary(pairSeq)\n        \nlet dictionary = DictBuilder()\n\nlet a =\n    dictionary {\n        1,2\n        2,3\n    }```\n\nможешь ещё так забацать","482":"Как deriving в хаскеле","483":"Ну вот я так же считаю","484":"https:\/\/mobile.twitter.com\/gsomix\/status\/940159910070947841\/photo\/1","485":"Там решили вопрос по-братски: в коде, в котором оно используется как валидное имя аргумента, всё продолжит работать по-старому: например, `Func<int, int> x  = _ => _;`","486":"https:\/\/i.imgur.com\/pImY58m.png","487":"Все","488":"Сегодня посравнивал kestrel vs wcf, оказалось что wcf быстрей, хотя ожидал обратное","489":"oracle)","490":"А примера под .net core + vmware не было?\n\nКстати, помню поднимался вопрос \"почему multi-dimensional arrays тормознее вложенных?\"\nТам еще был типа-бенчмарк, так он на моем маке под core работал в 1000 раз медленнее чем на mono.","491":"Вот теперь как надо работает","492":"норм","493":"С историей проблемы знаком? Проблема вернулась или решение ещё не доехало?","494":"Круто, обращайся)","495":"Да тут пока по F#)","496":"так чайнить неудобно","497":"Начальное значение аккумулятора","498":"Ну то есть вот у тебя есть\n```let HudLayer = LayerProperty(zOrder=3, tag=3)\n\/\/ а дальше\nlet hudLayer = HudLayer(viewSize, config, viewModel)```\n\nЧто тут имеется в виду?","499":"https:\/\/github.com\/theimowski\/SuaveMusicStore\/tree\/contents","500":"есть skip worktree, я им пользуюсь","501":"Как ты отличишь его от конструктора? Может ты хочешь два раза его применить.","502":"@brud90  очень круто, что у тебя тоже ошибка вывалилась — без этого шансы найти причину стремились к нулю. Ошибка появлялась лишь на достаточно большой порции данных, где много чего отвлекало","503":"не PONV? :)))","504":"Цели схожие, но механизм реализации совсем другой.","505":"оператор + !","506":"Без всяких AP, и должно отлично работать, если реализуют FS-1024.","507":"Всмысле?","508":"Dictionary","509":"Райдер уже заждались (я нет)","510":"Правда там структуры быть не может ибо матчинг выведет референс, но все же, выглядит менее ужасно)","511":"Кто-то сталкивался с таким при подключении библиотеки? на c# проект нормально встает и собирается с ней. Сама, там есть исходники - https:\/\/www.nexusmods.com\/skyrimspecialedition\/mods\/21294\nавтор пишет что для любого дотнет языка, но я сильно сомневаюсь что кто-то что-то кроме c# юзал.\n\nУ меня нагуглить такое не вышло.","512":"Точно) спасибо)","513":"а, не","514":"Не зарепортили. Я себе разве что записал глянуть.","515":"оу\n\nUse of `module rec` can alleviate some pains in not being able to write mutually referential code between types and modules.\n\nне знал об этом даже. я читал книгу по F# 3.0, а это появилось в 4.1","516":"Есть C# класс в котором делается FirstOrDefault над перечислением фаршевых рекордов. Default для рекорда - null. Как проверить рекорд на нулл? :D","517":"Какая-то несогласованность выходит однако с докой, ну и смысл этого самого Unsafe.AsRef напрочь теряется(конвертация из inref в byref).","518":"Но надо запустить","519":"у тебя же работает так (Alt.unit() ^=> Alt.never) <|> timeout","520":"В riak можно и lww и самому разрешать конфликты","521":"можешь начать курить отсюда https:\/\/github.com\/fsharp\/fsharp\/blob\/24c798bfcee5d6f91ae2c19888baeb9946744c3a\/src\/fsharp\/FSharp.Core\/printf.fs#L1612","522":"спроси у него)","523":"тут бабка на двое сказала, там прирост скорее всего будет микроскопический на фоне IO","524":"Фича хорошая, но её дизайн в ТС всратый. Задизайнить её во фшарпе - занимает время.","525":"Точнее они там игнорируются","526":"да, но он просто выглядит удобнее и для него не нужна либа, можно сразу сынтерполированные строчки кормить ILogger напрямую","527":"Ты б посмотрел на какой инструкции висит","528":"https:\/\/github.com\/fsharp\/fslang-suggestions\/issues\/968#issuecomment-764636595","529":"это детали реализации твоей","530":"```File.ReadLines(\"test.txt\")\n|> read\n|> Seq.iter (printfn \"new line: %s\")```","531":"https:\/\/github.com\/dotnet\/core\/blob\/master\/release-notes\/3.0\/3.0.1\/3.0.1.md","532":"И вот собственно мы рассмотрели две самые крупные проблемы ES: моделирование и высокая стоимость","533":"Апдейт - просто выкидывает сообщение и возвращает тот же стейт, что и получил, а вьюху придётся написать","534":"Блин ну у меня из-за пандемии нынешняя компания по крайней пизде пошла, так что я немного знаю:)ъ","535":"Он страшненький.","536":"В самом первом варианте делал Дон, а я потом несколько раз чинил протекшие референсы на FSharp.Core","537":"Ну вот хочется узнать объем данных","538":"@fvnever Передайте господину Алексу спасибо. ;)","539":"он не сортирует, он выбирает 10 максимальных\/минимальных","540":"т.е. сделай что-нибудь юнитовое, если в Option хранится Some, иначе просто верни unit","541":"^","542":"А ты перепиши и сразу можно открывать!","543":"Asyncpost","544":"не, оно там чекает поле в объекте IVar","545":"Привет!","546":"```#r \"System.Security.Cryptography\"\nopen System.Security.Cryptography.X509Certificates```","547":"ну мне кароче не ясна семантика, если мы выделили дубликаты по обоим границам. то дубликаты по одной границе надо искать только среди оставшихся или, если одна граница совпадает с чем-нибуть из уже выделенных элементов, это считается или нет.","548":"Последние лет 5 стараюсь код с  Task с особой острожностью  в HotPath пилить, там где надо параллелиться-Parallel обычно использую с пониманием-что конкретно параллелю, это если CPU жалко и на латентность класть, если не жалко и латентность ребром-Disruptor. В основном Task торчат с LongRunning. Но это мне везет-велосипедов много, построенные изначально без Tasks, поэтому нет нужды всю эту асинхронность по всему стеку вызовов тащить, ну и задачи достаточно специфические(голый TCP\/IP, свои реализации вебсокетов и вот этого всего)","549":"Тут пофиг, по идее","550":"А там дело не в резалте. Там дело в том, что ошибки валидации в том виде, как это описано у влашина, могут быть только списком строк. Мне это не подходит например","551":"А потом мне прострелили колено!","552":"Был один безумец, который хотел сделать (не я), но пока там не пошло, вроде.","553":"namespace Vladislav","554":"Странно конечно. У меня есть опыт разработки инфры что и 1.5М rps тащила с полной персистентностью каждого запроса.","555":"Спасибо.","556":"Давай уже её в стд либу","557":"Секта добровольной формы","558":"Бля.","559":"кстати тоже удивительно, но это скорее специфика. У меня был знакомый, он мог хорошо решать узкие алгоритмические задачи в коде. Но сам код писал ублюдски","560":"ну если сравнивать первые 2, то 25%. Плюс я думаю что 3700x - не самый показательный проц в разрезе однопотока. Тут либо Intel 10+, либо Ryzen 5xxx","561":"Семантика у них другая, с функционально точки зрения они хуже (зато перформанс лучше, это да).","562":"Чтобы без либ лишних, а с обычным Текстом","563":"Кто подскажет как решить задачу валидации свободно введённой текстом страны? Она у нас либо Google Address подставляется, либо вводится руками","564":"Нормас, там этих пропертей обычно от 10 до 100 штук.","565":"Суть в том, что у меня есть два совершенно разных резалта, и мне нужно сделать что-то одно, если они оба успешны, и что-то другое, если оба или хотя бы один из них — ошибка","566":"Выкини его, замени мсбилдом, и будет счастье","567":"какой-то lru кеш","568":"ты пишешь код напрямую) просто вместо Task у тебя Program","569":"улучшить можно, просто есть ощущение, что изящно и тем более просто такое не решается","570":"С ростом размерности задачи обычная сортировка начинает побеждать :)","571":"а dotnet build не ругается?","572":"Вот отсюда взял бенчи и под свое двигло запилил https:\/\/github.com\/Doraku\/Ecs.CSharp.Benchmark","573":"Сейчас же уже новый инструмент - Azure Machine Learning Workbench","574":"Каким образом?","575":"[sn](tg:\/\/user?id=446310692) устоявшегося общепринятого подхода к композиции в фшарпе сейчас нет. Можно выбирать из следующих вариантов:\n- Инжектить сами функции в функции через паршал аппликейшн\n- Использовать шаблон интерпретатор\/фри монаду\n- Использовать классы и DI","576":"Ну, вот тут дискард точно использован по назначению","577":"ой всё","578":"У меня вот щас есть\n```module MyModule\n\nprintfn \"MyModule init\"\nlet pi = 3.14\nlet area r = pi * r * r```\n\nИ в другом файле\n```[<EntryPoint>]\nlet main argv =\n    printfn \"Hello World from F#!\"\n    printfn \"%A\" (MyModule.area 1.0)\n    0```","579":"Как образец так сказать того что сейчас","580":"А что за НКТ?","581":"Действительно","582":"пример","583":"😭","584":"А, тогда да, должен. Думал там что-то arbitrary.","585":"из-за паддинга возможно отсутствие эффекта","586":"Абсолютно согласен","587":"по крайней мере если смотреть через призму дотнета и структур","588":"ну я где-то через неделю-другую буду пробовать maui, расскажу как там","589":"Но ныть о том что их нет проще","590":"(я надеюсь, это никого не обижает; если обижает — скажите, удалим)","591":"Ящик водки","592":"https:\/\/docs.microsoft.com\/en-us\/dotnet\/fsharp\/language-reference\/pattern-matching#record-pattern","593":"Я имел в виду просто прочитать про стейт машины - ну в целом что это такое. Потому что они в целом везде плюс минус одни и те же","594":"надо было вчера приходить на митап :)","595":"Аллокация!","596":"Ну нет. Можно создать hashtable всех непроверенных индексов чтобы не проверять их ещё раз","597":"Не помню  точно","598":"И все это очевидно ломает вывод типов. Если так хочется точек, наверно можно просто на c# писать","599":"эксепшены медленные, да","600":"min(current,currentjob)","601":"Просто с еррором еще","602":"Да.","603":"Ты ж хочешь из монги Model достать","604":"Да, я тоже подумал об этом.","605":"да, я там ссылку закидывал на этот чат","606":"Разумеется, пользоваться должно быть легко. Но это НЕ значит, что легко спроектировать и реализовать то, чем легко пользоваться","607":"Вот кстати, были би они синглтонами, то могли бы и интерфейсы реализовать (были бы ближе к окамл модулям).","608":"ок =)","609":"Памяти под очередь много?","610":"(но не лямбды)","611":"что?","612":"ionide __несколько нестабилен__.","613":"как можно компилить анонимные функции в рантайме?","614":"какая-то хрень с билдом :(\n```error MSB4018: Microsoft.NET.HostModel.HResultException: 8007006E```","615":"неплохо","616":"Заканчиваю выпиливать Paket из FSharp.Data.GraphQL\nЧем мне заменить возможность Пакета выкачивать файлы с GitHub?","617":"Это грубо говоря void, который превратили в тип","618":"```    let list = [ [box userId; box userName; box firstName; box lastName; box timeStampUTC; box serviceName; box serviceGuid; box uahSpent] ]\n    let newlist = List.map (fun i -> i :> IList<obj>) list```\n\nна самом последнем слове (list) пишет \"the type obj list is not compatible with IList<obj> \"","619":"__**moi gisti**__","620":"Давно. Я даже RFC написал же.","621":"Всем привет.\nУ кого в солюшне смешаны c\/f sharp и LangVersion задаётся из `Directory.Build.Props`, как вы добились отсутствия конфликтов на конкретных значениях?","622":"Странно. Обычно так дефолтное значение задают","623":"щас","624":"а чо не так?","625":"ну написал на C# ну и че","626":"Плюс F# нет в JVM мире, там темно и грустно","627":"https:\/\/sharplab.io\/#v2:DYLgZgzgNALiBOBXAdlAJiA1AHxgTwAcBTAAgA0SBeAWACgSGSA3AQ2BIDEB7LkEiGPACWyAOZ1GzNiQBCLeHwHCxExsiIB3ABRgoJAEYBKKiQDenHibABuWfJP6SAXzqvawIjBIjgI0mEstXnJjGnpGAFsWGABjAAsSLgA6bi49ZLl4Eg0hGDjVBmwSZERgYD0SspIAWgA+EgJlGDBkEgASACIZLjzi0uAOgpIigLS+qrqGppb2jtTvCGKe8dASAFIAQVNRp0HwwpW9fXtJqZFm1s7urgWlr0rVzdNj+F2hkZ4jk\/rG85mrnoJZDLB57NweLwsEzqDTkLQAVWQ8SIMQA1kQ0Ek0EQwCxSjAuGAADxKESiWp6RHItEYrE4vHAAnE0liWqGOgQgzQzRwjqjDqUpFxFHozHY3H4wkkwRktkczwkGLc2FkBFCkW08UMpnS5TkvQdF4ddnuBVoZW8\/kGo0muijEgsO2WfROm4xV0kNBAA===","628":"я не уверен где кончается ручками, а где начинается орм","629":"ват","630":"Гопаком пахнуло","631":"не слушай брюзжателей, курс норм, и лучше вторую часть потом тоже. камл я тоже прошел, но пользы меньше","632":"Не могу понять что эта зараза от меня хочет\n\n``````\nopen System\nopen System.Reflection\nopen Microsoft.EntityFrameworkCore.Storage\nopen Microsoft.EntityFrameworkCore.Metadata\nopen Npgsql\n\ntype NpgsqlDiscriminatedUnionEnumTypeMappingSource(dependencies, relationalDependencies, sqlGenerationHelper, options) =\n    inherit NpgsqlTypeMappingSource(dependencies, relationalDependencies, sqlGenerationHelper, options)\n\n    \/\/member private _.FindMappingInternal(mappingInfo: inref<RelationalTypeMappingInfo>) = base.FindMapping(&mappingInfo)\n    \/\/override mappingSource.FindMapping(mappingInfo: inref<RelationalTypeMappingInfo>) = mappingSource.FindMappingInternal(&mappingInfo)\n\n    member private _.FindMappingInternal(``type``: Type) = base.FindMapping(``type``)\n    override mappingSource.FindMapping(``type``: Type) = mappingSource.FindMappingInternal(``type``)\n\n    member private _.FindMappingInternal(``type``: Type, model: IModel) = base.FindMapping(``type``, model)\n    override mappingSource.FindMapping(``type``: Type, model: IModel) = mappingSource.FindMappingInternal(``type``, model)\n\n    member private _.FindMappingInternal(``member``: MemberInfo) = base.FindMapping(``member``)\n    override mappingSource.FindMapping(``member``: MemberInfo) = mappingSource.FindMappingInternal(``member``)\n\n    override _.SetupEnumMappings(sqlGenerationHelper: ISqlGenerationHelper , dataSource: NpgsqlDataSource) = ()\n``````\n\nThis type is 'abstract' since some abstract members have not been given an implementation. If this is intentional then add the '[<AbstractClass>]' attribute to your type.\nThe override for 'FindMapping: Type -> CoreTypeMapping' was ambiguous\nThe override for 'FindMapping: Type * IModel -> CoreTypeMapping' was ambiguous\nThe override for 'FindMapping: MemberInfo -> CoreTypeMapping' was ambiguous","633":"Привет!","634":"т.е. у каждого жоба - триггер с кроном + потенциальный \"одноразовый\"","635":"```let inc (a: byref<int>) = \n    a <- a + 1\n\nlet mutable i = 0\n\ninc &i\n\nprintfn \"%d\" i \/\/1```","636":"Оно никогда особо не жило","637":"А, или вообще Falco.","638":"я всю книгу два раза прочитал. Концовка у неё особенно охуенная","639":"Где b это контекст","640":"Я видела когда-то ассемблер мипса","641":"Наллаблы будут юнионом типа и null:\n\nlet (foo: string | null) = \"foo\"","642":"Наследование при описании данных точно нужно. Я не понимаю людей которые для гейм проектов берут SQL и поверх городят EF. Просто берешь Монгу и пишешь данные в ООП стиле","643":"кто мешает?","644":"https:\/\/github.com\/dotnet\/fsharp\/issues\/13122","645":"да. с главной страницы","646":"если у нас есть время, почему бы и нет :)\n\nа про готовый код - переписка выше","647":"Слушай, а в рекорды оно не умеет? Какие типы ему туда вообще можно скормить?","648":"Ну питоновский интерпретатор умеет запускать архивы","649":"Это только асинхронные. А ответы на клиентские - через client dispatch","650":"Так люди кушать хочут","651":"дружит. Сериализуешь в бинари, десерелизуешь из бинари. все ок","652":"https:\/\/blogs.msdn.microsoft.com\/dotnet\/2017\/03\/14\/announcing-nightly-releases-for-the-visual-f-tools\/","653":"Там гопак?","654":"Дратути","655":"спасибо)","656":"#r директива","657":"Утро.","658":"Я видел такое, и мне чёт не очень нравится.","659":"Инлайн-функцию по ссылке не передашь :(","660":"Как мне это сделать?","661":"а вот railway интереснее, да?\n\nrequest\n|> validateRequest\n|> updateUser\n|> sendEmail\n|> toHttpResponse","662":"+1","663":"ща набросаю че-нить","664":"Ну, ок. Не забыть бы только.","665":"воркеру поди история нахер не упёрлась, а только финальный стейт","666":"Ещё Choice можно","667":"В Msg только клиентские сообщения","668":"Привет!","669":"Привет. :)","670":"Я точно делал не раз вложенные CE","671":"o\/","672":"спасибо, понял","673":"я думаю, что заработает","674":"(если с форматом только вызвать)","675":"И снаружи никто не увидел разницы?","676":"Не 'self, 'iter","677":"А можно пример синтаксиса такого шаблона?","678":"","679":"спасибо","680":"Лойс","681":"не про fable\nпросто плодить валидные экземпляры, без доп условий\nНу если будет настройка аля int у нас от сюда и до обеда, то прекрасно","682":"Неплохой вариант, к слову, делаем сущности на сишарпе, запускаем миграции, а потом через Query Expressions общаемся с бд","683":"т.е. в норм браузере кажется никакого ограничения нет.","684":"И будет человеческий this везде без оверхедов","685":"Тут скорее CE с условиями","686":"Кому, кроме меня, интересно закрытые смотреть?","687":"https:\/\/marketplace.visualstudio.com\/items?itemName=annsk.alignment","688":"Надо почитать статью, шоле","689":"Ты серьёзно?\nF# https:\/\/benchmarksgame-team.pages.debian.net\/benchmarksgame\/program\/regexredux-fsharpcore-6.html\nC# https:\/\/benchmarksgame-team.pages.debian.net\/benchmarksgame\/program\/regexredux-csharpcore-8.html","690":"он же платный вроде","691":"А что если будет невалидно? Является ли это исключетельной для исключений ситуацией?","692":"Falanx или Phalanx, не помню","693":"сравнивать на null намного быстрее, чем на потенциальный возможный пустой option","694":"Чтобы каждая ф-ция была польностью независима от контекста","695":"Мне чирон показался наиболее __идеоматичным__ для F# именно","696":"так что ли?","697":"Доктор выше написал","698":"как в воду глядел)","699":"Особенно `Seq.sortBy` волнует, который делает копию в массив и сортирует его.","700":"через докер запущу подшелл с curl запросами","701":"привет, пытаюсь прикрутить AutoMapper к F#, даже вполне получается, но туплю насчет open generics. Как их в F# обозначать? То есть мне нужно написать что-то вроде `typeof<Result<,>>`, только в синтаксе F#.","702":"Загрузил я данные с диска, а теперь хочу сделать текстуру.","703":"@fvnever файлы разора в `dotnet new mvc -lang F#` открываются без ошибок?","704":"Но строка да к существующей схеме должна быть","705":"я типа заставляю себя учиться правильно печатать 16-пальцевым методом. поэтому дополнения отключил","706":"Это огонь!","707":"обещал","708":"F# не поддерживает получение значения через квадратные скобки `obj``[\"Key\"]`?","709":"F# прекрасно позволяет пользоваться чем хочешь","710":"по нормальному это что именно? без всех этих действий?","711":"С C# работает","712":"Ну, это случается. Молодец он конечно","713":"Наивный ждун\n```let waitUntilReady () =\n    let mutable isReady = false\n    document.onload <- fun ev ->\n        isReady <- true\n        ()\n    while not isReady do\n        System.Threading.Thread.Sleep(40)```\nНо `onload` почему-то не вызывается","714":"AP можно переиспользовать.","715":"мне не нужно правильно с kprintf, мне нужно в песочнице поиграться с пайпами и прочим nodejs","716":"А как её обычно делают?","717":"Тут проскакивала новость что думают над добавлением тайп-классов в .NET","718":"В целом, можно свой expression  написать, по идее","719":"Ну в джаве классы, а у нас зборки","720":"в тегах csproj написан","721":"а что, в XNA всё точно также?","722":"Мы прям при тебе, в этом чате их планируем починить.","723":"нет. в студии не так","724":"Блин, а вот теперь у меня более лютая ошибка.","725":"Жираф раньше появился, и там композабельность гибче","726":"https:\/\/sharplab.io\/#v2:CYLg1APgAgTAjAWAFBQMwAJboMLoN7LpGYZQAs6AsgBQCU+hxTUcAnNQArUAkARHpQCGAFwAWAOg4BJAL69atANyMiMlenVpMcAAzouAMQD2AJwC2I4YIBGAGwCmAZWEmAlgDsA5ugDOtdQRITMwA7L7iACpGzm5edMpBxGpIMkA","727":"просто в ноде так вроде сделано - думал может и F# тоже","728":"Я очень надеюсь на продолждение работы над SRTP.\n\nhttps:\/\/github.com\/Microsoft\/visualfsharp\/pull\/3582","729":"serilog","730":"Bpmn  в свое время прекрасно описывалась в rdn  нотации","731":"Из экселя достать столбец и записать в файл, который можно прочитать из фортрана.","732":"уже не актуально","733":"Особенно когда все есть для того что бы было","734":"Во всех операциях этот токен чекается","735":"https:\/\/github.com\/eiriktsarpalis\/TypeShape\/tree\/main\/src\/TypeShape\/HKT","736":"Ага","737":"а куда такой инсерт?","738":"или криптой барыжишь? :))))","739":"Не нужно","740":"и все прямо ЛЕТАЕТ","741":"Ну как же не затолкать)","742":"ну я в кавычках \"поток\" потому что должен писать, надо говорить лишний таск создастя","743":"Хоть начинай блазор смотреть","744":"наверное стоит тот сниппет все же применить","745":"error FS3033: Поставщик типов \"FSharp.Data.Sql.SqlTypeProvider\" сообщил об ошибке: Could not load file or assembly 'System.Data.SqlClient, Version=4.2.0.0, Culture=neutral, PublicKeyToken=b03f5f7f11d50a3a'. The system cannot find the file specified. [\/Users\/neftedollar\/work\/inhabit-viewer\/src\/Server\/Server.fsproj]","746":"там этот match вообще выбросить надо он в лучшем случае 2 раза по коллекции идет в худшем 8","747":"убирает сразу целый пласт ебанутых вопросов на собесах","748":"https:\/\/amplifying-fsharp.github.io\/ - какая то новая инициатива","749":"А потом ещё через секунд 5 подстветка и подсказки(существует вероятность что они даже не появятся)","750":"Решарпер работает со всеми фреймворками сразу и может это делать параллельно.\nДля FCS каждый фреймворк в проекте — отдельный проект, для которого нужно построить кэши и выводить типы для всех файлов последовательно до того, о котором IDE просит инфу. С учётом того, что все запросы к FCS складываются в его общую очередь и обрабатываются им последовательно, оно начинает работать ощутимо медленнее на больших\/сложных проектах, вроде самого FCS.","751":"Но я, честно говоря, не знаю, как такие констрейнты должны работать","752":"Запускай неткор FSI","753":"Посмотри в модуле Map","754":"Опциональные параметры это не функциональненько, я думаю смысла нет заморачиваться с этим, если честно","755":"благодаря вам я вспомнил чо он делает","756":"Неа, нельзя. Есть существенные ограничения.\n\nТайпкласс я могу реализовать для __чужого типа__. Например, для `System.Int32`.\n\nСистему из констрейнтов я не смогу реализовать для чужого типа. Потому что SRTP «не видят» методов раширения, которые я в чужие типы добавляю.","757":"Команда или запрос к железке.","758":"Нужно писать \n`dotnet \/path\/to\/fsi.exe`","759":"структурка вроде маленькая","760":"для жэтого в орлинсе есть StateLess Worker","761":"Бабушка с синими волосами","762":"Вот к слову. Стоит ли определять сртп на сложение как `^a -> ^b -> ^c` , или всё же как `^a -> ^a -> ^a` ? Мы же, вроде бы, складываем один тип, нет?","763":"а там прям про то `\"как работает инфраструктурный уровень в .NET\"`\n??","764":"Я вот до сих пор забываю че там эти рыбки значат когда уже лет 5-6 фшарп трогаю, или сколько там","765":"да, ты прав - тупанул)))","766":"F# просто как инструмент =)","767":"Я думаю, это не извращение, а как раз наоборот. Я в F# новичок, но сразу бросилось в глаза этот if, который выглядит как инструкция. А в F# везде выражения. Твоё решение - это как раз больше похоже на выражение. Видимо, этот if как-то так вычислялся, что влияло на результат maybe.","768":"Да, конкретно в sqlite.","769":"Понял","770":"окамл это нагроможденный кучей треша МЛ который с 85 года не могут превратить во чтото юзабельное. в котором только в 2017 одуплились с implicit modules, в котором как дауну нужно писать `Mod.run(context)` вместо `context.run`\nс клоунадой с модулями как интерфейсами но не модулями как типами. Клоунаду с тильдами, +. изза которого код выглдет как руби под кислотой\n\nf# это мл в котором таки сделали нормальное связывание данных и кода, напилили фичей. на проблемы композиции он отвечает совершенно другими инструментами","771":"`Uses of this construct may result in the generation of unverifiable .NET IL code. This warning can be disabled using '--nowarn:9' or '#nowarn \"9\"'.`","772":"там Async<unit>","773":"И когда мне они нужны (чтобы написать очередной автофелляционный импортер данных) — мне не в лом окамл запустить","774":"Думал может \"перформанса добавит\", за счет явного инлайнинга","775":"Может, и правда персистентным вектором фигануть, а?","776":"Дык а что надо в итоге?","777":"Где","778":"Каждая формула, которую я видел делает меня страдать. Хуже матиматиков переменные называют только физики","779":"ну вообще можно, я видел примеры...","780":"Спасибо )","781":"Какие исходники?","782":"А вот это интересно. Особенно что такое первое","783":"Тут не нашло","784":"вполне ж","785":"да","786":"Чтоб она кидала ворнинг или еррор, если не получается сделать хвостовую рекурсию.","787":"да в том то и проблема что то ли я тупой то ли в фаршной библиотеке тупо нет нужных методов\n\nну вот[ например](https:\/\/plotly.com\/python\/3d-surface-plots\/), колупаюсь в доке\nне совсем то что нужно, но пойдет\n\n в фарше же есть только withTraceName который делает вообще фиг пойми что, но не то что нужно","788":"Куда-то \"раскраска\" fs подевалась :(","789":"Никаких насколько я знаю. Только через консоль","790":"И даже средних","791":"\"Ретрогад\" фшарпер-это оксюморон же 😃","792":"Чем SDK","793":"* Если переставить паттерны местами, то всё равно будет работать. Потому что список либо пустой, либо можно отделить голову. Случаи не пересекаются","794":"Мда","795":"Мастер слейв","796":"а теперь можно поподробнее про рекурсивные объекты?)","797":"это работает если не делать Seq.toArray","798":"Я это словосочетание только в одном RFC видел.\n> F# RFC FS-1071 - Witness passing for quotations","799":"Там зубы?","800":"+ в моём случае ответ на один запрос может сильно повлиять на все остальные активные запросы (например, отменить их)","801":"Ты еще не пробовал LineLens в Ionide? 😏","802":"А, ты про тест бота)","803":"можно рассматривать не сфероконей а dependency rejection","804":"а, ну да","805":"https:\/\/github.com\/fsharp\/fslang-suggestions\/issues\/629","806":"Нет иммутабельности на уровне компиляции","807":"NAncy из-за роутов юзаете?","808":"```let digit n number=\n number\n |>string\n |>Seq.item n\n |> (fun c->int c-int '0')```","809":"https:\/\/docs.microsoft.com\/en-us\/dotnet\/api\/system.diagnostics.debugger.break","810":"Чтобы руками не писать","811":"https:\/\/t.me\/fsharp_chat\/203601 😄","812":"Но я не понимаю как так сделали и нахрена","813":"И его можно реализовать на типе","814":"там мб падает только если таргет проекта в .net 6 поставить?","815":"Интерфейс колл заметно больше по времени директ колла. Перф чутка должен же просесть..","816":"А какие приколюхи ещё есть в F#(тайп провайдеры вычёркиваем)? Чтоб прям потрогал и сразу хорошо на сердечке.","817":"Я все равно не понимаю бизнес задачи, которая привела к такому решению","818":"Работа программиста уже сейчас не настолько востребована. Программист - это узкий специалист, призванный выполнять технические задачи. Сейчас более востребована работа разработчика и инженера. Разработчик решает бизнес задачи, а не технические. Разработчик не привязан к инструментарию и может его менять. Также он проводит исследования и выявляет наиболее оптимальные пути решения задачи. Если говорить короче, то разработчик - это творческий человек.","819":"Ах, если бы)","820":"Да, действительно, спасибо","821":"Find usages глянь","822":"https:\/\/i.imgur.com\/Sqlwp3H.png","823":"@fvnever ок. Там хватает работы по причёсыванию. Про сериализацию непонятно, непонятно сколько там работы с Hyperion. Ну и, честно говоря, самому с нуля эти пиклеры сделать имхо проще. Я их в xake уже разных много писал","824":"А там разве будет разница?","825":"Дв","826":"В той либе","827":"Возьми темплейт для giraffe)","828":"нашел сравнение акки и орлинса:\nhttps:\/\/github.com\/akka\/akka-meta\/blob\/master\/ComparisonWithOrleans.md","829":"Обнимемся!","830":"из-за сочетания паршл апликейшна\n\nвот как парсить это выражение?\na b c\n\nэто функция a с двумя аргументами b и с? \n\nили это инфиксная фукнция b с аргументами a и c?","831":"@neftedollar Ганс, неси огнемет","832":"ну они привыкли наверно. не знаю, ко всему привыкаешь же.","833":"Есть две джобы, которые никогда не заканчивают свою работу, и общаются между собой","834":"Автор страдал что по его прикидкам можно ускорить гопак ещё на 30%:\n\nhttps:\/\/github.com\/Hopac\/Hopac\/blob\/master\/Docs\/Internals.md#could-something-like-hopac-be-even-faster","835":"А в сишарпе одна ;. И кто тут победитель?","836":"","837":"Иконки в «Почму F#» никак не ассоциируются, уж извинити.","838":"Ну то есть отличий от (fun... ->) не то чтобы прям много","839":"https:\/\/dotnet.github.io\/orleans\/Documentation\/grains\/external_tasks_and_grains.html\nну если гуглить по заголовку находятся примеры с баловством с шедулером","840":"а вот counter где инкремент происходит JS само собой отвалился. Но вся остальная навигация, листание страниц на последней вкладке - все работает","841":"Это делается немного не так","842":"я не совсем понял, как работает этот киворд.","843":"ну в общем я так понимаю лучше написать свой резолвер answertype'ов","844":"Ладно","845":"Ну и смысл кора теряется","846":"ну семен семеныч, сколько людей столько и советов дадут. на красную площадь выди и начни там того этого ))\nкак уже выше намекали, \"правильно не говорить табурет, правильно делать табурет\" (c)\nкакую книжку надо читать сильно зависит от твоего багажа","847":"аррай2д из мл.нет не канает?","848":"Мне не нравится. :)","849":"ещё 6 человек надо до круглого числа","850":"ура, работает)))","851":"Array.iter","852":"у них структурное равенство, ты хочешь разные типы, одинаковые по структуре?","853":"у райфайзена не было трнсляции что ли?","854":"когда статичен","855":"Запись будет? Не могу заджойниться","856":"Потому что энкодинг для типов с 1 конструктором отличается для типов с 2+ конструкторами?\n\nЯ обычно пишу тип и прошу автоматику сделать toJSON, и это становится API","857":"хз - в скале видел в продакшоне и всё было ок","858":"Мемы.","859":"там он таков, что на его прочтение уйдет вся жизнь. но они (гуру) лезут откудато с уже полным знанием этого многотонного велосипеда","860":"Я просто хочу разделять поток преобразования данных и контекст исполнения","861":"а ещё есть array comprehension\n`[| for _ in 1..reader.ReadVectorSize() -> readFrom reader |]`","862":"ну вот мне нужно загрузить одну сущность в базу. для нее нужно взять ид другой сущности. чтобы взять это ид мне нужно DU сконвертить в строку","863":"https:\/\/github.com\/dungpa\/dsls-in-action-fsharp","864":"в орлинс я так и делал","865":"Если уже получен, то лучше не задавать 😊","866":"Но что в этом плохого?","867":"Тест валился всегда, ошибка была в тесте, а я искал в коде","868":"Туплы же структурная, если я не путаю..","869":"и смерть неизбежную","870":"ну вот тут нужные новые правила вида\n```{ if expr then cexpr0 else expr |}   if expr then { cexpr0 } else builder.Return expr\n{ if expr then expr else cexpr0 |}   if expr then builder.Return expr else { cexpr0 }```","871":"А по каким причинам? Потому что fsi долго не было на неткоре?","872":"не делать тесты инлайнами?","873":"то что оно теперь в будний день стало совсем неудобно","874":"В данном случае она зачем?","875":"Ну я хз, какие у тебя условия валидности","876":"С чего вдруг? Из js части там только плагин для вебпак (fable-loader), а сам fable на .net","877":"А в AsyncAwait  решаешь, нужен тебе новый заход или нет","878":"В принципе, проще (учитывая громоздкость объявления опционального параметра с помощью атрибутов). Но докуменатацию для каждого дублировать придётся","879":"Хах, вот засада, если сделать удобно для сишарпа, получается неудобно для фарша","880":"Есть, но скажем так через хаки, не так очевидно, скорее те кто знают f# поймут контекст, средний фронтер нет","881":"Я вот думаю что сртп не злоупотребляют направлю и налево только потому что оно не очень удобное и местами не очень понятное","882":"А на кой чорт ты делаешь так, а не через UMX?","883":"Кенселить?","884":"Видишь этот массив с о(1) доступом? Надо заставить его страдать!","885":"в смысле тебе всё равно в теле функции придётся получить экземпляр метода","886":"кстати в Райдере обещают завезти что-то интереснее для интеропа С# <-> F#","887":"Ок","888":"в одну строчку в общем","889":"Hey!","890":"а нет, работает","891":"ну вот он решил подправить статы))","892":"Дак вариантов нет, в сишорпе функция - делегат под капотом","893":"Которую надо решать увольнениями и расстрелами","894":"Привет, ребят.\nЕсть либа для MQTT под фарш? Делаю лабу для универа по IOT, кроме того чтобы использовать MQTT требований никаких.","895":"Nullable и есть опшон","896":"Если вам норм - пожалуйста","897":"Jvm умеет жи","898":"Такое хрупкое говно, что лучше его вообще не использовать. Есть курсец вроде на плурал сайте. Я когда то хотел сваггер тайпровайдить","899":"\"as rich\"","900":"5, PROFIT, тонны денег, любовь женщин","901":"кому-то не похер","902":"Я когда в последний раз смотрел, у него очень грустно всё было с поддержкой редакторов и IDE","903":"https:\/\/courses.mipt.ru\/course\/MIPT\/f_sharp\/","904":"сейчас тз нет","905":"какой тебе поиск нужен? чем плох индекс оф? `.Where` пойдет?)","906":"Моногейм и под виндой работает) и","907":"Хорошо, что в Ionide стабильность.","908":"безотносительно бага, какой тип компилятор вывел у expected? object?","909":"у меня есть очень простой пример, но для старта посмотри https:\/\/github.com\/leviysoft\/QuotationTranslator\/blob\/master\/QuotationTranslator\/Translator.fs","910":"http:\/\/kcieslak.io\/Reinventing-MVC-for-web-programming-with-F","911":"да, помогло, спасибо","912":"У#","913":"работодатель моё личное время жалеть не должен?)","914":"надо же ставить себе задачи чтоб учить язык)","915":"ну и ты точно также в Int32 или что-там у тебя будет - упрёшься","916":"Самое печальное, что щас очередной проект на этой библиотеке","917":"я уверен это не рекорд, просто я его видел постоянно поэтому врезалось в память","918":"Это детали реализации","919":"и ничо","920":"Тоже сперва было непривычно, потом уже не обращал внимание.","921":"Если позволяет то че б не сделать","922":"Ребят, какую тему для F# юзаете?\nмне у гита нравится тема, не знаете её название в rider?","923":"Минимальный семпл какой-то","924":"Это показывает, что наш компилятор не так плох, как можно было бы подумать!","925":"да это я так ради прикола сохранил, вообще я бы не парился и написал класс со статическими методами","926":"вот тайп инфирес:\n```type Foo = { Name: string }\n\nlet bar x = x.Name\n\nlet a = JsonConvert.DeserializeObject<_>(\"\"\"{\"Name\":\"abc\"}\"\"\")\nbar a\n|> printfn \"%s\"```","927":"я вот это взял с нугета FSharp.Data.TypeProviders","928":"интересно FSharpPlus будут адаптировать?","929":"Попробую обновить до 2.2.5","930":"ты же понимаешь что скорее всего твои преподователи сидят в этих чатах?","931":"он же заделейнеый","932":"Пишется \"искаропки\", слитно ;)","933":"ну да","934":"Нужно вести список что можно в f#, но нельзя в с#. И наоборот","935":"Ну для начала правилом хорошего тона является то, что код надо в гисте писать","936":"Ну, объединений точно не нужно боятся. Это чуть ли не главная фича F#. :)","937":"Я думаю зависит от количества функций, если одна-две, то удобнее без интерфейсика, а если целый репозиторий функций, то стоит интерфейс заюзать как в ооп.","938":"Интересно, а те кто хочет монады, понимает зачем они их хотят\nили просто потому что у др они есть?))","939":"В OCaml даже ppx есть, чтобы генерировать функции для доступа к полям.\n\nhttps:\/\/github.com\/janestreet\/ppx_fields_conv","940":"Идея в том, что если при десериализации попалось невалидное поле,то дальше можно не ходить","941":"А книжка годная (:","942":"А что значит \"новые технологии по клонированию объектов\"?","943":"Я кстати в докере не отлаживаю, да и зачем если все работает локально.\nВ контейнер уходят финальные артефакты.","944":"вот не могу понять что в функции написать, чтоб каждый элемент был из m нулей","945":"ну надо же, я и не знал про такое. Как она в сравнении с System.Windows.Forms.DataVisualization.Charting по производительности ?","946":"Так как Http.content уже его на text устанавливает\n__Но не исключаю конечно свою криворукость в этом моменте конеш)__","947":"Вот нашёл","948":"С его star projections and such","949":"особенно на коре","950":"А разве когда люди берут какие-то либы для своих проектов, им по большей части не все равно, смогут ли они туда контрибьютить или нет?","951":"А выведет по первому переданному","952":"Ты в более глобальном плане) а у меня просто первое в голове это сишная struct","953":"анекдата, да,  но всё же","954":"был даже где-то на хабре перевод этой статейки","955":"да","956":"Привет!","957":"М?","958":"Fold?","959":"И вообще, высокоуровневые языки - сахар для ассемблера!","960":"С шаред стейтом","961":"Мелкий довесок для упоротых байтоёбов-inline насильственный, тоже при понимании что делаешь дает кумулятивный буст перформанса","962":"Полноценно месяца 3 наверное.","963":"Кстати, для работы type provider реально нужна рефлексия?","964":"В C# как правило просто нет такого числа дженериков.","965":"@BashkaMen @haskellru","966":"https:\/\/youtrack.jetbrains.com\/issue\/RIDER-38184","967":"Во флудилке спроси, было у нас несколько специалистов","968":"у меня вот так автоматом выглядит, я и привык","969":"ну вот у тебя длинная операция в таске, а ты все эти эвэйты и эвэйтишь, а grain1 await grain2 await grain3 await grain4 (long running task) -> timeout","970":"Точнее что бы на java было написано, кое-как пробили скалу хотя бы","971":"Да узкая тема HFT, все в стол, т.к. профитная и доходная тема, обучающую выборку не наскребсти :)","972":"@olegzee Не знаю, насколько это имеет смысл.","973":"если б я знал что у тебя проблема в елмише, я б даже не взялся!!1","974":"есть в планах сделать","975":"Ну, чтоб два раза не вставать: есть у кого-нибудь примеры работы с TreeView из Avalonia FuncUI? \nА то у меня пол вечера ушло на то чтобы его отобразить, а сейчас кажется уйдёт вечность на то чтобы отследить изменение выбранного элемента.","976":"","977":"Второй с перегрузками возможно тоже стоит","978":"В компиляторе ребята умные, придумают что-нибудь!","979":"то есть?","980":"По идее можно через экстеншн сделать, но геттер там не получится прикрутить","981":"Положение изменилось бы , если было много учебного материала) ну это уже флуд)","982":"@maxspT, а как там интерпретатор Пролога поживает? :)","983":"В этом есть смысл","984":"https:\/\/wizardsofsmart.wordpress.com\/2017\/10\/01\/response-to-open-source-in-the-f-community-part-1\/","985":"так нет такого солюшена. есть солюшен с тремя скаффолд проектами","986":"Кажется я был неправ, говорят что и в любое IO умеет","987":"фшарп комьюинти юкрэйн еврибади дэнс гопак эдишн","988":"никто не мешает вот так написать","989":"В идеале должны идти нос к носу.","990":"установил, он не видит файл sln","991":"а так как k это int * int","992":"Кажется, `taskSeq` будет отдельной либой.","993":"Понятно. Я просто видимо стал уже позже использовать XUnit","994":"Большой порог вхождения","995":"Не принято считать, они ортогональны","996":"К стати, может кто-то желает `fold`'ы, `zip`'ы и тп законтрибьютить в FSharp.Collections.Immutable?","997":"Конкретно такое - нет","998":"Я правильно понимаю, что просто в сами паттерны переместится лестница, а только сам match будет более аккуратный?\nИ получается, что для каждого декодированного рекорда нового типа нужно будет делать новые паттерны.\n\nМне кажется, что кода будет точно больше чем с синтаксисом C#\nobj?.level1?.level2?.array?[index]\nкоторый универсален для любого объекта","999":"На с#"}}