{"text":{"0":"ясно дело","1":"но в стейте в разное время меняются это поле и хешмап","2":"Работай!","3":"Даже можем вместе делить инстансы финансово","4":"Мы в ИТМО ведём обязательный курс хаскеля.","5":"https:\/\/github.com\/fumieval\/objective\nТо ли дело пейперы!","6":"These ([Error],[Warning]) a ^_^","7":"REST появился потому, что господа вебные-динамические на PHP, Python, Ruby и прочем мозге рака не осилили написать нормальные генераторы прокси по WSDL","8":"руст оч хорош в плане ошибок","9":"т.к. он живет в хипе, и обычный стек используется для сишных вызовов","10":"число Грэма аппликаций :)","11":"дает информативности же","12":"разве GHC не часть Microsoft Research?","13":"есть интересный (возможно безумный) вопрос","14":"нет","15":":t flip const что пишет?","16":"хаха, щас выяснится что он на тебя халтурит","17":"haskey","18":"Или использовать bind, apply если у тебя функция с эффектом","19":"да это вообще адище будет","20":"ICO, выпил, в тюрьму.","21":"тянет пошутить, потому что го проще, а пхп не осилили","22":"Использую `flip`, но не `fix`. ЧЯДНТ?","23":"в safe-exceptions это делается","24":"Это просто QuickCheck","25":"ну генерик-линзами можно просто взять сабтип и сравнить его","26":"ну вот кстати хаскелист приводит конкретные примеры","27":"Whnf","28":"в этом он преуспел","29":"многократно говорил, что автор очень нетипичный\n1) не тупой\n2) не ненавидит программистов и не считает что надо их побольше низводить и курощать\n3) что-то читал\n4) что прочел - то и сделал, минимум квадратных колес","30":"и ты не познал дженерики, пока не написал орнаменты поверх них","31":"да","32":"другой важный фактор - то что они трясутся над однопроцентным замедлением компиляции теперь, и поэтому стоит даже то что через процесс прошло","33":"Ну хоть перестанут думать, что list comprehensions изобрели в хаскеле","34":"Так, подумаю. \nНу мне интересно слушать всяких людей с диагнозами","35":"<@QLinear>-<⎇ master>-3-> ghc -V\nThe Glorious Glasgow Haskell Compilation System, version 8.10.5","36":"ну вы же знаете что есть","37":"Да, всё так. Особенно когда знаешь Х-ль и иже. Типа “такс, сейчас у нас будет ad-hoc полиморфизм!” А хрен-то там","38":"как раз когда пробовал делать круд дсл над сервантом","39":"“просунуть под ридер” короче","40":"так то на пурсе","41":"мне тоже было очевидно, пока не попробовал","42":"https:\/\/skillsmatter.com\/skillscasts\/4251-lenses-compositional-data-access-and-manipulation","43":"Потому что это совсем не очевидно","44":"Понедельник","45":"симметричность и транзитивность там есть:\n```sym : {left:a} -> {right:b} -> left = right -> right = left\nsym Refl = Refl\n\ntrans : {a:x} -> {b:y} -> {c:z} -> a = b -> b = c -> a = c\ntrans Refl Refl = Refl```","46":"(что нам мешало)","47":"В моем скромном опыте оно перестает работать почти сразу","48":"угу","49":"впрочем это все спекуляции конечно","50":"а че, слабо монаду на C сделать?","51":"не буду спойлерить, думай","52":"Вы хотите, как [здесь](https:\/\/github.com\/alexwl\/haskell-code-explorer)?","53":"Но ведь завтра никогда не наступит, потому что находясь в текущий момент времени нет варианта, в котором окажется, что по времени ты находишься в \"завтра\"...","54":"1. определи для себя сам, что входит в достаточное владение.\n2. собери проект, включающий в себя по максимуму из списка.\n3. запили, опубликуй.","55":"правильно","56":"в смысле? прямо хаскельный плагин фуллтайм пишет?","57":"кручу как могу, выдаёт либо parse error либо a,b вне области получается","58":"А можно посмотреть через ивентлог, какой тред чем занимался?","59":"Оно скорее всего где-то транзитивно уже будет)","60":"Есть такая ситуация, что принимаю некоторые QueryParam в серванте, и, согласно им, нужно выбрать список данных в Hasql. Как обычно это делается? Параметры ведь могут быть указаны в разных комбинациях, как это менее велосипедно отразить в стейтменте Hasql?","61":"в чём затруднение?","62":"Почему \"нет\"? Я ничего не сказал того, что противоречит этому","63":"Жутко с телефона писать","64":"Снойман сказал нету, значит нету","65":"Ребят, всем привет, кто нибудь работал на Haskell с stack overflow? Например получить список вопросов по какому либо запросу","66":"мы инкапсулируем эффект в значение","67":"супер 😂","68":"как-то за последнюю неделю накопилось","69":"**arrowd**: Меня в телеге нет. Я есть в матриксе и дискорде. Ну и в ВК.","70":"лишь бы в рантайме быстрее было","71":"мм, с одной стороны нам конечно может и не надо прям суперпроизводительность, с другой стороны профита что-то тоже не видно","72":"У вас и по качеству кода нет ни одного хорошего драйвера. Помню как-то ради интереса выбрал одну реализацию, чтобы посмотреть как промышленный код на хаскелл выглядит. А там сплошной liftM5\/liftA5.  Выглядело так себе, крякнул и закрыл","73":"декартово произведение то точно не делает","74":"только без dot. геттеры выключать, конечно, надо, потому что они сами по себе неправильные","75":"Тут одна строчка составленная из высокоуровневых концепций, без них было бы пять строчек из низкоуровневых.","76":"И тех у кого нет явно перечислить","77":"ну наверное типа такого\n\nв example происходит переход от значения в синглтон, и там же из синглтона в независимый результат","78":"но на линейные типы похоже","79":"а то, что я выше хочу вообще реально?","80":"```     union { uint64_t halves[2]; __m128i whole; } eight_chars; ``` выразите мне на лиспе или хаскеле, пожалуйста","81":"Ты Pred делаешь уже после всего действия, а не когда завершился alloc","82":"еще как плохо Ж(((","83":"Шарю в индивидуальном порядке, если сообщите акк на гитхабе, но там действительно в основном из книжки Брейди.","84":"после x вставить его successor","85":"зато теперь, наверно, можно на мутабельные объекты владение передавать почти как в Расте","86":"ошибки надо искупать!","87":"мне кажется, с xml не будет проблем. если на клиенте типизированный язык","88":"в рантайме любой дурак может завернув ресурс в мварь","89":"ну не, с многопакетными проектами было ужасно и с сендбоксами","90":"Понял, в смысле?","91":"Даже со всеми attributions","92":"А, я думал ты про то когда люди выравниают поля рекорда по правому концу имени конструктора, например","93":"Какую задачу решают. Спасибо","94":"супаму десу","95":"идельный язык","96":"Попробуй telegram api с помощью 8.2 собрать","97":"Я думаю, даже не все линуксоиды согласятся на такой прозелитизм","98":"или девопс — это админ, которому начальник разрешил автоматизировать свой труд?","99":"Ну замени `$` на `=<<` и норм","100":"https:\/\/hackage.haskell.org\/package\/managed-1.0.7\/docs\/src\/Control.Monad.Managed.html#Managed","101":"ну то есть","102":"Они кстати могут работать нормально более менее, у компилятора формально есть информация, чтобы заинлайнить и оптимизировать","103":"т.е. плохой он в определенном контексте\n\nно может же контекст сам оказаться не прав?","104":"Неправильная стратегия. Надо иметь точную информацию, где и что лежит. Иначе запуск и простейшая модификация какого-то Example может затянуться на многие часы.","105":"А откуда интерес к хаскелю кстати?)","106":"на винду я 100% не хочу постгрес ставить","107":"тут нужен именно data, а не type\/newtype, потому что там лежит не одно значение. Это что-то вроде\n\ntype Point a = (Num a, a, a)\ndata Point a = Point {Num a} a a\n\nто есть в конструктор запихивается еще одно неявное поле с инстансом Num a","108":"@PineappleZombie должен уметь","109":"хотя они врятли участвовали в том голосовании","110":"We must secure the existence of Haskell and a future for functional paradigm.","111":"прблему накопления мусора придется решать отдельно","112":"Тоже нет","113":"Это как?","114":"ну и.е. они конечно полезны","115":"Эван уже отменил","116":"Пасс, мне кажется выгоднее, чем твой выбор с -15 соц.кредита... хотя всё оффтоп","117":"копируешь текст в пин, вызываешь сишную функцию, она копирует ещё раз в своё нутро. перфоманс.","118":"попробуй поискать в истории канала по ключевым словам, там на пару дней обсуждения было","119":"http:\/\/rsdn.org\/forum\/job\/7168580.1\n(по профилю вроде совпадает)","120":"там тоже есть что-то такое","121":"Мож у кого сейчас есть настроение помочь. 😔","122":"в Bot API — нет, выше речь была — про tdlib","123":":\/","124":"А зачем определять самому, если есть в базе https:\/\/hackage.haskell.org\/package\/base-4.16.1.0\/docs\/Debug-Trace.html","125":"Например, в devafu, или через что там WT для карданы делали можно получить дерерминированный планировщик и тестировать всякие рейсы","126":"если нужно в глобальном делать hiding, то это всю пользу сводит на нет","127":"Не очень понятно зачем это надо в скобки пихать, если есть монады и стрелки.","128":"Это я к опечаткам опять придираюсь, простите=)","129":"кстати, а функции как дают? Компилятор же должен доказать их свойства. Иначе это ассюминг","130":"Там посмотрим","131":"url?w=1","132":"Не заводится?","133":"Хватает, чтобы ненавидеть?","134":"но не все язык программирования","135":"сначала в оопе придумали жопу, а потом она докатилась до фп в виде пальца","136":"нет, это для того, чтоб создать образ великого эксперта на фоне тех, кто уничтожает хаскель","137":"а вы сразу в продашкн пишете?","138":"Когда все 5 пунктов проработаешь, все поймешь","139":"да я уже","140":"на HAMT , RRB и прочем такого типа на анбоксед массивах хоть что-то наблюдаемое может будет, там то число ссылок хотя-бы на десятичный порядок меньше может быть а не в два раза","141":"Должно послать к чёрту, если получатель короче источника и дополнить получатель sign bit-ом в обратном случае, насколько я помню. Но я могу ошибаться.","142":"@cblp_su учитывая, что у тебя статический сайт монжо на чистом nginx замутить","143":"да, но пока касания с хаскелем нет","144":"имхо нет, еще законы бы сохранить","145":"!","146":"ну его недостаток - слабая интеграция с системой, ненативный вид контролов и архаичный лук н фил","147":"Этот парень просто кладезь годной копипасты","148":"• No instance for (Profunctor Foldl.Fold)\n        arising from a use of ‘lmap’\n\nНо на hackage:\n\n`instance Profunctor `[Fold](https:\/\/hackage.haskell.org\/package\/foldl-1.4.6\/docs\/src\/Control.Foldl.html#Fold)` where\n    lmap = `[premap](https:\/\/hackage.haskell.org\/package\/foldl-1.4.6\/docs\/src\/Control.Foldl.html#premap)`\n    rmap = fmap`","149":"а зачем?","150":"Это тема изначально с сомнительной доходностью.","151":"ну я тоже не люблю думать, EitherT, ErrorT, ExceptT или ThrowM","152":"это хаскель, братан","153":"можно конкретно в данном случае","154":"__* __[__Maxim Koltsov](tg:\/\/user?id=26920196)__ __ставит реакцию 👎__","155":"рейтрейсинг на гпу - слишком нишевое","156":"это разрешает писать ограничения на типы, очевидно корректные с точки зрения программиста, но не очень корректные с точки зрения \"стандарта\" языка","157":"я уж испугался, что еще книга будет про хаскель, сколько можно уже","158":"да никто вроде и не хотел монадки","159":"ага","160":"нет","161":"переписываем на клин","162":"Пропозал приняли","163":"vector был доступен","164":"которое презирают теоретические матетматики","165":"ну они оба изоморфизмы","166":"или другой?","167":"хм, спасибо","168":"`for_` и завернуть `someIO` в `StateT`?","169":"сейчас под виндой не работает ghc-mod и следовательно зависящий от него hie, но в ghc-mod-е это вроде на днях поправили, значит скоро и в hie должны","170":"Почему у конструктора типа один аргумент?","171":"и забрать","172":"захайлайть Бравита если хочешь точный ответ :)","173":"заработало, тоже в пределах локального кода, по нажатию Alt","174":"чтoбы в качестве сервера пoднимался сервер из `websockets`","175":"ага, фемили. что-то я не сообразил","176":"Собственно, сам conhost никуда не делся, он теперь научился прикидываться conpty","177":"Но там не надо было передавать результаты авторизации, просто в двух из трех веток сделать так, чтобы была авторизация валидная (любая)","178":"А вот эта нотация с ! доступна без сторонних пакетов?","179":"Solid вообще не стоит рассматривать как что-то \"данное свыше\" богами, что работает только на оопе","180":"https:\/\/www.tweag.io\/posts\/2018-02-08-internships.html","181":"ещё в обычных языках мы обычно пишем в термизах zip а не join","182":"После блюбук, которая во имя добра.","183":"Доказать основную теорему гомоморфизме для групп?","184":"А что за  функция`I`?","185":"not my screenshot","186":"Кажется что можно, тем более всякие NDP похоже кажется работали","187":"Я так понимаю это контроль над многотипами както так - может кто в теме поправит","188":"я включил -Wall и ghc все равно не ругается","189":"Более того, все браузеры еще и по разному обрабатывают ошибки, там вообще хаос. С тем, что сегодня считать спецификацией html кстати тоже вопрос, есть w3c recomendation и есть whatwg living standart. Про готовые решения +1, я недавно писал парсеры на хаскеле, вот эта статья очень пригодилась: http:\/\/adit.io\/posts\/2012-04-14-working_with_HTML_in_haskell.html","190":"вообще там в гиттере есть команда ребят пилящие всякий data science","191":"может","192":"codewars же выше","193":"Интересно, то есть где-то под капотом он делает tryRead","194":"я когда разбирался в истории ФЯ, ничего особого связанного с ссср не видел\nмаксимум в последние чуть ли не месяцы в ссср перевели книжку спж и книжку хариссона и филда\nну еще какая-то шарага из пнр была в емелострадальном мейллисте","195":"🤔","196":"Дообучиться проще с любителя. \nПрошу простить за рекламу, но ЧелАвиа обучают (в том числе и до уровня профессии),  и рекомендуют сначала любителя, а потом решать.","197":"Лол, TIOBE - тот ещё релевантный источник :)","198":"Я б не сказал, что primitive это обёртка над библиотекой, написанной на другом языке","199":"**arrowd**: Короче, оказывается что в поллинге в ботах к ВК\/телеге ничего страшного нет, т.к. там используется то что называется `long polling`. Веб-сервер подвисает на заданное количество секунд, если у него нет обновлений, которые можно было бы передать боту. Все HTTP-клиенты устроены таким образом, что они будут ждать ответа. Таким образом, сервер не дудосится, а CPU не пылает.","200":"и это еще в линзах поди?","201":"Аксиоматически ввести это значит не ввести. Нужно модель аксиоматики предоставить. Модель аксиоматики строят либо по Коши — через сходящиеся в себе последовательности, либо через дедекиндовы сечения. Есть извращённые способы, но они неучебные","202":"Есть какой-нить библиотечный способ превратить `Map a [a]` в `[a]` так, чтобы все элементы списка из значения шли раньше, чем ключи?","203":"оставаясь в стороне вы упустили возможность прочувствовать чатик","204":"Кстати, любопытно. А в чем состоит \"адекватность\" STM? Какие критерии? Код должен проходить какие-нибудь стандартные тесты? Удовлетворять определенным требованиям?","205":"но это редкий кейс конечно","206":"но в summary: forkOS + lts - будет работать, но будет зависеть от RTS и параллельность лимитирована настройками haskell RTS","207":"Так и знал что хаскелисты - анимешники","208":"hlint","209":"а еще можно скипнуть этот этап и сразу делать все напрямую в IO с имплиситами, как недавно выяснилось советует сам Кметт","210":"Всем привет.","211":"А ещё там CS Club","212":"-H у нас минимальный размер кучи устанавливает.","213":"@aragaer это запись в бинаре со списком директорий в которых искать либы","214":"кто-то учится и юзает нотпад++","215":"недвига - не проблема с местными зарплатами","216":"Если включить и эффекты и контейнеры, то будет правильный \"контекст\"","217":"но для многих это не так","218":"как писать доказательства?","219":"пасибо!","220":"Это я представляю, да. Интересно, когда последняя итерация была","221":"не только. У каждой монады должно быть какой-то способ включить в себя чистое значение без эффектов","222":"петиция вообще веселая была","223":"Да самому неудобно, надо найти пастебин...\nПравда походу без hie.yaml оно не работает, навигация","224":"Оно ж не ленивое, зачем","225":"в GVector какая-то зависимость","226":"я слышал, что как раз у хаскельного протокола\/ноды есть спек","227":"ссылку на релевантные статьи в тот раз кидали","228":"Изучу","229":"это я попытался датировать вот эту историю https:\/\/www.fpcomplete.com\/case-study\/case-study-scaling-up-scientific-computation\nкоторую на хаскельреддите недавно запостили","230":"Это логично и удобно","231":"Только если сложение коммутативно","232":"а вообще это интересно представлять как другие люди умирают, занимаются любовью, пишут на Хаскеле","233":"Они не бывают правильными, можно даже не вдаваться в подробности","234":"🙈","235":"раз они решили продавать (по не самой малой цене), они позаботились об индивидуальной отметке, конечно же...","236":"я ж не в курсе че вообще есть","237":"у тебя со стеком нету никакого глобального проекта","238":"Над ghcjs вроде примерно один человек в свободное время работает. Чего вы хотели?","239":"У меня такое:\n````\n-ddump-simpl \n-dsuppress-coercions \n-dsuppress-idinfo \n-dsuppress-type-applications\n-dsuppress-type-signatures \n-dsuppress-var-kinds \n-dsuppress-module-prefixes \n-dsuppress-uniques`\n```","240":"ну как бы про DT я смотрел https:\/\/www.youtube.com\/watch?v=ISGENChlA4M&list=PLvPsfYrGz3wufQguebnCduYgQQ9UMeJRt","241":"проблема-то не в критике, критиковать - это похвально. проблема в том, что перед тем как что-то критиковать про это надо бы что-то прочесть, чтоб это понимать","242":"в каком это случае?","243":"я правильно понимаю, что в hasql нет aeson-like API для дата-мапинга?","244":"я краем уха слышал, они там сейчас какую-то унификацию языка модулей с остальной частью сделали, но это Yuu-chan лучше меня знает","245":"ну уж точно модерн, по сравнению с плюсами-то","246":"из конкретного текста при парсинге получается дерево конкретного синтаксиса, ничего абстрактного не может получиться, пока мы не сотрём детали конкретного языка","247":"Вот да","248":"Дайте мне формальное определение \"уровня\". Я на C++ могу описывать монады и стейт-машины в тайплевеле, могу ассемблер встраивать. Какой там уровень?","249":"зачем, если для этого есть language server?\nЗадача этого расширения - не переключаться в настоящий браузер когда надо что-то по-быстрому найти.","250":"Не знаю... Не пробовал","251":"А почему именно про @kana_sama уточняющий вопрос?)","252":"голангинг","253":"есть, конечно — запихнуть SCC перед do","254":"Что естественно удешевляет работу для этой конкретной фирмы и правильное решение","255":"который с приходом forall -> просто должен стать ненужным","256":"Постарался подробно .-.","257":"ну и если не стоит констрейнтов","258":"в смысле, без ненужного копирования при заморозке для безопасности? да","259":"у структур редко бывает по миллиону полей, так что пёрфект хеш вполне можно заюзать в качестве альтернативы","260":"надо было через foldr","261":"какой тип у переменной `x`?","262":"так ты на английском кинь","263":"т. е. createTransport host port (\\_ -> (host, port)) ...","264":"@int_index а дописывание фич в GHC присутствует в прейскуранте?","265":"```delegate to base {\n   fn1, fn2, fn3\n}```\n\nЧто-нибудь типа такого","266":"в этом пейпере тернер фактически дискутирует с бруксовской статьей про серебряную пулю, которая через 5 лет будет написана, мол вот у меня на сасл получается в десять раз меньше код, а мы знаем что программист в год примерно на любом языке одно количество строк пишет, вот вам и эффективность на порядок! брукс-то про сасл не знал","267":"что кладут в тмвар","268":"modern-uri","269":"Ага. И в этой функции можно учесть уже и несколько допустимых умолчаний и прочее","270":"https:\/\/ru.m.wikipedia.org\/wiki\/Еврейское_письмо","271":"F# лучше цяцкеля","272":"\"Я вам запрещаю изучать неборинг хаскель и провоцировать меня на ответы\"","273":"Юмор так себе, но окей: https:\/\/habrahabr.ru\/post\/350186\/#comment_10690558 и ниже","274":"{-# NOINLINE refReset #-}\nrefReset :: a -> a\nrefReset a = unsafePerformIO (R.writeIORef ref 0 $> putStrLn \"reset!\" $> a)\n\n`> refReset ()`\n()\n\nпохоже, не сбрасывает","275":"Или я что-то не знаю (очень вероятно) и так и надо (маловероятно)?","276":"можно `graphviz` заюзать\nзаписать само дерево в файл и бинарник дернуть из хаскелля","277":"не устанавливать, а создавать","278":"который пишет книжку про типы","279":"что значит \"не-как-в-питоне\"?\n\nвот эти все \"написать потому что могу\" как раз лезут из болота динамической типизации","280":"прикол: похоже `repl --build-depends` сломали в Cabal 3.6.3...","281":"`:script файл-с-командами-вроде-.ghci`","282":"вопрос - а кому вообще помогло преподавание ЯП?","283":"@qnikst а что насчет такого юзкейса для fix?","284":"ну там в целом много велосипедов с кодгеном","285":"ну может фонд запилить, из которого этих людей оплачивать?","286":"fromJSON  = asum [ parseTask | parseWhateevr","287":"Хотя школа хорошо","288":"Мы наверное в разном environment. У меня такая проблема была когда мы в alpine ghcup пытались запустить.","289":"ghc намного быстрее будет компилировать, если на SSD ?","290":"а потом они ругаются на \"монады это пайпы\"...\n\nhttps:\/\/github.com\/theam\/tintin\/pull\/17#discussion_r190178211","291":"@hotkosc не парси Value в структурки","292":"можно слёзно попросить в ишье автора экспортнуть нужную фигню, либо форкнуть либу","293":"какая-то ассиметрия","294":"case во время компиляции не упадёт","295":"что совсем не доставляет удовольствия","296":"неправильный вопрос","297":"который будет генериками превращаться в то что нужно для aeson","298":"а какие ghc и cabal у вас?","299":"хорошо бы было, а то как-то получалось что компания совсем не на слуху","300":"","301":"имея на руках доку, дополнить её фичами\/фиксами, собранными за 6 месяцев, — дело уже нескольких недель..","302":"`-Werror` тоже желательно включать, но можно иногда выключать","303":"https:\/\/hackage.haskell.org\/package\/containers-0.5.11.0\/docs\/Data-Sequence.html#v:lookup O(log(min(i,n−i))).","304":"я пробирался в папку с ghcjs иии. сейчас ещё раз посмотрю что он пишет","305":"Не, не то.","306":"Да то что выразить хоть на джава или хаск понятно - но меня парадигма декларативный или императивный и Объект всё ил и всё Фуннкция мучают(","307":"а, видимо набижали хейтеры в stan?","308":"Я во всяком случае знаю что я поставил","309":"да","310":"есть такая штука — роутинг","311":"мне любопытно","312":"про исключения, про gc, про threaded runtime","313":"ну там уже голос какой-то несерьезный получается. подрывает.","314":"сигнатуры мне haskell-mode вставит, а доки писать надо","315":"Ну и чем это тогда от подтипирования записей отличается?","316":"именно","317":"интересно, какое адище можно получить, если аппликативы композить","318":"с точки зрения математики ты вообще не опишешь дефолт","319":"ни в каких, просто апликатив ду не только для апликативов работает","320":"спасиб!","321":"тогда надо подумать, как разрешать коллизии","322":"х(","323":"вам, скорее всего, завтра ответит мейнтейнер пакета.. вы можете ему помочь, если заведёте issue на гитхабе","324":"re2 (по состоянию на 2015 год)","325":"хм, спасибо","326":"ну она заслужила","327":"Если ОС убила то на линуксе это сигнал которым убило","328":"нужны такие то люди, зову, кто хочет поработать - работает","329":"в общем, звучит как комбинация DeriveGeneric + DerivingVia","330":"https:\/\/www.reddit.com\/r\/haskell\/comments\/r82ji7\/christmas_of_code_haskell_for_mobile_a_3000_grant\/","331":"а у типографов свои весёлые причуды, но это уже тема для blah","332":"15 КОД!!","333":"чем лучше строки паковать, самое быстрое? Codec.Compression.BZip ?","334":"И не только они. Провинция тоже негодуэ.","335":"угу","336":"Как же нету, если есть","337":"лол","338":"да!","339":"в koka lang вместо mark and sweep gc используются счётчики ссылок с алгоритмом переиспользования памяти. Т.е. один алгоритм автоматической очистки памяти заменён на другой, с иными особенностями и недостатками. \nЧто такое \"остальной\" гц и как он \"статически оптимизируется\" - непонятно.","340":"надо признать, вообще не был","341":"да знаем уже - в антикафе собираете, с фильтром по размеру черепа","342":"разница не сказать что велика","343":"в пурскрипте например мегапарсек только для лексинга","344":"но некоторые хотят скакать около пациента","345":"То есть лучше матчить через nodeProps?","346":"ну уж лучше на плюсах тогда, чем на фортране","347":"какие эффекты? их 500 библиотек","348":"Я его не прошёл уже давно(","349":"И, кстати, если уж так говорить, то не юникс. Unix-like OS family.","350":"мне кажется это рантайм пытается отожрать 1 гиг и не может","351":"а есть какой-то state-аналог для ^..?\n? t = gets (^.. t)","352":"А Бас даёт полные права тебе","353":"Угу","354":"Не лишнее","355":"Потом пробовал тулчейны в emacs и Atom, везде свои достоинства и косяки.","356":"я могу подсказать как это легко сделать","357":"может, тебе нужен traverseWithKey?","358":"ну поинт понятен, чо","359":"к тому времени хаскель умрёт и все будут писать на расте","360":"+1 \nя тоже удивлён что до сих пор ничего такого нет","361":"мне кажется много либ найти можно которые не ставят тэги - но стабильны","362":"а наоборот, достижимость чисел от 1","363":"Выглядит очень доступно","364":"typeclass-ы имхо это мультиметоды в Julia и подобных, только более замороченные","365":"про числа?","366":"запусти stack solver --update-config","367":":(","368":"а есть смысл обзамать мварами для тредсафетности?","369":"лучше не придумал как выразить, поэтому пока так","370":"Вот это просто чудесно звучит!","371":"просто кликните на линзу","372":"я бы не назвал WT крупной компанией","373":"В шарпах в этом году такой же синтаксис добавили для иммутабельных записей. Сколько лет оно есть в хаскеле?)","374":"Хочу внутри стейт монады аппендить что-то в список через линзы. Нашел `<>=` который можно использовать для любой полугруппы, но `myLens <>= [myElem]` очевидно будет работать за линейное время. Есть ли какой-то специальный оператор, который работает похожим образом, но специализирован под списки и юзает `:` ?","375":"чё обсуждаете?","376":"","377":"я на фбае подойти к нему боялся, а могли аниме обсудить","378":"Попробовал такие типы:\n\n```fn :: [JSStatement] -> Map String Integer\nfn = fromListWith (+) . map (\\x -> (show . toConstr $ x, 1)) . universe```\n\nНо он что-то не то считает, явно не вхождения разных конструкторов","379":"он притаскивает последний лтс, а вот nix-tools умеют в любой лтс","380":"русская, правда. биномиальные кучи читать?","381":"А исключения необходимо документировать","382":"Там же нет лейблов для пути\nТолько метод и статус","383":"Ладно, значит я олень, не смотрящий в доки","384":"https:\/\/bananasandlenses.net\/episode021.html#comment-2664983037","385":"в телеге поройся","386":"Это как?","387":"ниче не надо клонировать","388":"Питон же.","389":"Ну я сразу сказал, что не понимаю этих юзкейзов, мне интересна мотивация. Пока для меня это выглядит как попытка использовать максимальное кол-во расширений компилятора и прокачатся в тайп-левел программировании, а не решить инженерную проблему. Что тоже вполне себе цель.","390":"а как сервер в таком случае запускается?","391":"tuplesections кстати я не читал, но вроде норм","392":"если я делают data S a = S a Encoding, то расширить можно, но работа не пошарится","393":"Отлично)","394":"мучаться с этим анбоксед вектром для байтстрок имеет смысл только если их долго хранить и мутороно их ГЦ обходить, а это не данный случай","395":"это как это нигде не встречается","396":"вряд ли","397":"Вопрос в том помогает ли язык или придётся полагаться на трудолюьие и усидчивость","398":"У меня такое было в продакшоне с пакетом retry, потому что я не читал доку и не знал, что RetryPolicy это RetryPolicyM с завёрнутой монадой, и пытался накостылить велосипед","399":"а там гарантированно всегда будет тайп-апп только по второму?","400":"Но каков же этот минимум?  Мне этот пример очень непонятен😒 А если второкурсник филологии например?😅\n\nПро дисертации, спасибо за идею.","401":"я потом покажу, что получилось, когда заработает","402":"Тайплевел — он как термлевел, только очень грустный","403":"там в апендиксе много чего есть http:\/\/www.haskellforall.com\/2012\/05\/scrap-your-type-classes.html","404":"Я использую tasty как драйвер, у него точно есть плагин для генерации junit XML репорта","405":"какой-то сумасшедший, который пролез в бут либы?","406":"можно оценку снизу сделать","407":"в Хаскелле можно экспортировать то, что импортировано","408":"forever :: IO () -> IO () можно написать, если что. Сейчас нерабочий пример попробую, уж очень загадочно","409":"Rebindable для списков вроде же не работает","410":"Джентельмены, вопрос насчет датаконструкторов, есть вот такой тип:```\ndata Field_T = String String String```","411":"Всё будет","412":"megaparsec сильно лучше, чем parsec","413":"Ну мне кажется, что вимом только админы пользуются. Я живых программистов-вимеров не видел.","414":"это бесполезное требования","415":"он прикольный","416":"про CAF не знаю: не уверен, что можно","417":"там будут лучшие люди. сам Вершилов будет!","418":"а что, у Arrow есть инстанс профунктора?","419":"для задачи наверное это и не нужно","420":"тоже самое без лишних 100500 тредов","421":"давайте все аналогии в блах?","422":"да, это верно. Просто пробовал поиграться с ленивостью с `wait` в фолде","423":"```main = print . sum . fromListWith (+) . fmap ((, 1 :: Int) . maybe undefined fst . LBS.readInt) . LBS.words =<< LBS.readFile \"ints\"\n\n```Data.Map.Strict\n\n```100000000\n 104,651,720,520 bytes allocated in the heap\n  15,034,229,288 bytes copied during GC\n         906,296 bytes maximum residency (6122 sample(s))\n          73,120 bytes maximum slop\n               8 MiB total memory in use (0 MB lost due to fragmentation)\n\n                                     Tot time (elapsed)  Avg pause  Max pause\n  Gen  0     18823 colls,     0 par   12.191s  12.213s     0.0006s    0.0027s\n  Gen  1      6122 colls,     0 par    6.593s   6.602s     0.0011s    0.0031s\n\n  INIT    time    0.000s  (  0.000s elapsed)\n  MUT     time   37.999s  ( 37.845s elapsed)\n  GC      time   18.784s  ( 18.815s elapsed)\n  EXIT    time    0.000s  (  0.000s elapsed)\n  Total   time   56.783s  ( 56.660s elapsed)\n\n  %GC     time       0.0%  (0.0% elapsed)\n\n  Alloc rate    2,754,100,858 bytes per MUT second\n\n  Productivity  66.9% of total user, 66.8% of total elapsed\n\n```Data.IntMap.Strict\n\n```100000000\n  99,827,742,512 bytes allocated in the heap\n  14,967,081,160 bytes copied during GC\n         878,488 bytes maximum residency (4755 sample(s))\n          55,960 bytes maximum slop\n               8 MiB total memory in use (0 MB lost due to fragmentation)\n\n                                     Tot time (elapsed)  Avg pause  Max pause\n  Gen  0     19121 colls,     0 par   11.395s  11.413s     0.0006s    0.0021s\n  Gen  1      4755 colls,     0 par    4.764s   4.770s     0.0010s    0.0023s\n\n  INIT    time    0.000s  (  0.000s elapsed)\n  MUT     time   30.016s  ( 29.890s elapsed)\n  GC      time   16.159s  ( 16.183s elapsed)\n  EXIT    time    0.000s  (  0.007s elapsed)\n  Total   time   46.175s  ( 46.080s elapsed)\n\n  %GC     time       0.0%  (0.0% elapsed)\n\n  Alloc rate    3,325,865,159 bytes per MUT second\n\n  Productivity  65.0% of total user, 64.9% of total elapsed\n\n```Data.HashMap.Strict\n\n```100000000\n  35,701,654,592 bytes allocated in the heap\n   4,644,079,344 bytes copied during GC\n         844,880 bytes maximum residency (2815 sample(s))\n          37,744 bytes maximum slop\n               8 MiB total memory in use (0 MB lost due to fragmentation)\n\n                                     Tot time (elapsed)  Avg pause  Max pause\n  Gen  0      5680 colls,     0 par    3.989s   3.995s     0.0007s    0.0020s\n  Gen  1      2815 colls,     0 par    3.248s   3.252s     0.0012s    0.0031s\n\n  INIT    time    0.000s  (  0.000s elapsed)\n  MUT     time   13.956s  ( 13.918s elapsed)\n  GC      time    7.237s  (  7.247s elapsed)\n  EXIT    time    0.000s  (  0.005s elapsed)\n  Total   time   21.194s  ( 21.170s elapsed)\n\n  %GC     time       0.0%  (0.0% elapsed)\n\n  Alloc rate    2,558,127,820 bytes per MUT second\n\n  Productivity  65.9% of total user, 65.7% of total elapsed\n\n```По bytes allocated сразу видно кто мутирует дерево а кто нет. (Листья при этом конечно все равно аллоцируются, тут чудес нет)","424":"В статейке увидел вот такой конструктор у типа. А почему это законно?.. (я про стринг)","425":"Не уверен","426":"а в чём проблема-то? HTML просто глупо парсить XML-парсером","427":"у сишарпа сносная производительность потому что гц нормальный, в который много труда вложено","428":"это мусор, можно жить не питаясь трупами и без паразитов, болезней, больше на эту тему не буду писать в ближ часы","429":"действительно","430":"а он тяжеленный","431":"первый раз такую нотацию встречаю","432":"Надо указать input как тип-параметр?","433":"@qnikst а в ПОМИ РАН? 3 вечера с @bravit111!","434":"интерфейс видимо такой, бывает и кубики двигать создавая цепочку связей","435":"был доклад на эту тему, ещё до ковида","436":"partition fst . zip (cycle [True, False])  ?","437":"Конечно один","438":"в net crackers был знакомый который с выданного виндоноута специально не трогал свои проекты","439":"Мне Олеговая статья понравилась про sql","440":"это нормально","441":"`_`","442":"удоли тогда, раз сомневаешься","443":"Не, это не то по смыслу","444":"по моему опыту растёт в зависимости от того, сколько хаскельных проектов надо","445":"никаких нет","446":"Видимо никак. Но ведь если ты в модуле с типом делаешь NoFieldSelectors то ты сможешь и сам там HasField нагенерировать нужных.","447":"Ну я уже отдельную ручку сделал","448":"Прошлый раз был неделю назад примерно","449":"[Alexander](tg:\/\/user?id=228717170)  https:\/\/gist.github.com\/qrilka\/caf9bff4e7f32037cb567bc84d2147c2 - грузит ЦПУ в районе 50% (модулей мало), без флага на одно ядро, т.е. 25%","450":"на колбасной фабрике работаешь - колбасу не кушаешь","451":"И у меня есть ветка-пример с cabal проектом вместо stack, я точно знаю о чем я говорю\nhttps:\/\/github.com\/DoctorRyner\/miso-template\/tree\/cabal-example","452":"ну хоть какая-то где-то в 6.12, а с нормальным ио в 7.0","453":"бэнг форсит вычисление значения, а исполнение монадического действия происходит в (>>=)","454":"Команда: убить человечество","455":"смотря куда. кажется, что быстрее, но аэропорты как правило далеко от города + долгая история с паспортным контролем. ко времени полёта можно смело пару-тройку часов накидывать.\n\nсамый безпроблемный аэропорт у меня был внезапно в Минске","456":"и какой-нибудь типа write you a haskell","457":"триз это же такая советская сайентология, нет?","458":"получается что-то другое?","459":"ага","460":"http:\/\/erlang.org\/doc\/man\/erlang.html#list_to_pid-1\n\n?","461":"но ведь стрелка это монада в бикатегории спанов, следует ли из этого что профункторы тоже монада в какой-то категории?","462":"А потому что хз как сделать неэкстенcиональное равенство с когерентностью","463":"Господа, а можно попросить разбанить товарища @fftsqrd? Хороший человек, хочет учить хаскель, зашел в канал, но таймаут верификации упустил.","464":"которая уже просто список возвращает","465":"Я-то думал, что это просто индекс","466":"принципиально возможно написать несовместимые экстешнены","467":"Да что ты говоришь \nКакой глубокий вывод)","468":"для мейби и для [] можно инстанс фолдабл написать","469":"А в чём шутка?","470":"я сейчас поискал по чату, и обнаружил, что когда я тут писал что дпх убрали - я ссылки на коммит не дал, так что так быстро не найти","471":"не может найти его, потому что не скачала, так как base-4.13.0.0 нет на хакадже","472":"Hi :)","473":"expression lambda и statement lambda","474":"По крайней мере, не так сильно","475":"Но с клоном reflex-dom (автор назвал его Specular), вроде, более-менее разобрался. Правда, это не очень-то FRP. Как сказал бы Конал Элиот, в нем не хватает денотационной семантики. Вы же в курсе про драму про Sodium и книгиу Functional Reactive Programming от Manning?","476":"где-то уже есть такое?","477":"А что у нас есть чтобы можно было 1) строить графики в ihaskell 2) не совсем страшное API?","478":"патчи на Хэкадже всё портят","479":"Ладно","480":"а что посоветуете почитать про зависимые типы более-менее фундаментальное, чтобы проникнуться по-лучше идеями? я сейчас читаю type-driven development with Idris, но она сугубо про идрис и больше \"практическая\"","481":"**arrowd**: Я уже смутно помню, давно было.","482":"скала говно, говно имеет право на существование )","483":"@jerzy_hs а если ты припинишь версию в .cabal, то компилится нормально?","484":"И их дети Алан и Тьюринг","485":"С чем конкретно? Если вопрос в том как сделать “чтобы тайпчекалось”, то так же как в любом другом ЯП - переписываем программу, чтобы типы сходились.","486":"тоже, да? а то было бы странно\nпохоже придется читать Габриэлевскую репку заново, ничего не помню что как там делается","487":"ничего за емаксом не видно","488":"Что есть дойч?","489":"ну, тут требует уже другие версии","490":"если недолго, то хорошо","491":"Полиморфизм. В индрис не завезли шаринг","492":"если мы по одной ветке pred сделаем, то оно вторую не пофейлит в нужных местах","493":"> He is a major contributor to the design of the Haskell programming language,[10] and a lead developer of the Glasgow Haskell Compiler (GHC).","494":"столько keynotes слелали на Haskell Symposium..","495":"типа эх ?","496":"в HF?","497":"Короче это был в своё время костыль, который слишком сильно врос в мозги сообществу, чтобы его задепрекейтить","498":"да не, полно проектов. но как-то сам дискурс - о гляньтечомынаписалинахаскелле устарел","499":"Ну все, просто приблизил тепловую смерть, поздравляю","500":"Но я не сильно смотрел","501":"В композиции","502":"чет сомневаюсь, что на кастомном билде стек будет прямее кабала","503":"Создавать Manager неэффективно. Но можно положить его в рантайм имплементации и пользоваться неявно. В интерфейсе http вызова его не будет. Вот так, например:\n\nhttps:\/\/github.com\/graninas\/Hydra\/blob\/d386fe0c3c4a2cd3b57d3c2012ae30f4dc786b52\/lib\/hydra-free\/src\/Hydra\/Core\/Lang\/Language.hs#L48","504":"никакой разницы с т.з. компилятора нету между случаями выше","505":"какже как не в хаскеле","506":"на них можно функции над типами писать, если нужно это","507":"загнивает, примерно как капитализм","508":"существующие то точно можно типа alex\/happy, а вот свои добавлять уже ни разу не видел","509":"что в allUsers'","510":"Внутри доки на какой-нибудь модуль","511":"Да? Я думал ленивый :( А чо они тогда так долго его пишут?","512":"Это минимально ломают. Придётся сигнатуру в лет добавить","513":"наверное","514":"Мне так и надо","515":"он примерно такой же как foldl","516":"опа, действительно","517":"Как говорится, хочется странного :)","518":"Хороший подкаст был у вас, я сейчас второй раз переслушиваю. Уже больше понимаю","519":"Даже 100К не дают","520":"Простую, 30 милиметров диаметр, толщина 1, а нужно 0.9","521":"И так сравнительно нормально","522":"как сделать Getting A (Maybe C)","523":"Rik, автор плагина, уже планирует избавляться от intero. Не уверен, впрочем, в пользу ли HIE. Последнее лучше переспросить непосредственно у него, можно прямо в чатике плагина — https:\/\/gitter.im\/intellij-haskell\/Lobby","524":"Ну и stack build сделай","525":"алиас, это и есть второе имя. Т.е. дубль","526":"ну что там разумно","527":"а можно на примере?","528":"Если отрисовка мигающего курсора есть 15% ядра, то в топку такое редактор","529":"Я не то чтобы прямо агитирую. Атом всё-таки немного загибается и проблем там много. Но исторически сложилось что я сижу на нём и все свои плагины портировать на vscode мне не хочется. Поддержка хаскела в атоме в чём-то мне кажется лучше, но я же её в значительной мере и писал, поэтому я предвзятый, мне верить нельзя.","530":"интересно, возможно ли как-нибудь обойтись без `with` (?)","531":"\"эту бредовую позицию\"*","532":"мне нравится как на курсах о структурах данных на степике питон называют псевдкодом)","533":"<$> это просто .","534":"хейт-спич разрешен против некоторых категорий граждан. Например против белых цисгендерных мужчин увлекающихся теорией категорий.","535":"я вот теоркат знаю куда посылать, алгебру не знаю","536":"вообще там сложно, т.к. нужно statemachine пилить для того, чтобы не парся по json бегать","537":"теперь и генератор гитхаб-акшенс","538":"Ща пацанчиков позовём, выгоним с района","539":"Фундепы не понимаю","540":"в кабале новом есть \"приватные либы\"","541":"*тут","542":"Ещё книга Уилла Курта (она одна, гуглится по \"Курт Хаскель\")","543":"common stanza\ninternal libraries","544":"но это другое направление","545":"но там дурацкое","546":"так и про лиспы говорят )","547":"поделишься решением когда сделаешь?","548":"у тебя именно полугруппа?","549":"Работает оно у меня на ноуте на macOS если это релеватно","550":"за таймаутом \"запроса\" будет следить сам запрашивающий тред. Но за таймаутом загрузки, кто будет следить? А то будет там по байту качать","551":"прикрепляется","552":"я видел серию статей где реализуется язык с нативными корутинами","553":"хаскель","554":"в unit же","555":"и на то чтобы можно было указать размер буфера при hPutBuilder","556":"В пхп тоже есть фреймворки, в которых явный парсинг и такого нет","557":"Нельзя","558":"Такая глупость по моему. Делаешь такой себе полиморфизм, а тебе навязывают что ты должен это делать в стиле матана","559":"Надо бы притащить","560":"монадненько скорей всего","561":"ну да","562":"Это вообще нормальное у nix-а поведение или я что-то не так делаю?","563":"Так сделайте `Monad m => ... ContT m ...`, кому надо инстанциирует `m ~ Identity \/ m ~ State \/ ...` и получит чистую функцию, кому надо ио сделает `m ~ IO`","564":"вот такие вакансии пишут тут, ребята.. похоже расходимся","565":":(","566":"Ну давай пойдем дальше и придем к AsyncCallback или же вообще к семафорам и мьютексам)","567":"рекламу закупили","568":"вон ваш проект взлетит - самое время для мемуаров будет :Р","569":"Хорошая идея","570":"Генерить что угодно","571":"Ad absurdum, конечно, но, к сожалению, иллюстрирует ту же идею.","572":"t - length (bytecode x)","573":"```eitherToMaybe :: Either a b -> Maybe b\neitherToMaybe = either (const Nothing) Just\n\nfoo :: Float -> Either String Float\nfoo x = if x == 0 then Left \"oh no\" else Right (1 \/ x)\n\nbar :: Maybe (Float, Float)\nbar = do\n  a <- eitherToMaybe $ foo 1\n  b <- eitherToMaybe $ foo 2\n  return (a, b)```","574":"линия и чар?","575":"Блин я хаскель увидел 3 дня назад, что думаете в моей голове твориться ?","576":"у меня начальник после неуспешного пропихивания LiquidHaskell начинает подкаты с Идрисом. С coq-ом тоже не прошло, мда :) Вот я как прагматичный программер не понимаю зачем бы я хотел прувать код","577":"Ага","578":"Вот тут например про haskell спроси и окажется, что язык-то нужен","579":"в какой цвет покрасить боринг хаскель","580":"похоже, структура разобрана правильно, но имя корневого символа не проверяется","581":"checkers. Это ж для quick check ?","582":"Ну давайте простые случаи.\nПредставим, что k = 2 и у нас равномерное непрерывное на [0;1], тогда какова вероятность, что \nбольшее из двух чисел не больше x?","583":"Там про .Now()","584":"Обед это очень важно!","585":"Давно пора было!","586":"вообще связано, бреди писал что при тотальности мол неважно ленивый язык или строгий :)","587":"тут у других людей надо интересоваться, но они вышли из чата.. \nв общем, авторы stack, мейнтейнят его и stackage.\nу них есть коммерческие проекты на хаскеле, они их тоже поддерживают.\nфокус смещается в сторону Rust, но это не точно","588":"че уж вряд ли я со своим боринг там баги найду","589":"Не мешает","590":"Можно","591":"я начало истории промотал)","592":"оно же не тип создает а kind","593":"Не подходит более-менее","594":"https:\/\/hackage.haskell.org\/package\/generic-lens-2.0.0.0\/docs\/Data-Generics-Product-Fields.html","595":"Те проекты что умерли и что я знаю умерли не от переувлажнение","596":"можно сделать DSL, встроенный в Dhall","597":"Мне он только с Validation нужен","598":"Логично, что функция log в таком контексте существовать не может","599":"нет, он выберет какую из веток матча ему применить","600":"Быть профессиональным академиком, который пишет летс ановер тайп хиори на хаскеле","601":"**arrowd**: Хорошо, попробую. Это прогресс, в любом случае.","602":"ну почему не просто `pure`?)","603":"**Alert!** [Honey Chi Su](tg:\/\/user?id=877830054) is a known spammer and is [CAS banned](https:\/\/combot.org\/cas\/query?u=877830054). Ban is strongly recommended.","604":"Начинать — самое то.","605":"Ну у меня всё :)","606":"hf как раз таки очень нуждается в нём","607":"условнр говоря я пытаюсь понять алгоритм работы","608":"Если делать на Freer и Cofreer, то оно и так же будет, не?","609":"sortOn не меняет значения","610":"говорят, тут у кого-то HLS работает.\n\nя попробовал к нему очередной раз подойти, и как всегда, он какую-то фигню показывает вместо пользы:\n\n`Multi Cradle: No prefixes matched\npwd: путь к совершенно другому проекту\nfilepath: путь к текущему файлу`","611":"Оба раза я что-то набивал, hls это сделал втихаря. Аль-таб, компилю, оно мне говорит, что модуль импортирует сам себя, а `DList.singleton` возвращает `Set`","612":"Все слышали, да, @чат? Берите пример!","613":"И там кривые сабмодули","614":"nope","615":"Книжку с кабаном","616":"О, кто там диагнозы по аватаркам ставил, вот: http:\/\/www.tara.tcd.ie\/bitstream\/2262\/59831\/1\/Aerobic%20exercise%20improves%20hippocampal%20function%20and%20increases%20BDNF%20in%20the%20serum%20of%20young%20adult%20males.pdf","617":"без учета того что разные компы","618":"интерфейсы вообще костыль","619":"на динамических языках","620":"Обновления там будут очень редкими","621":"realToFrac :: (Real a, Fractional b) => a -> b","622":"c lisp?","623":"как их устаивать, когда про accidental complexity тут не договоритьс","624":"может, GHC как-то шаманит с помеченными указателями таким хитрым способом, что M1 считает неправильным","625":"Но кажется, что этот парсер будет выдавать ошибку компиляции","626":"если монада правильная, то точно так же","627":"Говорит stack init before","628":"Ок, взывать к здравому смыслу было не особо осмысленно и здраво","629":"купили-таки GitHub...","630":"т.е. общий код в `instance Quux` попадает, а частный в `instance Baz`","631":"выражение","632":"Молча работает и пыхтит - только кнопки нажимай)))","633":"Отсылка к своим тестам или опубликованным в описании xeno?","634":"да, `{-# LANGUAGE ScopedTypeVariables #-}`","635":"(","636":"frege смогли\nhttps:\/\/habr.com\/ru\/company\/hsespb\/blog\/574692\/\nhttps:\/\/habr.com\/ru\/company\/hsespb\/blog\/575566\/\nа хаскель чем хуже?)","637":"пандок годится для такого?","638":"Простой меня для такой штуки нет честного Function","639":"если функция большая это проблема функции","640":"ну и многолетназад опимизации имели смысл, сейчас уже их не продать","641":"(это не рекомендация микросервисов)","642":"А какая нужна структура для доступа за О(1)?","643":"какими именно предпосылками?","644":"ну вот, ещё прокси-сервер откуда-то брать","645":"какой арзумент?","646":"`ghc-options: -O2 -threaded -rtsopts -eventlog \"-with-rtsopts=-N1 -A64m -AL128m -I0 -T\"`","647":"","648":"это все еще компьютер сайенс?","649":"пулять туда хендлеры с yield внутри внутри монады со стримом","650":"\/run span odd [1 .. 7]","651":"да, кстати, про него тоже слышал","652":"Вообще, любая тусовочка имеет такие штуки. Например, в языке R (люди, которые непосредственно над языком работают, а не статистики всякие) говорят promise про то, что в Х. называют thunk. И когда им говоришь, что вообще-то промизы давно заняты в конкурентном программировании (для другого), они отмахиваются…","653":"оно конечно похоже на пакет, в котором тебе ещё авианосец дадут","654":"Это какие-то \"законы\", а не законы","655":"Твори добро, и бросай его в воду. (С)","656":"Cow не может","657":"Тогда зачем делать еще один?","658":"Питон","659":"Ноздря в ноздрю","660":"ну вот спроси у тех, кто стеком не пользуется, пользуются ли они модулями","661":"С агдой","662":"текст, простое api хочу попробовать написать","663":"traceM работает в любом контексте с инстансом Monad, хоть Identity","664":"хм, преждевременные вычисления","665":"а 999 комбинаторов запоминать просто","666":"ну изоморфизм то работает","667":"ЖВ","668":"нам не нужны паттерны, нам нужны бест практисы","669":"что означает `Ignoring trailing fields after sections: \"extra-source-files\"` и как это исправить?","670":"зачем? `emacs -Q .emacs`","671":"а я биотехом и не занимался никогда...","672":"всё вперемешку","673":"он и с представлением произведений ничего не делает сам (можно ему указать чтоб он встраивал произведение в другой конструктор прагмой)\nну еще можно посчитать что он произведение может заменить на возвращение на стеке","674":"Я обычно вот так пишу:\n\n`[s | s@JSFunction{} <- universeBi jsASTs]`","675":"это не сработало","676":"тут-то ботлнек при чем?","677":"в отличии от ответов на вопросы","678":"У меня там скорее plug-and-play либа для авторизации","679":"Ну да, или `Variant`, я об этом думал. Даже наверное можно попробовать его сделать экзистеншиалом.","680":"и до какого-то момента это не очень отвратно выглядит","681":"Ну или типа скалавского @tailrec","682":"лол","683":"прочитал, захотелось осудить ещё больше","684":"http:\/\/www.benfrederickson.com\/ranking-programming-languages-by-github-users\/?utm_source=telegram.me&utm_medium=social&utm_campaign=reyting-yazykov-programmirovaniya-na-osnov&utm_content=15907818","685":"будем надеятся, что нет","686":"Эх, точно","687":"`IO [a]`","688":"мне кажется, что никак, и надо просто делать `nix-shell blah --run fish` (ну или какой нравится), хотя стоило бы спросить в https:\/\/t.me\/ru_nixos","689":"@qnikst не сталкивались с таким? https:\/\/github.com\/tweag\/ormolu\/issues\/64","690":"newtype чего над чем?","691":"stick to the routine","692":"ну в данном случае в Int же","693":"Например что-то перед действием как в withSocketsDo или обернуть в bracket или после","694":"Можно корзину колбасы...","695":"Прочитал. 👍","696":"Ну смотря сколько вопросов)","697":"чем было до","698":"скачай, посмотри, нажми ^Z в ужасе","699":"или `monoidal-containers` притянуть))0","700":"Например, автоматизацию браузера.","701":"Баги компилера","702":"за GHC я мало что подсказать могу разве что могу сказать напеши тикет :)","703":"Тут нет, должно слишком много случиться, чтобы они там появились, причем не только у нас","704":"грязь какая то","705":"Если вас (как меня например) не сильно волнует производительность, то, конечно, ленивость ок и очень удобна","706":"а там динамическое и движуха","707":"Но я недостаточно инопланетянин, чтобы на нем писать:)","708":"полная","709":"Это даже не обмен мнениями","710":"или даже в чем своем","711":"чем же тогда от free-functors отличается?","712":"","713":"Кстати нашёл баг у Бравита в книге. Совет вот так поковырять есть, а упоминания :break в целой книге нет.","714":"эти все зиги композятся нормально","715":"я бы попробовал просто вью в список и посмотрел, насколько тормозить будет","716":"иди это Сенди расскажи","717":"https:\/\/gist.github.com\/artemohanjanyan\/006fc229ec3de4993441652fc460ea95\nВот код на идрисе, где экзистенциальные типы без конструкторов получаются, просто на функциях и кванторах","718":"И почему никто не предложил:\n\n```ptrSize :: Int\n{-# NOINLINE ptrSize #-}\nptrSize = unsafePerformIO $ getArgs >>= ...```","719":"а, значит, я правильно понял, отличие от внешнего браузера только во встроенности, и следовательно, в количестве движений для переключения","720":"ну в Го наверное нету ликов","721":"Сделай = сконструируй","722":"я думал в емаксе побольше режимов","723":"здесь вернется указатель на локальную переменную, которая умрет после вызова функции. чтобы выдать наружу указатель на данные, которые менеджит раст, надо разместить их в куче, взять указатель, «утечь» (Box::leak) данные, чтобы их раст не освободил по выходу из скоупа, передать указатель наружу. Чтобы потом освободить память, надо передать указатель обратно в раст, восстановить String (у него есть методы для построения из сырого указателя) и освободить. как-то так","724":"не знаю, но удивляться вообще не плохо","725":"Чегото в gitter тишина 😊","726":"```GHC.STRef.STRef GHC.Prim.RealWorld a -> GHC.IORef.IORef a```","727":"Фейсбук же на окамле писали какой-то анализатор для пхп?","728":"Я читал про 8 способов обработки ошибки -  был в шоке , сейчас думаю ошибокив хаскель нету понятия это тоже результат😊имхо","729":"сказал он и заплакал","730":"линк?","731":"В http-client же можно через manager задать user-agent?","732":"это 2010 год, как это не старые","733":"я не опнимаю почему на джаве быстрее","734":"зачем декодить юникод как CP1251?","735":"λоλ","736":"Для пакетов документация собирается практически всегда и доступна на сайте репозитория пакетов","737":"не за что","738":"все равно дорого","739":"какое-то сильно сложное, опять же, в бэкреференсах к ListT - довольно много проектов, т.е его кажется используют","740":"есть отсуствие плашки learn\/beginners и боязнь показаться глупым, или что предложат адский ад","741":"Всем привет! Есть ли тут знатоки OCaml? Могли бы вы посоветовать,пожалуйста, литературу по этому языку(как можно подробнее ознакомиться с эти языком)","742":"а что тогда?","743":"хлопцы, привет, подскажите плес, я не понимаю\nкак здесь может получиться Тру? если фолдр будет вычисляться только в самом конце справа\n\nmyAny :: (a -> Bool) -> [a] -> Bool\nmyAny f xs = foldr (\\x b -> f x || b) False xs\n\nя попытался расписать фолдр, но всё равно не понимаю\n\nmyAny even [1..]\n  -- inside\n  case [1..] of\n    [] -> False\n    (1:...) -> (\\x b -> even 1  b) ((foldr (\\x b -> even x  b) False [...])\n  case [2..] of\n    [] -> False\n    (2:...) -> (\\x b -> even 2  b) ((foldr (\\x b -> even x  b) False [...])\n\nесли кинуть + на бесконечном списке - он загнется\nздесь же должно быть тоже самое, вроде\nдело в ламбде?\nпомогите, не могу уже","744":"покажи пример, я тайпчекну. уверен что смогу любой","745":"двойная специализация","746":"И потенциал для изменений на ходу и более быстрых итераций:\nОдна из ключевых идей: система должна продолжать работу во время тестирования о особенно во время произведения изменений. Даже крупные изменения должны быть поэтапными и занимать не больше доли секунды.","747":"стрелки не совсем цепочки, но с ними тоже иногда работает","748":"ну-ну, полегче\nоперденей намного больше, чем кажется на первый взгляд","749":"```* Couldn't match type `ByteString'\n                     with `Data.ByteString.Internal.ByteString'\n      NB: `Data.ByteString.Internal.ByteString'\n            is defined in `Data.ByteString.Internal'\n          `ByteString' is defined in `Data.ByteString.Lazy.Internal'\n      Expected type: ByteString -> IO ()\n        Actual type: Data.ByteString.Internal.ByteString -> IO ()```","750":"ааа, ты выше писал, не заметил","751":"нельзя не эндоморфизм скомпозить с собой","752":"Он в функции восстановления захватывается, тут его специально хранить не надо как s","753":"https:\/\/www.haskellforall.com\/2016\/04\/worst-practices-should-be-hard.html","754":"Карацуба для двоичных чисел","755":"если кто там tmux включил и утопал наверх в режиме просмотра истории","756":"хаха","757":"Дело в том, что если шаблон для поиска содержит идентификаторы (например` P x`) и например был найден элемент `P A` в списке, то для меня важно, что идентификатору x сопоставилось значение A. Если для каждого элемента списка писать просто его признак, то информация какие именно значения сопоставились с шаблоном будет утеряна. Прошу прощения за неточную формулировку","758":"\"the notorious Chris Allen\"","759":"хотя бы -O1 включите, ага?","760":"такая пачка это упоминание на другом канале","761":"а какую задачу можно решить с использованием луа?","762":"`Cofree` страшные слова, я еще таких не знаю :D","763":"Но я не скажу, про что он :)","764":"Ну тут вряд ли к отключению хакаге надо готовиться.","765":"Я community использую, норм","766":"Ты тимлид? Сколько у тебя сотрудников сейчас? Кто они, какого уровня?","767":"и opaleye!","768":"О, доклад Максима выложили, надо посмотреть","769":"ну это на хакадже его нет","770":"мне сейчас нужен только Semigroup","771":"Ты там понял как group by работать должен?","772":"в tasty как-нить можно параллельное выполнение тестов вырубить?","773":"`a*` тогда для списков?","774":"ещё мир отапливаешь )","775":"вообще с inline-c проблем особых быть не должно","776":"у кого-то уже 4:40","777":"Но у меня не работает.\nХотя, может, его сначала стоит установить","778":"И не подскажите почему на винде оно пытается линкануть .a файлы как на линухе?","779":"Я думаю что спустя конечное время на них натравливают вирусологов","780":"чего для стриминга не сделают всякие утилиты вроде стрима файлов в директории? мне приходится для этих целей туртлом пользоваться и от гонзалезщины в этом туртле меня АЖ ТРИСЕТ","781":"А хаскель митап осенью не собирались сообразить? Или ещё лето официально не закрыли?","782":"для того, чтобы быть как жс, нужно много хайпа и любви юзеров языка. У го это есть","783":"это легко делается плагином, и при этом думаю удобнее будет","784":"Нет, не сложно","785":"Список тоже spine strict можно сделать","786":"weird flex but ok","787":"чет много свободного времени у препода","788":"а что за система такая странная, что stack к ней не готов?","789":"TChan не примитив же.","790":"Там в ссылках вот это\nhttps:\/\/en.wikipedia.org\/wiki\/Iota_and_Jot","791":"гит кстати норм, в нём идея есть более менее и интуитивность","792":"резюме такое - оптимизация в хаскелле требует опыта. а если опыт есть, то такие вопросы не спрашивают","793":"Ну и один большой европейский проект для кластерных фс","794":"И докер!","795":"я надеялся что мне сейчас и доки собирутся третьим","796":"Особенно если расширение добавил не ты, а оно уже было","797":"а не про языки","798":"речь идёт про побочные эффекты","799":"Да я тоже это знаю))))","800":"о-о-о, это тема одного из главных холиваров в ФП","801":"Остаётся пару лет подождать имплементацию.","802":"с конкретно стримингом проблема в том, что функция, которая флашит eventlog, в ghc сломана","803":"а я не очень calm - приходится питонить, блин","804":"Нет надо!!!!!!","805":"typed-racket довольно неплох, как и carp","806":"хотя","807":"а, или там есть custom","808":"ой, вот сюда","809":"Ftw?","810":"[Char] => [Symb]?)","811":"Ну очевидно же, что это высмеивание дискурса, принятого в современных освободительных движениях","812":"у меня там LMDB и bytestring-mmap, наверняка там что-то с memory mapped files","813":"Попробуй открыть проект в my-app","814":"https:\/\/thehftguy.com\/2016\/11\/01\/docker-in-production-an-history-of-failure\/","815":"Всем привет, знает кто, можно где-нибудь посмотреть запись ФП конфы, которая вчера в СПб была?","816":"Правильно ли с точки зрения культуры кода держать используемые типы в отдельном модуле?","817":"Ну, не знаю. с `whenJust`, кажется, понятнее","818":"никаких демонов, аккаунтов, зависимостей","819":"S.concat + S.map есть же монада","820":"forever обычно используется в других случаях","821":"при том я даже постарался оптимизировать это говно и как-то сокращал количество команд через циклы и степень двойки вроде","822":"Не знаю, что там насчет модальности, но мы использовали порт reflex-dom на purescript. Довольно проблематично","823":"Так, короче","824":"Ха-ха! У меня с утра Атом встал с третьего раза. BSOD, потом не сносился, руками чистил реестр...","825":"**arrowd**: Да, нашёл.","826":"кажется идея тайпклассов - отдать на откуп инстанс резолюшену тайпчекера это","827":"IO () означает может быть ввод вывод","828":"И можно ли как-то импортировать Utils.hs в foo\/Main.hs?","829":"конечно:) спасибо за поправку","830":"да, я знаю какая там бюрократия, так что не всерьез.. Но выглядит приемлемо КМК","831":"Че значит поломал","832":"чем толковее расширение, тес больше там чуши","833":"Коробочку","834":"В примере выше было 2 аргумента и выглядело как часть PM, но это догадки","835":"найс, спасибо огромное","836":"Хорошо узнать про это сейчас. \n\nКак раз смотрю в сторону C++. В первую очередь для того, чтобы работать с C\/C++ библ. без bindings.","837":"а ты не анонсировал нигде чтоль особо? яб ретвитнул :)","838":"мне Bifunctor или _1 кажутся более близкими к задаче","839":"когда это k достигает размера очереди","840":"\/irc","841":"и бекпек сборц","842":"не всем и не всегда, вон у кложуристов, очень развит generic programming","843":"Так-то я больше всего жду, когда в Biocad биоместо появится","844":"убогая парадигма","845":"смотря какие свойства нужны","846":"написанный на C ?","847":"Вы кажется там код апи для бота оставили в Main","848":"+","849":"и что из этого используется кроме как для спекуляции?","850":"а ретрай работает?","851":"На libgen.is появилась книжка Production Haskell. Думаю, она может ответить на часть вопросов","852":"Не получилось в общем","853":"ну или так","854":"если ничего не поиенялось, включая root, то вы запускаетесь от root всё равно, что противоречит руководству по установке","855":"parseA выжрет всё до конца, если его не остановить","856":"https:\/\/github.com\/haskell\/ecosystem-proposals\/pull\/4#issuecomment-359597503","857":"deal with it","858":"Прекомпилированные пакеты то останутся, просто хэши какие то считать ещё раз, не полчаса точно","859":"ну, лично я бы не стал\n\nмне нравится >=> когда есть явно однородные функции типа\n\ncheckA >=> checkB\n\nа тут ну просто так совпало скорее","860":"вполне себе хаск, каждый лифтед тип в хаск имеет боттом","861":"Не эвалится","862":"тогда значит женат","863":"звучит как Either","864":"Одна проверка) (у меня)","865":"теперь нужно будет самому тоже передавать переменную","866":"got еще неплохой","867":"возможно стоит изучить го","868":"и идрис","869":"да думаю, если тебе надо поведения комонады, то мб лучше проанатировать свой адт косвободной?","870":"Зачем куку\nПиши литералы с \\","871":"@Masteroid как должен рассахариваться where в середине do при условии, что where не может быть частью выражения?","872":"почему?","873":"Чего ты хочешь?","874":"бекендорф","875":"реакт бы кто портировал","876":"что за кровь адама? который раз тут читаю, гугл не помог","877":"в моей голове сейчас это выглядит примерно так","878":"Отлично же","879":"посмотри на энтити фреймворк","880":"В первую очередь, производительностью. На Lean просто гораздо быстрее (и с меньшими затратами памяти) идёт typecheck. Ну, и вообще он для людей сделан. Там очень компактное ядро, на которое дальше нанизываются тонны сахара.","881":"с упоением, приняв поллитра","882":"Глобальную когерентность можно примерно так сформулировать","883":"существует OVER9000 разных потенциальных фич для системы типов","884":"после 8.10 можно будет смотреть.","885":"не, хаскель пойдет, если писать на яве всегда было неприятно","886":"Ну согласись что уже знать строчку в коде приятнее, чем prelude.head empty list","887":"и мне, и мне","888":"кранты","889":"Ты преувеличиваешь. Сами hie файлы относительно недавно завезли только.","890":"опс","891":"в Core уже явно словари таскаются","892":"ну тогда микрософт, гугл еще насколько я знаю тоже","893":"`intercalate \" \"`, это `unwords` :)","894":"При запуске репла:\n```Warning: There are cabal settings for this project which may prevent GHCi from loading your code properly.\nIn some cases it can also load some projects which would otherwise fail to build.\n\n-XOverloadedStrings will be used, but it can cause type ambiguity in code not usually compiled with it.\nIt is specified for:\n    mccme-launcher:lib mccme-launcher:exe:chrstm-exe\nBut not for: \n    chrstm:lib mathsystem:lib mccme-common:lib seshat:lib texface:lib theory:lib wardrobe:lib tagsserver:lib\n\n-XTypeFamilies will be used, but it implies -XMonoLocalBinds, and so can cause type errors in code which expects generalized local bindings.\nIt is specified for:\n    mccme-launcher:lib mccme-launcher:exe:chrstm-exe\nBut not for: \n    chrstm:lib mathsystem:lib mccme-common:lib seshat:lib texface:lib theory:lib wardrobe:lib tagsserver:lib\n\nTo resolve, remove the flag(s) from the cabal file(s) and instead put them at the top of the haskell files.\n\nIt isn't yet possible to load multiple packages into GHCi in all cases - see\nhttps:\/\/ghc.haskell.org\/trac\/ghc\/ticket\/10827```","895":"Nimrod будет жить. Поприветствуем!","896":"У меня, например,  минимум в вычислении типов аргументов для sql запроса, и в работе с endpoint-ами servant","897":"И в частности автора стримли","898":"здесь можно поискать https:\/\/hub.docker.com\/u\/fpco\/","899":"Бабло","900":"Я могу ещё заметить, что в ML обычно rank1-полиморфизм, так что полноценного System F там и нету.\nКроме хаскеля он есть в Coq в виде Prop","901":"если у @qnikst будет гироскутер, я буду только рад","902":"Наверное просто приятно писать Generic в коде после 3-х лет писанины на Go","903":"я вроде просто потом пару пробелов в код добавил или пустую строку в конец файла, и нормально, зашло. но я долго не понимал проблемы.","904":"Ссылка на книгу появилась, когда я спрашивал, как это так: функции в хаскелле обязаны принимать минимум один аргумент (если мы не наызваем константы функциями), а вот data constructor может принимать ноль аргументов","905":"ага","906":"язык с фичами пруфассистента","907":"а dhall это нишевое порно","908":"Ну да","909":"Зачем?","910":"Хочу анонимные рекорды :(","911":"Я забыл синтаксис","912":"там про unsafePerformIO и про forkIO","913":"а если нужен возьми MVar и думай если тормозит","914":"А сколько в проекте строк?","915":"и никаких подробностей, почему wxcore упал?","916":"третий вариант мне тоже нравится","917":"Я не делал упор на gc.","918":"pointfree тоже, супер","919":"Но это же не Наука","920":"здесь нет","921":"Today you'll learn: https:\/\/hackage.haskell.org\/package\/base-4.14.1.0\/docs\/Data-List.html#v:stripPrefix","922":"Ещё это rts внутри rts","923":"сначала малтикор","924":"до этого например управление турникетами","925":"https:\/\/hackage.haskell.org\/package\/persistent-2.10.5\/docs\/Database-Persist-Types.html#t:PersistValue","926":"ну странность у них может поменьше, чем у тайпклассов еще","927":"Да, отсылку поняли правильно.","928":"обозначающий уберите мне из выдачи","929":"я кстати не понял у circleci есть интеграция с gitlab?","930":"Тем, что на нём только хаскелисты разговаривают","931":"Делание импортов явными это кажется более полезное дело, чем удаление ненужных :)","932":"Логично, время свое экономят","933":"все проблемы от недостатка типов ⬇️","934":"Мб сделать публичный гуглокалендарь?","935":"А чего тебя ловить. В хаскелле все функции чистые, оправдывайся","936":"пасиб","937":"","938":"```f = \\x -> let g = \\y -> x + y\n            in g x```\n\n> The payload of the function closure contains the free variables of the function: in the example above, a closure for g would have a payload containing a pointer to x.\n\nНа хипе представлен как:\n```Header  Pointers...  Non-pointers...```\n\nвнутри `g` у нас будет просто указатель на то место где первый параметр в хипе","939":"а ещё там какая-то левацкая форма...","940":"ну зачем прямо учебник, https:\/\/regex101.com\/","941":"теперь должно выдавать результат, который соответствует питоновскому. Работает за 1.2 секунды на моей машине","942":"за что вы так ненавидите модули","943":"в целом тебе прост как-то не повезло\nну или ты рил гдет выше набросил","944":"если мы применяем () то у нас опять кайнд * -> *","945":"ну, этого никогда не будет","946":"_ <- лучше чем void","947":"Человек для того, чтобы удовлетворить требования выбирает решение, которое чешет ЧСВ","948":"На часть ответили. Еще есть вопрос, но его трудно сформулировать.","949":"как чистить этот стейт будешь после часа работы проги?","950":"у servant вроде туториалы неплохие","951":"у спам фильтра много false positive","952":"а, ну видимо нужно просто в stm его запихать, да. но это просто стм. немного другой подход","953":"deriving Enum можно:\n\nhttps:\/\/downloads.haskell.org\/~ghc\/latest\/docs\/html\/users_guide\/glasgow_exts.html#stand-alone-deriving-declarations","954":"ох уж эти демоны","955":"вызова нету","956":"Два мира, два Саймона:\nМарлоу - 19 месяцев и продолжает ждать\nПейтон Джонс - приняли за 3 месяца","957":"а такие есть?","958":"ну нет, к примеру, фандепы включают МПТЦ, но люди массово пишут и то и другое, без этого включение МПТЦ в 2021 ниче не сэкономит","959":"А, вижу. Круто. Шабанов вроде?","960":"в индустриальных языках наоборот любят недоделанность плодить, потому что фича в релиз не пролезает. в том же сишарпе из-за этого два синтаксиса для лямбды и два для объявления метода даже","961":"Теперь у меня есть функция deepPure, которая в зависимости от типа заменяется на нужное количество композиций pure (от нуля включительно)","962":"вообще хабр смешной, вроде в послдених моих статьях было 0 комментариев","963":"Но это если","964":"тупо тайпклассы?","965":"это, наверное, верно","966":"ну все алгебраическое - удобное)","967":"конечно. он очень дружественен к новичками и заточен под быстрое выкатывание хелло волд","968":"Wasm работает с DOM-ом пока только через JS","969":"значительная\nфункция захватывает окружение в месте вычисления лямбда выражения, код смотрит в окружение, в котором его исполняют","970":"Почему-то генерация хаддока для haskell-src-exts убивает контейнер 😒","971":"может, [hs]c2hs ещё проще?","972":"@iamweasel давай без картинок плз","973":"так что да, давно","974":"Вот туалетная бумага в деревнях стала широко использоваться только лет 15 назад","975":"Можно его пингануть","976":"нет","977":"А, тогда ничего не могу сказать","978":"не, юрисдикция где?","979":"а вот``` let x = trace \"foo\" (5::Int) `seq` ()```","980":"то, что убрали, хотя бы работает","981":"Они тоже импортируются, из прелюды.","982":"Код еще неполон: нет поддержки итераторов (скоро будут), а также мы подумаем над более оптимальным способом взаимодействия с БД","983":"Не знаю","984":"~~300кк\/нс платите джунам?~~ (простите)","985":"это разные \"понятный\"","986":"ну это стендалон","987":"\\(Foo Bar (Baz qux)) -> ...","988":"а собирать одну программу из пакета Кабал не умеет","989":"Если нажать на него видно что это бот, да и ник на bot оканчивается, как и у всех ботов(нельзя им другой ник дать)","990":"HIE работает","991":"ну тогда три варианта есть:\n- пофиксить common проект\n- лифтить в своем проекте все коммон-парсеры\n- в своем проекте сделать ImplicitParams и все, никаких ридеров","992":"вроде уже нашёл что надо","993":"термин наших дней?","994":"вот тебе http-conduit без линз и даже без кондуитов\n`> do {input <- simpleHttp \"https:\/\/ya.ru\/white\"; let {title:_ = [t | TagText t <- parseTags input]}; Data.ByteString.Lazy.Char8.putStrLn title}\nЯндекс`","995":"цыц","996":"это очень достойно, но кушать тоже что-то надо","997":"из-за инстансов лишних","998":"Так это не тот же safe-exceptions разве?","999":"Не?"}}