{"text":{"0":"I only thought of json_arrayagg for the 3rd query string, but it seems that there is a more elegant solution, who knows, please tell me, thanks","1":"They are quite similar except one thing: HAVING is applied logically after GROUP BY, when all aggregates have been calculated already and that is why only in HAVING you can place filtering expressions which are based on aggregates.","2":"both are same but why is that this worked and earlier did not work","3":"Databases scale vertically.","4":"yes i know that is how i run it from terminal as simple command","5":"They had mentioned while sharing the questions","6":"Clustering z ok...because we have have DR 2 servers at Delhi and 2 in Mumbai and all 4 server in cluster ......Nd proxy IP given to application team for the operation","7":"What is your question, if you have some?","8":"Try these..","9":"Yes","10":"Please share the imdb.sql dataset","11":"Crudt?","12":"because rows in each table must be identifiable and distinct","13":"If you have any reference for the same could you please share with me? \n\nI havent configured proxies so far","14":"","15":"I intend to do a mount -a also to check","16":"Then no...","17":"Во-первых тебе сюда @mysql_db во вторых, учить SQL, тут у тебя все неверно по синтаксису.","18":"Yes, as the sub query is under EXISTS predicate","19":"And, BTW, some DBMS DO use FKs for JOINS, this kind of joins is called NATURAL JOIN and doesn't need specifying JOIN condition.","20":"Okay","21":"I have one html form now I want to store the data in database using python without any frameworks","22":"Hey...I have a new requirement on my project","23":"C","24":"Just insert string you want","25":"Some help in extracting that data","26":"Thanks a lot bro😇","27":"Well it’s kinda like LinkedIn and Instagram.\n\nLinkedIn - tags based searches\nInstagram - videos and pictures","28":"Is anyone working in JP morgan??","29":"","30":"So tell us more about it. You are trying to import a data file into a third party tool like mysql workbench?","31":"😂 that's what I'm doing bruh ..","32":"I want to execute mysql query not through command line or any terminal want to execute it through windows batch script whose extension is .bat","33":"I think select will come first then if","34":"I'm not a native speaker. It is a crime?","35":"Any one have MYSQL quarries questions with tables for join practice ???","36":"Sure, the idea of the qr code is from my friend, he is a teacher the management office organize a  Competition between teachers to give creative solutions, he asked me to do this idea for him","37":"I know how to download\nYou can dm me","38":"For interview and skills","39":"","40":"is better","41":"In the error log file of server, getting warning many times saying \" Innodb: page_cleaner : 1000ms intened loop took 6953ms. Settings might not be optimal.\"\nHow to rectify it. How to get optimum settings value.","42":"Table Name **frn_limit**\ncolumn Name **f_code**\n\nCDDC93001\nCDDC88001\nCIR01081\nCIR01141\nIRD0173001\nIRD1204001\nRDC1204001\nRDC1204002\nRDC1285001\n\n**Now I want to remove characters prefix and show 4 digits from ending of prefix. **\nAnyone helps me to make the query please","43":"Code 1064","44":"Check if the insert trigger is there","45":"but last player in my overview has 0 points, because he lost all games","46":"","47":"https:\/\/sqlize.online\/sql\/mysql80\/f6afce927ee43cd69256474acb513e60\/","48":"how to check last login time of user in mysql database?","49":"Thanks 🙏","50":"Migrating data?","51":"","52":"MySQL","53":"Here are two tables","54":"Like this","55":"a1b2c3d4e5","56":"Backup Filename","57":"Hello, why is Mariadb Fielded?","58":"How to update field in one table but filed has to be taken from another table?\nCan u pls help me to write Query with your own example","59":"Last inserted value?","60":"Or maybe you have some customized login behavior","61":"How to create db inside db in mysql?","62":"Use mysqldump utility","63":"I completed one form and  given data in my admin PHP but when entered some data in form then this entered data not show on my admin","64":"each time when you want to say \"that does not work because I tried and it did not work me\" try to find out if someone else tried the same and it worked. there is high chance that you might fall into survivorship bias. just a kind reminder","65":"I am interested to learn mysql anyone can help me","66":"Hi all","67":"I'm just starting out. Idk if this is a good fit for me?","68":"Link pls","69":"What is this \"block nested loop\"?\nExplain your question in more details","70":"I have to export 6 thousand data to a table in html, but it takes a long time, how can I improve?","71":"this happens if we dont use a active connection for a specific time\nbest solution is to only activate the connection when its needed and then close the connection\nit worked for me","72":"Please anyone help me with resources","73":"Anyone","74":"i tried putting the sql on mysql workbench to see if it works and it does work","75":"Hi please help me with this When they run the query from workbench or API..how to find the time taken for that query","76":"Atleast post complete photo witg schema and sample data tables","77":"You have a wrong GROUP BY in the second query.\nNon-ansi.","78":"there is a lot of material about database...read some, get into concepts - user management, roles\/grants, backup, restore\/recover, performance - then you can practice on mysql.","79":"Hi Guys can someone please share some docs to create mysql database schema for a chat system which contains the following :","80":"Special data types can be used for building special indices.\nCheck if your version supports such indices.\nI never used them","81":"SELECT district.district_id,district.district_namr, COUNT(block.block_id) as count_rural, COUNT(local_body.id) as count_urban FROM district LEFT JOIN block ON(district.dist_id = block.district_id) LEFT JOIN local_body ON(district.dist_id=local_body.district_id) WHERE district.division_id=2\nGROUP BY district.district_name","82":"Hi","83":"Datagrip. But it's licensed","84":"The hard questions","85":"I tried many times but no success","86":"Any one can help?","87":"Hi experts can anyone provide upgrade document for mysql 5.7 to 8 with minimum downtime. Thanks","88":"😊😊","89":"If u re installed it u can create new root account","90":"Any documents or meterial please send me","91":"Please can someone help me create a query statements for this ERD 🙏","92":"Сон - это святое ))","93":"Share link","94":"Anyone has worked on MySQL clone plug-in","95":"This one is quite good, but ISIN a derived table introduced with WITH keyword is not necessary here, you could just have it like a simple uncorrelated subquery.","96":"Have you been able to make connection earlier, with same connection string?","97":"","98":"but how?( --overwrite-tables didn't help (","99":"I can read it , I can't understand it","100":"This is not even close to what's needed.","101":"hi , i need help with an exercise","102":"Where is your SSL stuff placed?","103":"https:\/\/www.instagram.com\/reel\/CnjkNqsIllc\/?igshid=MDJmNzVkMjY=","104":"Which OS do you know better than other?","105":"Iam learning sql also bro","106":"Can you use\/have you tried using shell for inserting data instead of phpmyadmin?","107":"Plz share a dataset","108":"Target server means?","109":"Total messages: 29997","110":"Sure. I got it.","111":"ALTER DATABASE old_database_name MODIFY NAME = new_database_name;","112":"Where unit sold> 500","113":"I need help","114":"wasn't you, excuse me","115":"https:\/\/www.tocopyengineer.in\/2023\/04\/rabbitmq-subscriber-code-example-in.html","116":"Is there any internship for data analysis or Sql.","117":"No","118":"I used two times","119":"I can , read books, go to study in an university.","120":"Sorted Bro","121":"What to do","122":"Looks like it's not just me, I thought MySQL guys know say something, but there's nothing to hear, even from the channel owner.","123":"hello guys","124":"Can I use this to get table size","125":"can be something with the underscore (_)??","126":"What happen?","127":"that is my only dis","128":"Should I translate the text? Maybe you can get better","129":"SELECT '    *' AS pattern\nUNION ALL\nSELECT '   **'\nUNION ALL\nSELECT '  ***'\nUNION ALL\nSELECT ' ****'\nUNION ALL\nSELECT '*****'","130":"There is other noises as construction work is undergoing","131":"I'd used join and aggregate function COUNT with grouping for such query","132":"I doubt. \nThis softwarte is tested well","133":"Using php","134":"How do you want we to help?","135":"I will try with slave_parrallel_type parameter and i will try","136":"You need 10 rows result for or single row result with 10 lines","137":"Hi","138":"Plz tell what is wrong in here","139":"what do u need","140":"How can i solve this!? Help me","141":"Which version of MySQL are you using ?","142":"Hii sir i want to know how to give access to admin and user with different privileges using mysql","143":"If example ram.Suresh in this anywhere if . There it should be rejected","144":"10000 record of day","145":"Is there any impact if increase the max_connection 500 to 2000","146":"","147":"Any other solutions available","148":"Anyone????","149":"https:\/\/www.w3resource.com\/mysql\/string-functions\/mysql-replace-function.php","150":"I want to connect the MySQL from second server which doesn’t have MySQL installed","151":"look into the docs on this function, it seems like you are calling it in a wrong way","152":"Like this","153":"If there were these four or thoughts would come","154":"which dataset?","155":"What programming language makes queries to DB?","156":"Don't send screenshots of your code to the chat","157":"I was. Working on workbench","158":"Well having a cluster and load balancer doesn't mean you would be free of deadlock","159":"I can say you the truth: just touch both databases on real project. Only it means, words in the Internet not so much helpful as you think.\n\nYou real cases show which database is better suit your concrete problem.","160":"Send code as text , please","161":"Hi guys How can we check that we have enough space in our table space","162":"","163":"Try another engine","164":"Where are you located?","165":"Means first by connect to db then execute query on that table","166":"Hai i want to know how to solver this error? i am trying to connect ms access odbc to mysql... i installed odbc driver but when test mysql database it shows error connection failed. pls give solution anyone expert pls","167":"Hi team, I have 1 table with 20,00,000 records. I need to add index for that. Before adding the index can I check how long it will take to execute the index query? Is any solution for that?","168":"I meant if there are 2 records of duplicate value across all columns it should have retained one record which is not happening","169":"hey. there is a chat for russian speakers.  you can ask your question there using your mother tongue. it would be easier for you to explain what is the issue","170":"```CREATE TABLE `tb_banners` (\n  `id` int(11) unsigned NOT NULL AUTO_INCREMENT,\n  `slot_id` int(11) unsigned NOT NULL,\n  `campaign_id` int(11) unsigned NOT NULL,\n  `created_ts` int(10) unsigned NOT NULL,\n  `last_update` int(10) unsigned NOT NULL,\n  `website_id` int(11) NOT NULL DEFAULT '1',\n  PRIMARY KEY (`id`),\n  KEY `slot_id` (`slot_id`),\n  KEY `campaign_id` (`campaign_id`),\n  KEY `on_date` (`created_ts`),\n  KEY `last_update` (`last_update`),\n  KEY `FK_TbBanners_TbWebsites` (`website_id`),\n  CONSTRAINT `FK_TbBanners_TbWebsites` FOREIGN KEY (`website_id`) REFERENCES `tb_websites` (`id`)\n) ENGINE=InnoDB AUTO_INCREMENT=1035 DEFAULT CHARSET=utf8```","171":"Can anyone help me with this query","172":"I think they would have guides on their site","173":"Alter table xxxx add constraint yyyy unique (Field1, Field2)","174":"I can't change my laptop","175":"Tomorrow check","176":"How to create new rest api in pipefy... Plz guide me... I give payment","177":"hi guys i'm having a problem with remote connect to mysql server,","178":"What is class here?","179":"S ...if the referral_id have null then it should replace that with 2","180":"what I'm doing wrong ??????","181":"How to write  a query  in mysql to get top3  product names  which got sold","182":"What is that?\n\nAs previously I use to add server IP address.\n\nAnd create a user then they were getting connected.","183":"--Expected Output  \n-- id Code Totalpoint Earnpoint FinalPoint  \n 1 1001   10   6     4  \n 2 2001   20   6     14  \n 3 3001   30   16     14  \n 4 4001   40   0            0     \n 5 5001   50   0           0","184":"Tanks","185":"Then the structure of the db must be identical. How do you expect it to work after the swap?","186":"but mysqlsla  was deprecated long time back","187":"Hi I have table in MySQL RDS of size 2.3 TB","188":"A table with fields\n•Location \n•Location Code \n•Account\n•Tower\n•Engineer\n•Caller\n\n✓ Each Location will be having a location code.\n\n✓ Each location will be having certain number of accounts \n\n✓ Each account will be having Different callers and Different Towers\n\n✓ Each engineer will be working for two or more accounts\n\nAny other info needed!","189":"Hi.. anyone here who can help in MySQL certification exam","190":"Created composite index in the same order in which write those Columns in the query after where clause","191":"any one know please tell me","192":"Find the employees being incremented\/appeared for 3 years continuously\/sequentially","193":"If I put sql server in resume\nWill the company accept my position for mysql","194":"Anyone wants MySQL study material ping me.","195":"Sure will check","196":"I am interested","197":"My terminal after 2 min says can not connect to Mysql server on …","198":"9 women in a month will not give birth to a baby","199":"Damn no","200":"Friends, does anyone know if there is any disadvantage in adding a column in a table in a DB in production?","201":"How do I go about it","202":"Restore is failing at same table again or it's different break point every time","203":"I created after update trigger in MySQL but it is not in sync with the source table not all the records are inserting can anyone help me here","204":"Your are forming query using sequelize , check the conditions for pagination","205":"Good night group\nXsia do not have a transact-sql example","206":"are you sure? 😊","207":"Can you guys help me?","208":"And the key idea here is that you time depends on the key of your table, witch is (artist, song, album) , doesn't depends on Song, part of the key","209":"I wrote store procedure it'showing wrong","210":"It is same way as the DB would be on a remote host, but replace host name with 'localhost' or '127.0.0.1'","211":"Which is appended","212":"For selecting the or insert the records?","213":"Can someone share some good resource to learn schema design (beginner)","214":"","215":"Or do you use Kali?","216":"Write query for it in the stored procedure and schedule it for every 10th day","217":"select e.emp_name, min(b.booking_date), max(booking_date) , sum(b.amount), avg(b.amount)  from employees e inner join booking b on e.emp_id = b.emp_id group by e.emp_name;","218":"Hiii","219":"","220":"cli","221":"I have and I wanted to reinstall it, I don't have another poppy to make an image for reinstallation via a USB flash drive. If someone knows, you can help, or give a link to someone who knows! Thanks for help!","222":"You can cache the count in another table and have insert and delete trigger to maintain the count","223":"There is no date column","224":"To make it faster you should make it smaller","225":"Is this a database query ?","226":"this is right query","227":"Just go with inplace upgrade, it's a minor version upgrade","228":"Can you share the log tab screenshot ..where it was waiting ...did you see lower case table name = 0?\n\nYou can do one more thing ..duing configuration after you set the port number pipe etc..left hand side click advanced ..there you have option like log error names etc..you can setup lower case table is 1 if default vallue is 0 or 2...","229":"👍","230":"No","231":"Corrupted lampp, there's no help!","232":"Anyone can help for mysql stored procedure","233":"Computer can have many apps","234":"Just need to add parallel thread parms","235":"","236":"How to recheck user&password","237":"i used but not working bro","238":"Try this once","239":"Ok","240":"Hello everyone","241":"That was my thought as well I restarted the service and tried and again same when I checked processlist those queries are again there even after restart. Any soultion for this","242":"I don't think so","243":"I exported and imported data from back up like events","244":"Can you show us DDL of your table ?","245":"Is Mysql POSIX compliant or PCRE?","246":"","247":"is anyone familiar with Percona PMM install?","248":"","249":"https:\/\/wazirx.com\/invite\/y4quxncd\nI use WazirX Bitcoin exchange and love it! Their latest unique feature, Smart Token Fund, helps crypto investors find expert traders, and let them manage their cryptocurrency portfolio. Check it out!","250":"Don't ever use things like this, don't use variables in a quiery other way then as parameters.","251":"What to change some yes into no, can gave MySQL query for it","252":"Hello everybody! I downloaded MySQL Workbench 8.0 and Sakila Database. When I clicked \"Run SQL scrip\" appears this message:","253":"i don't know why my teachers give these crazy assignemnts","254":"It's will work","255":"So sweet. Our little hacker ask to run something. Have you ever heard about docker?","256":"thank you @MasterZiv","257":"","258":"Send us your variant, we will check it!","259":"Can some one help on this issue","260":"lol","261":"Eto vraniyo","262":"Check the config file php.in","263":"Why not create 3 sub queries then?","264":"I am a beginner and want to download mysql bu am unable to","265":"🙏I need help I don't know now to link my html registration form to MySQL database using PHP, please I need your ideas","266":"It’s fun","267":"New here,guys👏😼😁","268":"yes, I do","269":"After dumping","270":"What would been faster, watch a movie using stream or download it directly?","271":"Sell and bash is same","272":"Thanks bro","273":"https:\/\/www.google.com\/search?q=replace+subquery+with+join&oq=replace+subqu&aqs=chrome.1.69i57j0l7.8788j1j7&sourceid=chrome&ie=UTF-8","274":"https:\/\/dev.mysql.com\/downloads\/installer\/","275":"What is the issue","276":"I want SQL depend on the lines the users select","277":"You are getting this error with this specific query or all queries?","278":"i want to update the exact data from table 2 to table 1","279":"Oki but how can i normalize that column?","280":"Select salesman_id, name, city, commission\nfrom salesman \nwhere salesman_id in (select salesman_id\nfrom customer\ngroup by salesman_id\nhaving count(1) > 1)","281":"sorry i misundestand","282":"For example if we took full backup on Sunday then from monday to Saturday will be incremental backup","283":"I failed to understand why there is locks for all rows.\n1. Begin\n2. Insert into wallet without populating UK column.\n3. Insert into table2\n4. Update UK column in wallet table\n5. Commit.\nWhat i did see that at some point slave is executing updates but it is slow because of locks. So inturn slave lags keeps on increasing","284":"Hello. Anyone who would like and we practice SQL together","285":"True, some people read that as flexibility\nAlthough schemas can be explicitly enforced on a collection if necessary","286":"🍻","287":"Does anyone know a good way to exclude periods from a match?  Like if someone searchs \"aj bubble\"  it will match \"a.j. bubble\" ?","288":"Can you DM me","289":"What are data types in SQL?\nhttps:\/\/youtu.be\/ColCrjmBXjc","290":"You need to stop the master, then import the dump of the database to a slave, connect to the master by the \"CHANGE MASTER TO\" command and then turn on the master and then a slave","291":"by using mysql console utility","292":"Can * or 1 come in place of kumantame?","293":"Anyone from Andhra Pradesh or Telangana","294":"need to convert this to sub query.","295":"What issue u r facing while installing mysql","296":"Then practice","297":"I have been trying but it's working","298":"I don't think any changes are required, a host can have many names and the DB should not rely on this.\n\nYou can actually leave the old name for a while","299":"Already exist database","300":"so opening and closing a new cursor is the right way?","301":"also `relay_log_pos` is stuck","302":"See","303":"Create view name_of_view as\nSelect 'deptoo' || primarykey_columnname\nfrom tablenam","304":"does one belong to database developer background?","305":"Thanks but can you help me with a good material\/article for ER diagram","306":"hello\nthis is a simple query to solve a problem but my score is always 0\nin problem said the query should execute with MySQL\ndo you think this query semantically wrong or not?","307":"Should the format of date be like \"2020-02-15\"?","308":"","309":"But when I tail my .err file it showing something \n'shutdown complete'","310":"I want small help from brother to brother","311":"Both are tinyInt, but the first one is primary key, which can't be null","312":"Make it in self join","313":"India","314":"Like\nSelect * from mytable AS ALIAS;","315":"For example","316":"Single instance to replication or cluster ?","317":"share the file ocelot.sql","318":"Help with this one too.🙏🙏","319":"userrole.sql","320":"Okay bro","321":"Can anyone suggest and explain this","322":"?","323":"there could be such depth in one branch","324":"","325":"2 partitioning - it does not work always as a positive technology...","326":"`Aborted connection 110 to db: 'DBTest' user: 'username' host: 'x.x.x.x' (Got an error reading communication packets)` How i can resolve this problem? 1 of 2 query generate this... and this `Connection attributes of length 106 were truncated\n\n`Query like this... `UPDATE users SET in_group=1 WHERE id=18121313`","327":"Dm","328":"Learn more!","329":"Hi everyone \nSrinivas here\nI'm looking for job in Hyderabad. Having experience of 1 year as HR. Recruiter. Kindly let me know if there are any new openings \nI have basic knowledge in Excel, SQL, Tableau.\n\nPing if anyone from Hyderabad ✌","330":"Yes, but any solution","331":"","332":"https:\/\/dba.stackexchange.com\/questions\/9756\/mysql-thinks-master-slave-have-the-same-server-id","333":"Hi all\nHow can I download all the general log file for the MySQL in the AWS MySQL RDS. Have enabled the general log file in the RDS but able to see only the last 1 day log files from the console. So want to download all the general log files created in the MySQL RDS. Please let me know anyone knows that","334":"Many things:\n\nWhat's the DB engine? MyIsam takes a table level lock. Use InnoDb\n\nDo you have indexes?\nHow many records updated per query, etc","335":"Mongo's advantage lies in its flexible schema design - so updation of one document is inherently ACID compliant","336":"Probably this is because a subquery must have an alias","337":"It seems to be data type issue","338":"Can anyone explain this query","339":"Any suggestions please","340":"","341":"You must first form this subquery you almost wrote giving you the maximum number of supplies, as the derived table or CTE, then join it back to the table by the number of supplies and output and sort","342":"Guys..Any idea on Azimutt","343":"yes","344":"Can u send it here? It seems a PHP coding bug tho","345":"Take a photo","346":"","347":"why 999999,0.15 is not taken inyo consideration ?","348":"Hlo team if anybody can send mysql based resumes for freshers","349":"Follow my instagram account @mysql.2023, for mysql","350":"2 question vachhu aa bro","351":"I think cuz having clause can only be used to filter out the group...so in this case max(salary) is an aggregate function which works on whole the group and we can't extract salary of a single row alone... So max(salary) can only be compared with something else like..>10000 etc","352":"now I want maximum salary for each branch","353":"ERROR 1215 (HY000) at line 28285: Cannot add foreign key constraint","354":"And I had already showed you queries to google which you need","355":"Design a database for an Airline. The database must keep track of customers and their reservations, flights and their status, seat assignments on individual flights, and the schedule and routing of future flights.\nYour design should include an E-R diagram, a set of relational schemas, and a list of constraints, including primary-key and foreign-key constraints.\n\n\n\n\n\nAnyone please help me for the above program in Oracle sql.....","356":"show?","357":"","358":"I don't knew that we have query like this","359":"Hello , can someone tell me if it is the correct query for searching in database?$sql = \"SELECT * FROM products WHERE title LIKE '%$searchTerm%'\";","360":"I have used the update \nBut if I fetch after updating , hyphen is coming","361":"you should  not learn SQL in a chat! read books!","362":"Finally found correct solution","363":"Check if the service is running on the respective port from the service management if you are in windows","364":"Total messages: 4277","365":"Is it developer or support department issue?","366":"","367":"Need Max avg salary in department","368":"with the same structure and same query for same table in other database it wil using the IDX_QueuePosition index ,why its happend to this table only,, any suggestions","369":"In SQL  use replication but here I don't know","370":"I want to make repilication of mysql 8 on window s","371":"FKs ARE ONLY for data integrity.","372":"You have lost the join condition, ON phrase","373":"Can we estimate a query execution time?","374":"RDBMS IP port(s) should not be accessed from Big Internet.\nNever.","375":"So i recommend creating a parent entity for all of them, like \n\"Person\", which will be used for storing names, contacts and all other common things for people.","376":"Hello.\nCould you help me pls?\nHow can I solve this?","377":"What resources..?Share to me..","378":"Thanks","379":"But migrations is exactly PHP code.\nBy the way, your sandbox couldn't help me with my style of PHP code. Take a look at gitlab.com\/pyro-plus","380":"a query completes in 2 hrs daily, but today its been 4 hrs, but nt completed yet. on looking further into the system, found it  having \"wait\/synch\/sxlock\/innodb\/btr_search_latch\". so trying to understand it what it means and where it could be originating.","381":"Anyone tamil people here.","382":"Hello all will any one share the beginners course of sql","383":"planet.mysql.com","384":"","385":"This is the common error message you have to check the mysql **error log** to see the actual error","386":"🤔","387":"Java","388":"Who has this one?","389":"So your message is not relevant for the group , I'll delete it","390":"For beginners","391":"Update documents set c39 = c38 where iddocuments = 31345","392":"Need American information, if you can get a valid bank card in the United States, please send me a message, long-term need","393":"When I try to dump the complete MySQL system, I get this error:\n\nCouldn't execute 'SELECT \/*!40001 SQL_NO_CACHE *\/ * FROM `GLOBAL_STATUS`': The 'INFORMATION_SCHEMA.GLOBAL_STATUS' feature is disabled; see the documentation for 'show_compatibility_56' (3167)\n\nGot error: 3167: The 'INFORMATION_SCHEMA.GLOBAL_STATUS' feature is disabled; see the documentation for 'show_compatibility_56' when retrieving data from server","394":"Shift the data according to LANGAUGES I'd","395":"Not sure sir, pls guide me","396":"Root@localhost is a super user. How come you have this error?","397":"SELECT IFNULL(customer_name, \"N\/A\") customer_name, IFNULL(product_name, \"N\/A\") product_name, IFNULL(quantity, 0) quantity\nFROM customer \nLEFT OUTER JOIN invoice ON customer.id = invoice.customer_id\nLEFT OUTER JOIN invoice_item ON invoice_item.invoice_id = invoice.id LEFT OUTER JOIN product ON invoice_item.product_id = product.id\nORDER BY customer.id, product.id;","398":"Hi Guys, i want select  one of signle column  with out adding GROUP BY & AGRREGRATE FUNCTION but some other columns i want apply GROUP BY & AGRREGRATE FUNCTION applay. how to achive this please? Thanks in advance .","399":"Multiple choice quiz","400":"","401":"How to add columns value in a column","402":"I try but I couldn't","403":"Swapnil","404":"Does any provide Documents for IT from Pune kindly ping me","405":"Everytime it should show top 10 queries which is taking long time to respond...","406":"Don’t byte him!!!1","407":"@BlackshadowR1","408":"gunnyvenkat:\n---- create a procedure with variables :- live table name\/staging table name\/key column to match records.\n---- so that we can join with live and staging table and delete matched records using keys and then insert data from staging to live table\n--- use dynamic sql\n\nI need to create my own live table and staging table","409":"Hi, any guide for MySQL partitions","410":"Yes","411":"https:\/\/serverfault.com\/questions\/52794\/how-do-i-allow-remote-access-to-mysql-using-xampp","412":"Hibernet is java framework bro","413":"CREATE TABLE `cale` (\n  `id` bigint(20) NOT NULL,\n  `text` varchar(20) NOT NULL,\n  `from` datetime NOT NULL,\n  `to` datetime NOT NULL,\n  `type` tinyint(4) NOT NULL,\n  `fre` tinyint(4) NOT NULL,\n  `end` date NOT NULL\n) ENGINE=MyISAM DEFAULT CHARSET=utf8;","414":"read the docs","415":"Null","416":"Yes","417":"declare \nCURSOR c1 is \n      select cnae_code, mcc_code from sistema.cnae_mcc; \nBEGIN \n open c1  ;\n   loop \n   update sistema.company set mcc_code = x.mcc_code where cnae_code = x.cnae_code;\n\nend loop;\ncommit;\nEND;","418":"Where condition","419":"Pls","420":"ask a decent question and you can get help","421":"I can help in sql","422":"What does attendenc system mean?","423":"Check out articles and news on newsfeedxtra.com","424":"I have an existing database to which I would like to add full text search.","425":"You can DM me if u have any difficulty with SQL and python.","426":"please","427":"May be ; after END is required","428":"Please help me","429":"That's for a different reason entirely though, thanks to @piterden I understand that\nIt's because of branch predictors and in general - a bst implementation might improve search times, but the data can exist in ASC order in the indexes as well","430":"Tell","431":"for this query, is there any way to put npres and rev in the same subquery? without to make 2 subquerys","432":"Hello anyone know tool for view data of mysql without run query","433":"Even","434":"There is a way to store a new \"global\" variable, that doesn't get cancelled after the session ends?","435":"are you using pagination ?","436":"Table?","437":"Dear Folks, Could you please share pre-requisite steps for migrating MySQL to Azure cloud (IAAS or PAAS) model","438":"Yes","439":"I am sure this will work\nhttps:\/\/fakestoreapi.com\/","440":"Aur to write this code","441":"Also, use mysqldump of same version as your dump source db","442":"thanks, will ping you","443":"Please let me know how. To resolve the same","444":"Search for connection pools corresponding to the programming language you are using","445":"Let me reframe the question again ..Need to calculate the commission created table","446":"And which driver","447":"","448":"Case statement I used ,but for percentile how to write code ? \n\nHow to decode percentile is my question","449":"Ok","450":"I think it’s a concat. Try this but not sure.\nSelect order_id  ‘, ‘ ,  product_id AS frequently_bt FROM table_name.","451":"Post input table details first","452":"what can I do","453":"Any Mysql dba having 2-3 years experience","454":"https:\/\/youtu.be\/ujYqIpwsZGQ?si=TZzHeykZogDvyZi3","455":"if you could help i would be really grateful, have a good day","456":"Yes","457":"How could it be happened I spend more days in a group than the creator??? Hm...","458":"What will the the right answer?","459":"Yess it worked","460":"Afaik , no.","461":"eg given 2009-01-01 and 2009-01-13 it would return a one column table with the values:\n\n 2009-01-01 \n 2009-01-02 \n 2009-01-03\n 2009-01-04 \n 2009-01-05\n 2009-01-06\n 2009-01-07\n 2009-01-08 \n 2009-01-09\n 2009-01-10\n 2009-01-11\n 2009-01-12\n 2009-01-13","462":"CREATE TABLE tb_city ( \n  id_city int , \n  city varchar(30) DEFAULT NULL, \n  PRIMARY KEY (id_city) \n); \n \ninsert  into tb_city(id_city,city) values  \n(1,'Banda Aceh'), \n(2,'Langsa'), \n(3,'Lhokseumawe'), \n(4,'Sabang'), \n(5,'Subulussalam'), \n(6,'Bandung'), \n(7,'Bekasi'), \n(8,'Bogor'), \n(9,'Cimahi'), \n(10,'Cirebon'), \n(11,'Depok'), \n(12,'Sukabumi'), \n(13,'Tasikmalaya'), \n(14,'Banjar'), \n(15,'Magelang'), \n(16,'Pekalongan'), \n(17,'Salatiga'), \n(18,'Semarang'), \n(19,'Surakarta'), \n(20,'Tegas'), \n(21,'Batu'), \n(22,'Blitar'), \n(23,'Kediri'), \n(24,'Madiun'), \n(25,'Malang'), \n(26,'Mojokerto'), \n(27,'Pasuruan'), \n(28,'Probolinggo'), \n(29,'Surabaya'), \n(30,'Binjai'), \n(31,'Gunungsitoli'), \n(32,'Medan'), \n(33,'Padangsidimpuan'), \n(34,'Pematangsiantar'), \n(35,'Tanjung Balai'), \n(36,'Tebing Tinggi'), \n(37,'Bukit Tinggi'), \n(38,'Padang'), \n(39,'Padang Panjang'), \n(40,'Pariaman'), \n(41,'Payakumbuh'), \n(42,'Sawahlunto'), \n(43,'Solok'); \n \nCREATE TABLE tb_prov ( \n  id_prov int, \n  name_prov varchar(30) DEFAULT NULL, \n  PRIMARY KEY (id_prov) \n); \n \ninsert  into tb_prov(id_prov,name_prov) values  \n(1,'West Java'), \n(2,'Central Java'), \n(3,'East Java'), \n(4,'North Sumatra'), \n(5,'West Sumatra'), \n(6,'Aceh'); \n \n \nCREATE TABLE tb_cases ( \n  id int, \n  id_prov int  DEFAULT NULL, \n  id_city int  DEFAULT NULL, \n  cases varchar(30) DEFAULT NULL, \n  PRIMARY KEY (id), \n  --KEY id_prov (id_prov), \n  --KEY id_kota (id_city), \n  CONSTRAINT tb_cases_ibfk_1 FOREIGN KEY (id_prov) REFERENCES tb_prov (id_prov) ON DELETE CASCADE ON UPDATE CASCADE, \n  CONSTRAINT tb_cases_ibfk_2 FOREIGN KEY (id_city) REFERENCES tb_city (id_city) ON DELETE CASCADE ON UPDATE CASCADE \n); \n \ninsert  into tb_cases(id,id_prov,id_city,cases) values  \n(1,1,7,'86'), \n(2,1,6,'75'), \n(3,2,15,'93'), \n(4,2,19,'154'), \n(5,1,9,'136'), \n(6,3,23,'89'), \n(7,3,25,'177'), \n(8,1,11,'193'), \n(9,1,8,'99'), \n(10,1,10,'144'), \n(11,2,16,'79'), \n(12,2,17,'156'), \n(13,2,18,'68'), \n(14,3,24,'180'), \n(15,3,22,'73'), \n(16,3,21,'148'), \n(17,6,1,'83'), \n(18,6,5,'95'), \n(19,6,2,'40'), \n(20,6,3,'163'), \n(21,6,4,'58'), \n(23,5,38,'68'), \n(24,5,37,'190'), \n(25,5,43,'64'), \n(26,5,41,'59'), \n(27,5,40,'123'), \n(28,4,31,'77'), \n(29,4,32,'187'), \n(30,4,35,'74'), \n(31,4,34,'52'), \n(32,4,33,'143'); \n \n \nselect a.name_prov as prov,city,a.cases \nfrom \n    (select c.name_prov,b.city,a.cases, \n    row_number () over (partition by c.name_prov order by a.cases::int desc) as rn \n    from tb_cases a  \n    join tb_city b on a.id_city = b.id_city \n    join tb_prov c on a.id_prov = c.id_prov \n    order by c.name_prov \n    ) a \norder by a.name_prov,rn \n \n\nOutput:\n     prov      |      city       | cases  \n---------------+-----------------+------- \n Aceh          | Lhokseumawe     | 163 \n Aceh          | Subulussalam    | 95 \n Aceh          | Banda Aceh      | 83 \n Aceh          | Sabang          | 58 \n Aceh          | Langsa          | 40 \n Central Java  | Salatiga        | 156 \n Central Java  | Surakarta       | 154 \n Central Java  | Magelang        | 93 \n Central Java  | Pekalongan      | 79 \n Central Java  | Semarang        | 68 \n East Java     | Madiun          | 180 \n East Java     | Malang          | 177 \n East Java     | Batu            | 148 \n East Java     | Kediri          | 89 \n East Java     | Blitar          | 73 \n North Sumatra | Medan           | 187 \n North Sumatra | Padangsidimpuan | 143 \n North Sumatra | Gunungsitoli    | 77 \n North Sumatra | Tanjung Balai   | 74 \n North Sumatra | Pematangsiantar | 52 \n West Java     | Depok           | 193 \n West Java     | Cirebon         | 144 \n West Java     | Cimahi          | 136 \n West Java     | Bogor           | 99 \n West Java     | Bekasi          | 86 \n West Java     | Bandung         | 75 \n West Sumatra  | Bukit Tinggi    | 190 \n West Sumatra  | Pariaman        | 123 \n West Sumatra  | Padang          | 68 \n West Sumatra  | Solok           | 64 \n West Sumatra  | Payakumbuh      | 59","463":"*mysql","464":"yes, sir!","465":"...","466":"Please share Sql mock interview question","467":"Thank you for suggestion","468":"\/stat","469":"I don’t know, but what I know — you can edit a dump file and fix incorrect usernames there","470":"It's on the site","471":"Can anyone please help with good technical course material for mysql","472":"Hii","473":"You can use join instead of in","474":"This data successfully got stored in mongoDB. But showing empty in mongoDB.\nHow do I resolve this","475":"Does anyone know how to get multiple data from My Sql with multiple queries at time in Node-Red","476":"I am learning from YouTube, I don't have data to generate to practice sql\n\nhelp me out by doing the needful\nPlease share Data and questions to practice","477":"you didn't define the field 'pwd'","478":"","479":"Try 3wschools","480":"Yes please go ahead","481":"create database \"NewDatabse\" \n?","482":"This is my query","483":"You shouldn't do it","484":"","485":"Ok \nThank you.","486":"It is mssql syntax","487":"Can't change the engine as per project agreement. I checked and compared variables . They are same ..","488":"Can you tell something??","489":"Ya i think now i m uninstall mysql and remove the hidden folder of sql","490":"How can I find monthly growth and weekly growth","491":"How mysql is allowing you to execute without mentioning i.pro_name in group by clause ?","492":"I actually want to migrate the table to a different server\/machine altogether decoupling from the current schema","493":"Can anyone help on this...?","494":"No","495":"Write a query whose student name 4 place contains y and starting N character","496":"Total messages: 22453","497":"How to Take backup using mysqlpump and Restore backup MySQL DBA Tutorial | MySQL 8 DBA Training\nhttps:\/\/www.youtube.com\/watch?v=kysXdZNFNkQ&ab_channel=MugheesAhmed\n\nCompressed backups\nParallel processing\nExclude\/include database objects\nBackup users\nRestore mysqlpump\/mysqldump backup","498":"maybe i am wrong regard the type of lock. we did alter to an existing table to add a column.","499":"Please share for subqueries topic","500":"Is it because MariaDB is PCRE compliant?","501":"Hi @everyone\nI m looking for a MySQL database administrator opportunity near London with sponsorship visa. I have 7+years of experience in IT industry. I do have AWS CLOUD experience also. I am attaching my CV.","502":"doesn't your output give salary=10 for dept=1?","503":"One help please🥺","504":"wat","505":"so what exaclty is the problem you're facing?","506":"In the docs, in the sources.","507":"What device are you referring to?","508":"thanks","509":"[Patience Emma](tg:\/\/user?id=6141851360) has been banned! Reason: [CAS ban](https:\/\/cas.chat\/query?u=6141851360).","510":"","511":"hey, i want to knw that there is sqlite db total db size 120mb but in which there is a table called translation having size of 80mb approx so i can store 40-60mb in assets in flutter so what the things i can do for this table? i","512":"Can you show 3-3 dummy records in a table format for both votes and candidates tables.\n\nIt will help us to understand your expected end result.","513":"It makes no sense","514":"Hi Everyone\n\nAs we are using Google Cloud MySQL, now would like to add an user who can not do deletion, truncate and script altering only do crud operations only please help","515":"Hi everyone\nWho can advise please\nHow can i save extracted data after run a query in sql server manager, i want to save it txt or csv\nThank U","516":"Thank you","517":"1.Referral report\n2.Discount wise report\n3.Year end report","518":"So in TO_DAYS() , I have given exact date of the start of the week.","519":"Yes that's the reason may be","520":"hii","521":"Send query as a text, please.","522":"We have reinstalled the client and this solved the issue. Thank you for your inputs","523":"That is what making it difficult for me","524":"I need answer for this question","525":"Please send the topic that is relevant for a job purpose","526":"Hi I am trying to delete records by using procedure but it takes more time to delete. Can anyone help me on these.","527":"So, in a DB you will store path to video and its TAGS and other attributes, NOT the video itself.\nThen ANY DBMS will be able to handle this data","528":"Function is used inside the where clause. Hence this is slow. The query has to first cast all of the values in the entrydate column to date and then do the comparison.","529":"2022-12-04 00:00:00 - MySQL accepts date time in this format only","530":"i have MySQl 5.7\nSo, you mean i must write in command line: net start MySQL 5.7\nOr smth other?","531":"Someone help me find the solution","532":"We don't have common column in both tables but say for example,\nWe have two tables called contact, order\nNow I need to update contact table ( which has empty column called lead id) with different column in orders table \nEnsure we don't have any common column for both tables?\nAny idea on how we can populate data ?","533":"In mysql, I have one date column and want to show the week number as well as the start and end of that week based on the date column.","534":"You want to pass comma separated string to IN operator","535":"SELECT *\nFROM your_table\nORDER BY\n    CASE\n        WHEN status = 'pending' AND DATE(date_column) = CURDATE() AND TIME(time_column) < CURTIME() THEN 0\n        WHEN status IN ('pending', 'started') THEN TIMESTAMPDIFF(SECOND, CONCAT(date_column, ' ', time_column), NOW())\n        ELSE NULL\n    END,\n    date_column,\n    time_column;","536":"Upgrade from 5.7 to 8.0 What is the maintenance window(down time to end users) we need to apply?","537":"Yes, why ?","538":"How to make it if columns have the same names?","539":"Getting error in unique index can anyone help me in this?","540":"2.2\n\n<%@ taglib prefix=\"c\" uri=\"http:\/\/java.sun.com\/jsp\/jstl\/core\" %>\n<!DOCTYPE html>\n<html>\n<head>\n<\/head>\n<body>\n  <table>\n    <tr>\n      <th>Id<\/th>\n      <th>Name<\/th>\n      <th>Info<\/th>\n    <\/tr>\n    <c:forEach items=\"${tableData}\" var=\"row\">\n      <tr>\n        <td>${row.id}<\/td>\n        <td>${row.name}<\/td>\n        <td>${row.info}<\/td>\n      <\/tr>\n    <\/c:forEach>\n  <\/table>\n<\/body>\n<\/html>","541":"Yes","542":"I am new to SQL.","543":"Yep","544":"Workbench is running on same machine as mysql sever?","545":"I need MySQL database","546":"","547":"Yes I do have.","548":"Why did you decide that mysql uses swap?","549":"Hi good morning all work available for starters. needs knowledge of MySql, Power BI and excel 20,000\/- month. You will work mostly 2-3 hours in a day good for recent graduates.","550":"Rooms\nComputers\nEquipment\nDevices","551":"No, you should do \"installing mySQL on windows\"","552":"Ok thanks my friend ☺️👍","553":"Anyone know opencart about db ?","554":"Please subscribe","555":"ok","556":"Anybody plz help","557":"the port?","558":"","559":"Insert syntax is same for all clients","560":"Thanks a lot","561":"Also","562":"Is there any way?","563":"can anyone join me in this \ni have the datasets\n\nPlease please","564":"İf we want to import with tsv file, it is okey","565":"Hi friends \nCan anyone suggest me some site where I can practise SQL some real time data","566":"MySQL DBA and Development jobs\nAWS RDS is there to enhance..\nBut you just can't stick to MySQL and grow. Need to keep learning and work on other technologies too","567":"So basically you already have data in other columns rights then you need to use UPDATE, insert will not work there","568":"Hii i have a problem in my db actually i have pulled data from data base into dropdown list from one table and i want to display the selected value into data base","569":"What is the meaning of block nested loop","570":"need a coidng buddy mysql and django","571":"Can you not just use 3 sub queries somehow","572":"Glad to know, thanks for share your career based information","573":"👍","574":"Update all rows with ids greater than 4. And then insert a row on a free spot. However, I do not really think that you need to do it since it just doesn't make any sense at all.","575":"Hi Hitesh would u check the value of the same by show create table tablename","576":"Hi everyone, my database(Mysql) is upgrading from version 5.6 to version 5.7. I want to be sure that the indexes that were in the old version (767 bytes) will work properly with the new one (3072 bytes). Do I need to restore or create new indexes after moving?","577":"Can anyone help on above","578":"Hi I need a help...","579":"Over a period you can't calculate growth as you don't have data needed, you have only 10year difference. \n\nJust substruct two years and you'll have population growth. \n\nSelect \n  Einwohner_1990 - Einwohner_1980 as pop_growth_last10y","580":"What is long-query-time?","581":"Query based questions","582":"Any my sql trainer and proxy(lady)","583":"am getting wait_event \"wait\/synch\/sxlock\/innodb\/btr_search_latch\" in logs & query result, but don't know what does that mean. So looking for some help.","584":"Hi guys, I need help with this. I don't know why such a error is happening","585":"Open the logs and check what is the issu","586":"Mysql servers with innodb engine can handle upto 64tb that is what is documented but be sure you have to have a solid infrastructure and efficiently set all the parameters. \nPostgreSQL is also good but same as mysql you have to tune the parameters.\nFor big data better go with nosql databases preferable cassandra.","587":"https:\/\/sqlize.online\/sql\/mssql2017\/4e3e1669253a840a8c5007818b9ddd60\/","588":"Okay","589":"I have one table in which daily 3millions record inserted on daily basis and I only keep one day data real-time data in it but when I fired select query on it it is taking around 30 minutes in execution created composite key on all columns which I am using in where clause. any one can help me how to improve efficiency of that query","590":"Done. Tq","591":"Im getting both names same here,,,whats wrong","592":"do you use push or pull model? The error clearly states that you have problem with connectivity.","593":"but not much from free ones. lol","594":"There should not be comma after the table name","595":"check out https:\/\/rubygems.org\/ for that package","596":"Explain your question","597":"What is Enterprise RDBMS?","598":"More hard to understand that's mySQL's home suite, dev.MySQL.com","599":"ok then can use this syntax but if u have to show them particular column u can use views","600":"Thank you Ilia","601":"https:\/\/dba.stackexchange.com\/questions\/298085\/large-number-of-row-locks-on-a-partitioned-slave-table","602":"Can someone assist with two querys?","603":"Is my approach and ans  correct for above question???","604":"for example:-wait\/io\/table\/sql\/handler\nthere is a wait on IO, but WHY that wait is.","605":"[Cpt. Jack Sparrow](tg:\/\/user?id=379248712) , @Michealcrichton  , if you want to do offtopic, go communicate privately","606":"consider to try tungsten replicator or any other tool which can apply binary logs  to the remote database","607":"There is genreid and music name in one table","608":"Both","609":"For practice","610":"Enable slow query logs and monitor it, optimize all slow queries captured one by one..","611":". Zip  gold it is binary package for manual installation","612":"R u using Timestamp type in java model class while retrieving from db","613":"by doing it I see the foreign key navigates to the new table's name but does it really work or I need to analyze table \/ drop FK and recreate?","614":"Same-day means, current date\/day ?","615":"can you explain  this statement","616":"Sour dreams..","617":"https:\/\/docs.digitalocean.com\/products\/databases\/mysql\/how-to\/import-databases\/","618":"How is the index on those where clause columns?","619":"DQL","620":"Percona tools has something for batch updates if you want but it is not a big deal to write something simple on your own. Honestly saying, 10m rows is almost nothing","621":"The above message you sent shows something related to apparmor. Can you disable it for a moment and then try connect?","622":"didn't work for me :\/","623":"Hello, I have feq questions, can someone please help.\nSetup- Mariadb , 2 masters in replication - 1 master : read write\n2 master : read only\nThere are 6 slave servers in replica  pointing to master 1.\nIssue- Master 1 memory utilisation 93%. May crash , reduced buffer pool size but no use. Online resize works. \nApproach - Make master 2 as master , read write, point slaves to master 2, application connection will goto master 2\nQuestions- \n1. how to make master2 as master and point 6 slave to master 2\n2. How to make master 2 read write \n2. After reboot of master1 will binary log sequence start from 0, or from previous log  sequence.\n\nThanks.","624":"I wouldn't assume there would be any problems","625":"Someone give me source code of php and html for practicing","626":"You can do this , but manually. And this is quite hard to implement.\nAnd, if some connection locks something, and you kill it , it then will be lolling the transaction back for some time, and this also can require some new locks","627":"I am here","628":"anyway, study JSON functions and write an expression returning the needed value.\n\nthis is the docs\n\nhttps:\/\/dev.mysql.com\/doc\/refman\/8.0\/en\/json-search-functions.html#function_json-extract","629":"More hands on cluster ., How to rebuild cluster and bootstrap MySQL router .,","630":"BACKUP DATABASE databasename\nTO DISK = 'D:\\backups\\testDB.bak';","631":"Absence of indices. Add them all and even add special indices for supporting replication procedures.","632":"Can amyone tell me what to do next","633":"any one online here?","634":"Hi All, \nHas anyone tried installing MySQL workbench of Amazon Linux 2?","635":"Friends, does anyone know how to extract this \"2\" from this column that stores JSON? try the following query but it returns null\nselect\nJSON_EXTRACT(`quantity`, '$.\\\"{$.2}\\\"') AS product\nFROM lebronsu_admin.product\nwhere product_id = 31;","636":"Thanku bro","637":"This is good choice","638":"Check mysql error log. There will be some hints","639":"When installing MySql  i get an error on Writing Configuration file. Error log is: Invalid server template. How to resolve this problem?","640":"I do not see your question, please ask here","641":"Any Mac user help please","642":"Whenever im trying to import csv file into mysql this error is there,","643":"What?","644":"Php to database connection..?","645":"","646":"السلام عليكم","647":"Since i don't know anything about it, I'm having a hard time choosing one","648":"In my case I only need the last ID - from the last Insert","649":"I have to populate\/delete the entire record rows","650":"And what is the problem?","651":"Never used it","652":"Thank you","653":"","654":"You could have googled it\nhttps:\/\/dev.mysql.com\/doc\/refman\/8.0\/en\/resetting-permissions.html","655":"why is it？","656":"Yes I don't flood here","657":"TTry i\n\n\nSELECT \n    CONCAT(\"[\",\n         GROUP_CONCAT(\n              CONCAT(\"{address_id:'\",address_id,\"'\"),\n              CONCAT(\"address:'\",address,\"'\"),\n              CONCAT(\",address2:'\",address2,\"'}\")\n         )\n    ,\"]\") \nAS json FROM location;","658":"Can anyone help me out","659":"Yes, I used before 5 years ago and since few days I am doing practice on my virtual machine","660":"Post graphs here","661":"Never need need it since that time","662":"Hi guys","663":"Its more like python thing rather than mysql, just send multiple queries at once","664":"","665":"Optimise query","666":"Yes","667":"so what do you mean  if you know how to use it correct","668":"Smoke indexes","669":"I wont interupt current import in 12 hours it got to 25% according to pv, but for future i wanted to study what i can do","670":"seems the data already exists in database and it cannot be create again or something ?","671":"This is networking problems","672":"????","673":"I downloaded file \"ocelot\" and I had to import this file in my disk","674":"","675":"I given the path","676":"thats the view definition. there;s a user definer","677":"Stored procedure languages are all different in different DBMS, so it is strange that you even have dared to start this","678":"Can you describe what are some of the other ways...","679":"https:\/\/www.udemy.com\/course\/mysql-replication-course-from-zero-to-hero\/?referralCode=CCB66389E8DB003328C6\n\n#mysql #replication #course #tutorial","680":"So in the table you'll have foreign key...for artist thats is exactly the same value as primary key in artists table","681":"Id also should be inside \" \".","682":"Your mistake is that you think the link, or pointer, to the data element is smaller then the data element itself.\n\nThis is not true.\n\nAs DBMS store really big amount of data, this link, a hypothetical pointer to data element (field or field value) should be really big in size, at least it should be as big as the so called RID (row id in the database) which is really used inside many databases, but should be even bigger, because this is a pointer to the field, an element of a row.\nAs RID s are usually a C long long (64 bit) value, this field is should be something like 64bit plus, say, one or two bytes more.\n\nIf you consider a FK field which is a reference to a PK field, it usually int or big int field or even shorter.","683":"?","684":"It is CLIENT IP address, not the address of the server (or any node)","685":"try to save in another driver after restarting ur lap","686":"ARTER?","687":"__so whats you solution to brows through a large nummer of data e.g. in a web app?__\n\nWas this a reply?","688":"","689":"Data in MySQL tables is not sorted by default. Where from are you going to get order of rows for sequences definition?\n\nAlso you have the big mistake with normalization.","690":"I need job","691":"We will get top 10 rows","692":"By text, we type in the value, which is the same as the PK in column A\n\nBut I want the database to be able to keep just a reference to the necessary row in A's PK, from say multiple rows in B of the FK","693":"Do you think we know what you do? Is you have error, then show us the code you run and error you have. Do it with text message (not screenshot)","694":"Any opinion","695":"Tables could not be fetched","696":"How we know that the table has been created ??","697":"its an emergency anyone from team pls help","698":"Gui tool","699":"Yes go ahead","700":"Me*","701":"I'm halfway there but not sure how go forward","702":"Share table structure and size of same..","703":"Jus try yourself","704":"Try increasing phone column length","705":"?","706":"how can I check if the buffer cache really working? we have mysql 5.7","707":"Which data do you want to store?","708":"Mahesh:\nAny one can u please suggest me how to backup and restore large sized database of mysql which takes less time\n\nMy file size is 109gb after taking backup of mysql database","709":"AFAIR no, this will only determine if it is going to be one partition operation or all partitions.","710":"","711":"select ...","712":"otherwise my code output is throwing this error","713":"","714":"","715":"Кирилл, try watching ...","716":"Temp password must be generated and stored there","717":"this will give the cache rate","718":"","719":"Maybe you can store attachment on disk and their path or link in db","720":"5k users can access it smoothly?","721":"Replication Vs galera. Choose wisely based on your requirements since these approaches are different","722":"Ah, that was not a question... Sorry","723":"i dont understand then 🙁 can you explain little bit more","724":"Resources matter, so idk how many connections will open in the pool","725":"Wait for a sec Denis","726":"Yes","727":"I wonder how much these spammers get paid","728":"Then how to data restore","729":"Our classes just started but i had some problem w root password","730":"Yes , lock is in slave and on a partitioned table","731":"already solved, I put cloudflare and now the whole site is loaded into cache","732":"Actually, I have to submit Human Resources Management System assignment using mysql yesterday itself 😅","733":"Explain how or the messages will be deleted","734":"hello","735":"Best YouTube channel for MySQL please tell me","736":"Windows","737":"Pls send  the answer","738":"Hi everybody","739":"maybe if group by `dept` but it doent work in my configuration\n(this is incompatible with sql_mode=only_full_group_by)","740":"Which generated by restore process ?","741":"In all","742":"Update IvaFacturaVenta a \ninner join Factuta  b on \na.IDFactura = b.IDFactura\nset idgeneracion = new.idgeneracion","743":"Percona tool kit have many functionalities which one u need?","744":"I know!","745":"I am trying so hard, can somebody tell me how to group by count the output","746":"let me repeat myself once again. it is not a big data at all. i do not suggest you to use specific solution. I just answered your questions","747":"Actually your mysql server should be configured properly to run this statement.","748":"then why it shows syntax error ?","749":"Friends, does anyone know if it is normal to have so many mysqld processes in the list? I use htop tool","750":"Actually MSSQL development","751":"Select pro_name as product_name, max(price) as price, com_name as company\nfrom item_mast  a\njoin company_mast b on a.pro_com = b.com_id\ngroup by pro_name,com_name","752":"Read logs about that error","753":"Vikas Savita:\nI have two vacancy for MIS , SQL developer in gurgaon location .\n\nplease ping me resume if interested in the same\n\nwork from home\n\ncandidate have good knowledge in excel, Google sheet, google data studio , sql, power BI","754":"Pl","755":"Upto 80k connects and disconnects per second","756":"I can see it that way.","757":"Bro","758":"I am unable to install SSMS","759":"Please solve this challenge","760":"I can make questions about MariaDB?","761":"Data volume??","762":"Dev.mysql.com","763":"No , it soul be MSI packet or .exe","764":"Hello, guys, anyone has a MySQL InnoDB cluster setup document please share it with me.","765":"You can share DDL of your tables","766":"Can anyone help me this problem","767":"Because I have a \"database exam\" and I was resolving some old exams, and I used count(distinct ()) but my professor has never explained it","768":"You must of done some ini file changes and restarted the machine. The ini file save format was not right so service is in this state ...you may see backup file created in the location ...change the name back to my.ini and start the service.","769":"other wise use this query\n\nmysqldump -u [username] -p [database_name] [table_name] > [output_file.sql]","770":"I need support in mysql database","771":"","772":"this can't be. Both FK and PK fields must have same datatype","773":"Hello. The official documentation has information about breaking changes so you can find the info there.","774":"$query=(\"SELECT * FROM kl_overzicht, kl_spelers WHERE kl_overzicht.spelerID = kl_spelers.spelerID ORDER BY totscore DESC, aantmatchen ASC, aantgew DESC, aantverl DESC\");","775":"What should this \"6 thousand data\" mean ?\n\nMeasure what takes time most, the reading data from the DB or formatting it into HTML\nor maybe some other step. Then improve the slowest step.","776":"create table Person ( \nid int not null unique,\nname varchar(50) not null,\nage int not null check(age>=18),\ngender varchar(2) not null,\nphone varchar(15) not null unique,\ncity varchar(25) not null default \"Agra\"\n);","777":"Hello everyone, I am building attendant system, and I have two tables (students- attend) \nSo, all the students will be registered in student table let’s say we only have five students as shown in photo. \nWhen the student signed in, he\/she will be inserted to attend table as showed in the photo and the word present will be written under attend table head. \nBut I want when I click a button after the class finish to insert the rest of the student that didn’t sign in in this case (Sara and Zain) to attend table with the word absent. How I can do that.\n\nThank you","778":"Mujhe MySQL pr job chahiye","779":"User indexes","780":"Sure, I can\n\nThe future of this field is stable and good","781":"Can you please give me answer","782":"This query is correct in ms sql server","783":"https:\/\/dev.mysql.com\/doc\/refman\/5.7\/en\/server-logs.html","784":"Yes","785":"Sorry, i mean this \n\nhttps:\/\/www.digitalocean.com\/products\/managed-databases-mysql\/\n\nIs better droplet o database cluster? 😅","786":"I am trying to load test data with less than 20 rows","787":"Urgent requirement!!!\nSkills : MySQL database administrator\nExp : 1+,2+,3+ \nPing me if interested","788":"how to fix these and how these error is coming?","789":"xf?*","790":"","791":"Check the error log...","792":"Hi gud evening can any one share SQL full notes","793":"I use a connection pool, could that be the cause?","794":"👍","795":"Yes","796":"use any kind of testing tool. They can usually populate some data as well. Look at sysbench, tpcc or anything similar","797":"","798":"Thanks man","799":"Hi All,\n\nAny one have MySQL patching and import & Export documents with command","800":"Select gender,count(gender) from table group by gender;","801":"Getting this error while connecting to MsSQL server through MySQL workbench","802":"Hi team. Is there any good course for Database . Can anyone please provide inputs . What all to learn can anyone please help . Thanks in advance","803":"Hi need one help i am taking MySQL Meb backup in compressed form the size is around 400GB shall I compressed it more and how can we do it","804":"but you didn't mention any issue.","805":"This is not an indicator of any problem.\nUse standard MySQL utilities to check this","806":"Help please, this is 3rd crash","807":"Update IDGeneracion (FIELD) only in 1 row","808":"Show engine innodb status","809":"Hi guys can anyone pls help \n\nI have table with status field of enum type-but need to now sort according to condition,then have date , time fields.\n\nI need to sort 1)if status pending, and date today, but time less than current time-means old pending, then show those records first \n2)Then if status pending or started , but not old pending then sort by closest to current date and time","810":"{message: \"Fail!\", employees: [], error: \"Data too long for column 'profileImage' at row 1\"} \nemployees: [] \nerror: \"Data too long for column 'profileImage' at row 1\" \nmessage: \"Fail!\"","811":"the best choice - store in database only path to files, and store files in other one storage","812":"Whom ability?","813":"Hi guys\nI've a column 'number' it should be 10digits else it's invalid can anybody help with query to validate that coulmn in sql","814":"@Xedoxzarea please note, that entities and classes are two names for one same thing","815":"it is not true.  i'd suggest do not kill them","816":"Hi ..\n\nNeed help..\n\nMy laptop crash and I cannot access\nto DB.\n\nBut I manage to copy ibdata1 and\nraw file in (.ibd and .frm).\n\nCan you help how to get data from\nthat file ?","817":"[Liran](tg:\/\/user?id=1068878214) simple telnet to machine running to MySQL ip and port number will conclude if you have connectivity or not","818":"Sql jointes","819":"","820":"","821":"Hello,, how can I get MySQL into my laptop, got an assignment","822":"RULEZZZ!","823":"Check execution plan for all of slow queries","824":"Google never gave me the fake","825":"Hello people,\nI am trying to learn MySQL on my own. I got stuck about something, it is clear that I miss one easy\/obvious thing.\nhttps:\/\/www.mysqltutorial.org\/mysql-subquery\/\nHere is the original example that I try to complicate in order to improve my learning process. \n\nIn this example, it can print full name with offices codes, that's fine but, I want to import names from offices table to print with it.\nHere is code that work for fullname, and code for the next step I tried and does not work.\n\nSorry for my lacking English, I do not want to make any of you guys blind 😂","826":"👍👍","827":"I am new to mysql how to use it","828":"In general, yes","829":"Anyone can help","830":"I got another little issue... I was trying to restore foreign  key but once I was adding back with ALTER TABLE , it says it already exists but it doesn't looking with phpMyAdmin at table structure... querying REFERENTIAL_CONSTRAINTS table filtering CONSTRAINT_NAME with that foreign key it returns a row.... shall I have to delete that record from REFERENTIAL_CONSTRAINTS before to restore the foreign key back?","831":"Mysql","832":"Guys please suggest me only watching MySQL from YouTube is enough or  i have to do something more","833":"is it not 7 matched and one unmatched?","834":"👍","835":"So do something","836":"class \"org.eclipse.core.runtime.IStatus\"'s signer information does not match signer information of other classes in the same package","837":"For those who not follow my humor, that was a joke","838":"And what do you know now?","839":"?","840":"Ya select query with where condition and in operator","841":"Thank you","842":"Look into the logs, what else is there","843":"Hello to all new members","844":"ERROR 1215 (HY000): Cannot add foreign key constraint","845":"Well, it seems like you try using the DB like an Excel table,\nthis will not do.\nNormalize, re-desing.\n\nThese\nparameters='...20kb char string...'\nscan_logs=''...20kb char string...'\nare just not the way relational DBs should be used.","846":"Hi folks, today when I am trying to import csv file through wizard, everytime  I am getting Error Code: 2013. Lost connection to MySQL server during query. How to deal with this?","847":"","848":"this can be for example a deadlock","849":"Insert into new table \nSelect table with join\nOr union all based on data and structure","850":"There is something called as on duplicates","851":"Thanks buddy","852":"Yes. I sad that the solution depends on the reason you need to show it","853":"It's called community support. Is he real or fake ?","854":"Team, can some one please help me out. We are facing \"Unknown initial characterset 255 received from server. Initial client character set can be forced via the characterEncoding property.","855":"Hello guys!\nI need your advise\nThere is a tool (web-portal) and this tool is used by 3 distributed teams in different locations (continents)\nAnd the management wants to have own stage in each locations for availability purposes\nAnd the question is how to replicate the data between 3 stages","856":"","857":"Hello everyone, I'm a beginner for MySQL I want to learn can u help me how can I start ....","858":"OK, then re-try creating this table, it must create","859":"Share your tables","860":"I am not clear how to run query for this","861":"","862":"SELECT \n    A.derulevalue, B.applicationid,  A.sessionid\nFROM\n    Dev.brms_rules_result A\n  inner join \n    Dev.brms_gds_request B ON B.applicationid = A.applicationid\n        AND B.sessionid = A.sessionid","863":"When you insert or change the data foreign keys check that rows in different tables stay in correspondence with each other.","864":"Ohh okk cool..we can use and avoid that columns","865":"https:\/\/sqlzoo.net\/wiki\/SQL_Tutorial","866":"Firstly, check syntax of your SQL query","867":"how to resolve it?","868":"","869":"Hi All, How to get timestamp into two columns date & time, please","870":"i didn't get from here, please just give syntax please","871":"????","872":"hi ....i want to learn MySQL dba...can anybody please help where should i start with?","873":"Who inserts and deletes the records ?","874":"Hii Guys Anyone Help me\nHow  can i get  Reverse Counter Latest Update value While Grouping","875":"Firstly u will have to uninstall the old version I think🤔","876":"I face same problem month ago\nBut I didn't know how","877":"But of you run .sh script it is run in the same environment as usual bash commands, that is the problem","878":"Use prototyping","879":"","880":"So anyone has solution to this?","881":"even if they don't have the same number of nodes, and network connection between the centres fail","882":"Total messages: 27272","883":"https:\/\/platform.stratascratch.com\/coding\/10012-advertising-channel-effectiveness","884":"maybe 3 or 4 minutes","885":"did i do this one right ??","886":"Hi","887":"You have the same columns in both tables. It is another one NF problem","888":"it's just a plain text file, nothing complex","889":"Error","890":"ok\nill see what i can do\nty","891":"Check whether MySQL port 3306 blocked by  firewalld service","892":"Don't send photos","893":"Hi..\nAny one have interview questions and answers for MySQL ?","894":"Man, you should optimize your code at first. It is not MySQL causing that, but the shitcode was written for your app","895":"This is not a ideal query. 😁","896":"Without load data how we cam import file using stored procedure","897":"Thanks Ilia.","898":"Hello guys can someone suggest for a database of size 1TB with max_connections set to 1500 and average connections per day being 500 what should be the ideal innodb_buffer_pool_size. Currently the pool size is 4gb and the Linux server ram is 8gb. It is a community server. And we are facing lock issues and slowness issues daily","899":"Hello All, I need help on how to use SSIS to load data onto table in mysql DB (maria DB)","900":"Alright. Thank you","901":"Official group name please??","902":"Both soure & destination servers running on windows","903":"an Example I mean","904":"Have a nice day","905":"","906":"all fields in the select list must be either under any aggregate function or mentioned in the GROUP BY clause","907":"please refer the article step by step      https:\/\/www.digitalocean.com\/community\/tutorials\/how-to-allow-remote-access-to-mysql","908":"What are you looking for ??","909":"if you want it for display purpose then create a view and inside view use concat","910":"Error in what sense? The command is working fine it's just that the output is not being logged to the specified log file. \nSomething with redirecting the output it seesms","911":"Wait bro","912":"Anyone have idea?","913":"After adding order by cargo-date, time, status , pagination is not working. Before , it was working","914":"anyone can help me on sql??","915":"Add \"auth_plugin\":\"caching_sha2_password\"","916":"K bro she","917":"MySQL license renew","918":"but bash script isnt","919":"You can increase it, but this will not help anything","920":"does DROP COLUMN can cause a lock? the column was created but isn’t in use in any way","921":"Thanks man, for recommending","922":"There is only one practice if you have two tables which you have described","923":"Thanks","924":"How much people are residents in city Venezia","925":"You must install MySQL client on that host, and then you will be able to connect","926":"You need Linux","927":"yes it is possible","928":"Hello can anyone help me ti resolve the SQL injection problem","929":"what they ask you?","930":"yes, same error","931":"i am asking specific resources like sqlbolt.com is good for basics","932":"it doesn't work because no database used befor.","933":"Is it possible to use mysqldump import in parallel mode ?","934":"Thank you","935":"Do you want me to read them till you rest before your deadline?","936":"I passed the test case by running two queries to get the shorted city name and then the longest city name.","937":"Where do you study?","938":"Can any one tell me why the query is interuppted?","939":"Mysqldump is slow","940":"Who can help me about python?","941":"1\nSelect * from messages\nwhere conversarion_id in (\nselect X.id from\n(\nSelect cast(datetime as date), id, row_number() over (partition by cast(datetime as date),id order by datetime) as rn\nfrom conversations c\n) X\nwhere X.rn = 1\n)","942":"Mysql experts\nWhats your views on storing attachments in blob format in db for an application that is expected to scale very fast?\nPls share your thoughts and suggestions","943":"You can try multimaster but if your application is not a heavy writter maybe you should go for Master and múltiple slaves","944":"Thanks alot","945":"So it means i should cancel this program before ?","946":"Select salary from table_name group by Salary having salary = max(salary);\n\nps: Select salary from table_name group by dept having salary = max(salary);","947":"Hey, I have just started learning SQL, can anyone guide me from where I can get already existing database to add to mySQL workbench ?","948":"Yes you can update direct table level","949":"innodb_flush_method","950":"cd \/tmp\n`find . -type f -exec ls -s {} + | sort -n -r`","951":"But the column don't have index","952":"Thanks santa","953":"Okay thanks","954":"How to share picture here","955":"This doesn't break replication at all, just set on the both hosts.","956":"It's happening again and again","957":"This file is not opening","958":"Is there any additional license required","959":"What’s the best way to export a 161GB dump file from AWS S3 to GCP Cloud storage (bucket)?","960":"is this correct to use in sql \ncast( column_name as indicator(1)) for one column?","961":"Hi All\nWrite a stored procedure using tables like sales order,inventory on hand,inventory purchase,Bom using these table write retrieves the total sales amount and the available quantity of a product in inventory\n\nPlease write stored procedure any one 🙏\nIn sql server","962":"Minimum 3","963":"Any one know anything about this \n@last_entry in mysql","964":"Hi, My whole site is working but \/blog page is giving this error only. \n\nI checked the error log, showing this error: \nPHP Fatal error: Allowed memory size of 134217728 bytes exhausted (tried to allocate 98582528 bytes) \n\nHow can I sort this?","965":"Hello, everyone . does anyone know about tecdoc ?","966":"Use google translate","967":"Yes, you're right","968":"i need a job on mikal","969":"Tried this too\ngzip -> this one is mentioned in percona xtrabackup documentation only","970":"No worries , i got it resolved.Thanks","971":"plz can u help me with this?","972":"Please use below wesites to practice sql \nDatalemue.com\n8dayssqlchallange.com","973":"homework","974":"Buenas noches grupo, alguien tendrá información del tema \"Replicación de base de datos en #MySQL \" por favor. No sé por qué me sale ese error","975":"I assumed no such scenario but the original query he gave","976":"Example: calvin klein is supported only from mexico","977":"URGENT HELP..I am trying to restore a dB running in a docker container..","978":"Why am I showing error","979":"Y","980":"What other client would you recommend? Gui based","981":"In Replication binlog are key files","982":"Petka cames to Vasiliy Ivanych and asks:\n- Vasilivanych what is nuance?\nVasiliy Ivanych says:\n- Take off your pants, Petka!\nPetka takes off pants...\nVasilivanych takes his dick and pushes it in to a Petya's ass...\n- Now listen here, Petka: you have a dick in the ass ..... and me have a dick in the ass. But there is one nuance!","983":"Mysql is free source but  mssql is not","984":"I didn't get you. Query time? And file what?","985":"Json_keys(JSON_EXTRACT(quantity, '$.\\\"{$.2}\\\"'))","986":"I use this query ,it doesn't work","987":"Shows popup msg that it suport 5 versions only","988":"it doesn't work","989":"Stop to be noob","990":"Thanks for response","991":"What can be possible reason, cant execute simple select query as well","992":"limit 10 desc will give syntax erroe","993":"Deploying two instances is better for performance, because mysql and innodb has some exclusive resources for example mutex,  rwlock, spin lock. However deploying one instance is convience for managing, for example replication, backup and migration","994":"Thanks 🙏","995":"(a)\nThere exists a table CUSTOM containing the columns Customer number\n(NO, integer), Customer Name(CNAME, character). Balance due(BALA, numeric) and date of transaction(DT, date)\nWrite MySQL statements to\nDisplay the customer number, minimum balance due and total of balances due grouped by customer number.\n(ii)\nDisplay the customer number, maximum balance due and number of balances due grouped by customer number.\n(ill) Display all the rows where the balance due is less than average\nbalance due.\n(iv)\nDisplay all the rows where the name ends with 'A'.\nDisplay the customer number, balance due and date of transaction for date of transaction before July 25, 2013.\n(b)\nThere exists a table LIBRARY having the columns Book Number (BKNO, integer), Name of the book (BKNAME, character), Type of book (TYPE, character) Number of copics(NOC, integer), value of the book (VALU, numeric) and Date of Publication (DP, date). Write MySQL queries for the following\n(i)\nDisplay all the rows from this table where the value of the book is below the average book value.\n(ii)\nDisplay the columns Book number, Name of the book and Date of Publication from this table where the value of the book is equal to the highest book value.\n(ill) Display Type of book and average value of the books from\nthis table grouped as per type.\n(iv)\nDisplay the Book Number, Value of the book and *scrap value' which is 5% of the value of the book from this table.\n(v)\nDisplay all the rows where the value of the book is above 1000.","996":"every interaction uses the web panel api","997":"Did you considered 1)using load data instead of insert statement. It is way faster; 2) change engine to rocksdb if possible 3) partition table and load data based on partitions?","998":"queries of what ?","999":"Do anyone over here know about auditing MySQL\/MariaDB? Or any plungin like mariadbaudit plugin?"}}