{"text":{"0":"ну в c++ \"нативно\" нет gc","1":"начнем с форума D","2":".","3":"ну не особо нравится","4":"ВАХВАХВАХВАХХВХА","5":"","6":"Не, тут зелье силы надо","7":"Ты чо","8":"https:\/\/ru.wikipedia.org\/wiki\/Unity_(%D0%B8%D0%B3%D1%80%D0%BE%D0%B2%D0%BE%D0%B9_%D0%B4%D0%B2%D0%B8%D0%B6%D0%BE%D0%BA)","9":"Какое-то больше, какое-то меньше","10":"звучит как \"проблема в ниме - проблема в ниме\" :D","11":"да","12":"ну да","13":"но 24 часа.., конфигурировать нельзя?","14":"Ну так все равно слишком много вариантов","15":"социализм","16":"Есть идея бота сделать, который код будет в WASI компилировать и запускать. Никаких контейнеров не нужно, потому что wasi по умолчанию зарестрикчен","17":"🔒 Прошептанное сообщение whisperbot, Только он\/она может открыть его.","18":"Я не про саму ось - как бе","19":"В параметрах","20":"ну ручная распаковка и именование это просто отсутствие некоторого количества синтаксического сахара,","21":"Это не то!\nВ оригинале, по-китайски, очень красиво написано!\nПравда, ничего непонятно. 😊\nПришлось читать перевод с английского перевода.","22":"","23":"и получаешь nil в ебало","24":"блять","25":"хочу питон, но как lua.\nПростой для встраивания. Но это пока лишь мечты.","26":"Ноль примеров или упоминаний объектов, но это ладно, давайте попробуем","27":"Это синонимы, сейчас форсят первый вариант","28":"А почему?","29":"не понял немного","30":"а Simula оказывается потом ещё вступил в какую-то битву с редакторами википедии","31":"Никогда не стоит загадывать. Может в итоге вы и окажетесь тем, кто втащит ним в биллинг-продакшен :)","32":"а. оп. пардон. не туда посмотрел","33":"документацию","34":"Почему тут у нас хентай с асмром?","35":"мою физ. форму описывает выражение \"ой блять\"\nздоровье +-\n\nсложно думать, я недавно ток полноценно встал","36":"Hax писал еще","37":"из сурсов ничего давно уже собирать не надо","38":"shкёрт","39":"да вообще можно не вникать в канон","40":"в си нет перегрузки","41":"то стрелочки, то ::","42":"Так что да, баги","43":"чо делать","44":"да","45":"а с отслеживанием эффектов стало возможным, прям топ","46":"Не всегда имеет смысл делать биндинги для либы на другом языке из-за неудобств в разности парадигм или синтаксиса. Некоторые вещи проще реализовать прямо в Nim.","47":"На умные обычно и не отвечают","48":"это перевод из одного языка в другой, как гугл транслейт","49":"еще мутабильность у меня локальная, но это супер эксперементальная тема, не знаю оставлю ли так","50":"получила бы кложа такую распространненость еслиб не была JVM, очень врятли","51":"просто она делает это в виде эффекта","52":"Переделал launch и tasks. Теперь вообще global пропал 😂","53":"да, это понятно... до ссылок еще не дошел","54":"^ тут в папке много хороших примеров","55":"Но header, emit и т.д понятное дело не работают","56":"понял","57":"```function big_452984862() {\n  var result_452984885 = ({io: 0, pad: new Uint8Array(17)});\n\n    rawEcho(makeNimstrLit(\"DDD11: \"), HEX24_318767110(prevBig_452984863[0].io));\n    result_452984885.io = 5;\n    rawEcho(makeNimstrLit(\"DDD12: \"), HEX24_318767110(prevBig_452984863[0].io));\n\n  return result_452984885;\n\n}```","58":"эм ... да? Я как бы и показывал вариант зависимостей которые я даже поставить не могу","59":"когда до тебя докапываются с каким-нибудь бредом типа а вот тут по оси пунктир не так","60":"ыы","61":"А самая обычная процедура","62":"а там `date`","63":"Это из коллекции паст с ныне почившего лурка","64":"","65":"Может обсудим что-то?\n\nА то чат обрёл площадку для бана.","66":"","67":"Там сразу много всего","68":"Все всегда избегают этого, ну в смысле оно всегда работает криво. Даж в том же Эрланге (этой фиче лет 20) ее редко юзают в разработке (в репл - постоянно)\n\nЭто одна из таких фич, которая звучит прикольно, а в работе ты понимаешь какими костылями ее прикручивали и как нестабильно и непредсказуемо твоя прога с ней работает.\n\nВ жабе тож самое, кста","69":"Да, отсюда тоже можно потырить кусочки. Но я за то чтобы их попробовать и через себя прогнать а не тупо копировать. Чтобы вопрос-ответ был. Так лучше усваивается когда у тебя есть вопрос, чем просто ответ на вопрос который ты не задавал.","70":"будешь","71":"","72":"А у нас в принципе нет разделения. Все ходят на все уроки. Всем одинаково предоставляют материал(а точнее не снижают границу труда, т.к предмет не основной), вне зависимости физмат ты или кто-то ещё.","73":"RFC: Adding Python Backend to Nim Compiler\n\nIntroduction:\nNim, being a language with extensive metaprogramming capabilities and a focus on performance, has become a popular choice for software development. The Nim compiler, being the backbone of the language, has been improving over time. However, Nim does not currently have a backend for the popular Python programming language. This RFC proposes the addition of a Python backend to the Nim compiler.\n\nGoals:\nThe primary goal of the Python backend is to allow Nim programmers to target the Python ecosystem with ease. With this backend, it will be possible to write Nim code that compiles into Python code that can be executed by standard Python runtimes.\n\nImplementation:\nThe Python backend will be developed as a backend for the Nim compiler. It will generate Python code from Nim code. The backend will be implemented in the Nim programming language itself.\n\nThe backend will be developed as a separate module that will be included with the Nim compiler distribution. This will ensure that users who do not need the Python backend do not have to install it.\n\nThe Nim compiler will be modified to recognize the `--backend:python` option. This option will instruct the Nim compiler to use the Python backend instead of the default backend. Additionally, the Python backend will provide its own set of standard library modules that will match the Python standard library as closely as possible.\n\nCompatibility:\nThe Python backend will support Python versions 3.6 and above. It will not support Python 2.x versions. Compatibility with popular Python frameworks, such as Django and Flask, will be a priority.\n\nConclusion:\nThe addition of a Python backend to the Nim compiler will be a valuable addition to the Nim ecosystem. It will allow Nim programmers to target the Python ecosystem with ease, while taking advantage of Nim's performance and metaprogramming capabilities.","74":"Нарушит. Это ситуация когда причина после следствия","75":"Многие таски отменялись","76":"поэтому однозначно никак не может быть","77":"","78":"у меня вопрос - а кто-то ковырял внутренности компилятора? у меня вопрос по типу PModule","79":"И стараюсь делать сниппеты, упрощает жизднь мне существенно","80":":)","81":"но кто знает, может он заморочился над розыгрышем","82":"Он ж спрашивает это не для того чтобы реально чото сделать","83":"и сам понимаешь, людям GTK так-то не особо нравится","84":"","85":"чтобы ним сначала в js код транспилировал а он уже запускался","86":"Пятница. Как я долго ждал это слово…\n\nСколько мониторов вам нужно, чтобы работать? И есть ли у вас отношения сейчас не считая совокуплений с макросами Nim’a?","87":"Обосрал щас всех кто в гугле работает )))))","88":"спецэффект от евент лупа","89":"мне еще нравится идея сделать если тип не указан то ето дженерик, помойму в ниме в самом начале так и было, чтобы скриптователям с питона легче пересаживаться","90":"ор","91":"","92":"более-менее \"лёгкий\" синтаксис (почти как в python по \"лёгкости\", если не считать доп фич), метапрограммирование, лёгкая интеграция с библиотеками из C\/C++","93":"chroot image with program)))","94":"но я чето оттуда не увидел ничего такого достаточно 2шного","95":"для меня табу, воркать на банки, на госов","96":"Ну я не нашел аналогов им","97":"```import options, tables\n\nimport packets\/packets\nimport packets\/json\/serialization\n\npacket Foo:\n    var test*: string\n\npacket Test:\n    var foo*: Option[Foo]\n\nvar foo = Foo.init(test=\"123\")\nvar test = Test.init(foo=some(foo))\nvar js = test.dump()\necho js\n\n```так же должно работать?","98":"два раза подряд скомпиль сиходник без именений - контрольная сумма бинарника будет разной","99":"для этого есть packed прагма","100":"","101":"Вот видите, что текущая модерация творит","102":"https:\/\/github.com\/mratsim\/Arraymancer\/blob\/master\/arraymancer.nimble#L258 ну вот как пример ( и выше)","103":"в https:\/\/github.com\/nim-lang\/RFCs\/issues можно посмотреть открытые и т.д","104":"ты используешь \\n, а на винде \\r\\n для конца строк вообще-то","105":"а не какие-то рандомные пикчи и текст, который выглядит так, как будто сгенерирован цепями Маркова","106":"Там \"а\" кириллицей","107":"Ура! АПЛ ! АПЛ!","108":"https:\/\/github.com\/haxscramper\/hack\/blob\/master\/testing\/python\/nimforum_download.py","109":"ана такая","110":"А разве else не вызывается, если в цикле не было брейка?","111":"Старое это не плохо, это работает и имеет обычно кучу наработок готовых. Новомодное очередное поделие обычно сырое, не испытанное и нормальным станет только когда станет старым ибо сырое глючное говно никто в своем уме в проде юзать не станет.","112":"Кто-нибудь знает библиотеку на ниме для транслитерации ?","113":"интересно дадут мне ачивку или нет. прошлое тоже было showstopper","114":"хотя что тут понимать, запрещено же менять case поле, значит должен пруф работать","115":"","116":"я сделал на 38 но оно без остановки","117":"Я переводил Nim на С++ и даже в этом случае я предпочел это ручному переписыванию или наколенному транслятору","118":"И?","119":"Форум отдает историю редактирования","120":"оказывается это не ооп язык аля джава с синт сахаром, как я думал","121":"Чото блять происходит","122":"но для файла нет, т.к. у нас нет общего типа пути к файлу","123":"","124":"да. и это по сути попытка решить проблему. Плохо получается, когда у тебя куча программ, которые используют одно и тоже.","125":"https:\/\/www.terraform.io\/downloads.html\n\nhttps:\/\/github.com\/kubernetes\/kops\/releases","126":"https:\/\/opensource.apple.com\/source\/clang\/clang-137\/src\/docs\/ExceptionHandling.html вот ещё","127":"а Araq'а сообщение оставили","128":"мне нужно было месяц циферкой, а не буковками","129":"ну я вроде как по опыту говорю, команду написал, вышел из сессии и зашёл с другим DE, усё вроде как","130":"Лол","131":"тысяч триллионов триллионов триллионов лет","132":"```Error: type mismatch: got <ref Statement, int literal(0), int>\nbut expected one of:\nproc getColumn(st: ref Statement; idx: int; T: typedesc[SomeFloat]): SomeFloat\n  first type mismatch at position: 3\n  required type for T: typedesc[SomeFloat]\n  but expression 'int' is of type: int\nproc getColumn(st: ref Statement; idx: int; T: typedesc[SomeOrdinal]): SomeOrdinal\n  first type mismatch at position: 3\n  required type for T: typedesc[SomeOrdinal]\n  but expression 'int' is of type: int\nproc getColumn(st: ref Statement; idx: int; T: typedesc[seq[byte]]): seq[byte]\n  first type mismatch at position: 3\n  required type for T: typedesc[seq[byte]]\n  but expression 'int' is of type: int\nproc getColumn(st: ref Statement; idx: int; T: typedesc[string]): string\n  first type mismatch at position: 3\n  required type for T: typedesc[string]\n  but expression 'int' is of type: int\nproc getColumn[T](st: ref Statement; idx: int; _: typedesc[Option[T]]): Option[T]\n  first type mismatch at position: 3\n  required type for _: typedesc[Option[getColumn.T]]\n  but expression 'int' is of type: int```","133":"Там также выражения, утверждения, система типов, скоупы","134":"каким?","135":"🤨","136":"io_uring👉👈","137":"лучше вместо нескольких эхо одну строку собрать и разово вывести","138":"поэтому шизик","139":"и чо","140":"еще и hsts","141":"ща","142":"Dom96","143":"Интересно почему все пилят фронтенды к ллвм, а не к гцц","144":"Будет строка с ref семантикой","145":"или сменить свой взгляд на то, что такое nimble, или сделать отдельную тулзу для сборки ПРОЕКТОВ","146":"Ладно инжекты","147":"пока да, юный падаван 🙂","148":"","149":"Спасибо","150":"Арчу тоже 21 год","151":"любое часто обновляемое терминальное приложение","152":"но в жаве это выглядит ужас. Когда первые строк 100 могут быть импорты. При этом не такие короткие, как в го. \n\nХотя в Го есть импорты с гита. Это еще тяжелее дебажить иногда.","153":"А без разницы, какой тип","154":"Ну мне был никаиф изучать эрланг синтаксис, а вот эликсировый зашел","155":"nim-ui ?","156":"Больше не затупишь. Теперь ты знаешь. 🙂","157":"И  всякие  ||","158":"реально кстати похоже","159":"Лул","160":"Напрямую подключать - слишком много контента все равно, так что это лучше чем ничего и лучше чем тотальное забивание всего трафика","161":"","162":"хочу понять откуда стоко хайпа про \"Its just data\"","163":"и внутри if с проверкой ноды на nnkAsgn","164":"ну как бы дыа","165":"Но в консоли network там правильный ip","166":"По сути это просто возможность не городить вложенность-hell за счёт локалваров","167":"для AI","168":"почему","169":"ну до конца года у нас чуть больше 2 месяцев","170":"и кидаешь неприятную вайфу","171":"и надо еще смотреть как msgpack отправляет байтики. endianess решает.","172":"Просто привёл то, что первое пришло в голову. Так согласен, что пример не очень показателен","173":"😵‍💫","174":"orc с собирателем циклов","175":"один такой шиз написал TempleOS","176":"Ещё можно openarray в seq переделать если нужно","177":"","178":"You make my day... Ой сорри, тыж английского не робишь","179":"10MB 1 html file + over9000 css and js?\nwhhyyy?","180":"","181":"Там и говнокод на русском и книга на русском зайдёт","182":"Очевидно мы просто не занимаемся языкостроением десять лет","183":"Странно, а у меня другие сведения - Linux, BSD, Cisco, Oracle и SAP Это ты наверно про экономику колхозников.","184":"конечно маловероятно что много апвотов будет, но всё же","185":"Классно, классно.","186":"Эээээ\nЯ тупой. Не говори мне таких сложных вещей. \n\nЧто такое СТ?!","187":"И hot reload интересно как сделали","188":"А там acquire без таймаута. Будет ждать вечно вроде.","189":"Если банально в доках такую хуюту пропихивают, боюсь предствать что в недрах творится","190":"Кроме prologue и karax я даж хз чё из +- полноценного отметить","191":"Nimble версия","192":"Или что можно через `do:` делать ад по типу\n\n```assertEq do:\n  collect(newSeq):\n    # ...\ndo:\n  collect(newSeq):\n    # ...```\n\nкогда нужно например сравнить результаты из двух блоков кода многострочных но не хочется делать переменные","193":"На линуксе можно отключить второй пароль для входа в аккаунт после включения. Получается вводишь всего один раз","194":"И по логике..... В разделе \"какие языки повлияли на этот\" должны быть все языки с которыми автор знаком","195":"как же я ненавижу ебаное ФП","196":"https:\/\/vlang.io\/early_v_patreon.zip","197":"Привет uebernihilist, добро пожаловать в ru.nim.talks! Как дела?","198":"","199":"Уважаемые ALL. \nКто-нибудь пытался скрестить nim с stm32 HAL? Совершенно задрал c++ и c. Хочется более приятного синтаксиса.\nПро эти проекты в курсе:\nhttps:\/\/github.com\/mwbrown\/nim_stm32f3\/\nhttps:\/\/github.com\/shima-529\/STM32OnNim\/\nоба похожи на попытки хоть что-то сделать с устройством, интересно, но мало полезно.","200":"sqlite биндинги есть к ним.","201":"> this can be a non-trivial task","202":"Компилятор ещё не особо это оптимизирует. В D есть возможность распологать классы (их аналог рефов) на стеке, у нас вроде нет","203":"может конечно троллинг, но как-то слишком","204":"Ну короче бросили дело на пол пути.","205":"однозначно кложа","206":"неявные перемещения в юнионах вообще всё сломают.","207":"https:\/\/vlang.io\/","208":"Ну я же написал для чего","209":"Типа, нет обработки 429 на уровне либы?","210":"примерно при тех же обстоятельствах Столлмана из СПО выперли","211":"В quote do блоках вызывать другие макросы и т.д","212":"Раст прикольный, единственный язык стабильно обгоняющий си в бенчах, токо бирари тяжелее","213":"","214":"Ага ага","215":"у нас со временем тож стал популярен","216":"Особо желания нет.\nПосле \"подумай дважды\" и \"если подумать, как это должно работать, то все станет ясно\" от Araq, когда я указал на неконсистентность ошибок при изменении дискриминанта с приходом ARC, я действительно начал думать, а нахер оно мне надо.\nСкажу честно, компиляторы всё ещё, по большей части, для меня чёрный ящик. И если при составлении ишью я ещё должен в голове прокручивать возможности компилятора Нима, то я просто недостоин указывать на его возможные ошибки.\nУсугубляется все тем, что я балуюсь с экспериментальными фичами, которые экспериментальные уже несколько лет и на репорты на них как будто никто не обращает внимания. \nВ подвешенном состоянии и концепты. Имеет смысл жаловаться на старые концепты? А на новые? Может они просто ещё не допилены, вот появится время и Araq всё сделает","217":"Интересно стало","218":"в итоге селениум меня победил, но я скачал просто все посты через wget","219":"Во всей ос доверять можно только себе","220":"Аллах","221":"но да, сравнить с jemalloc будет интересно","222":"просто ты не говори что типа крутой шрифт","223":"Мм, тогда не так плохо","224":"Пингани как баг найдешь","225":"csources тут вообще ни при чём","226":"нужно подождать пока скорость вырастет","227":"https:\/\/github.com\/snej\/nimdbx глянь уже.","228":"Я думаю, что массовые квантовые появятся раньше. 😊","229":"очень интересные сравнения у него","230":"Да, нужен gcc\/make\/git. Это чем nim для сборки пользуется","231":"каждый месяц язык меняешь","232":"shut yourself down NOW","233":"","234":"echo \"\\u0B32\"","235":"у мя в школе большенство свалили в хим био, класс расформировали и пришлось менять школу","236":"`a` тоже меняется","237":"Это я ремесленник фулстек тяну без изысканости всякой 😂","238":"Оу, как так, надо почитать","239":"тут не в этом дело","240":"раст это само по себе лютый пиздец. остальное несущественно.","241":"\"Еще задолго до появления Smalltalk Алан Кей сформулировал три фундаментальных принципа объектно-ориентированного программирования:\n\nОбъект - базовая единица объектно-ориентированной системы.\nОбъекты могут обладать состоянием.\nПосылка сообщения - единственный способ обмена информацией между объектами.\nТаким образом, видно, что изначальное определение существенно отличается от привычного нам инкапсуляция-полиморфизм-наследование\"","242":"ты еблан?","243":"Ага","244":"он хотел чтобы кодген делался бинарником собранным","245":"","246":"https:\/\/nim-lang.org\/docs\/manual.html#set-type-bit-fields\nчто-то он на прагму .size не смотрит","247":"короче это не муж и жена, а один и тот же человек","248":"ну им это нужно, да","249":"","250":"для dereference","251":"Мне кажется все в парсер упирается","252":"он скорее просто выберет другую","253":"Жаба твоё всйо","254":"Они ещё твитили типа \"ЛЮДИ, ОСТАНОВИТЕСЬ, НЕ ПРИСЫЛАЙТЕ НАМ ЗАСЕКРКЧЕННЫЕ ДОКУМЕНТЫ, ВАМ ПО БАШКЕ НАСТУЧАТ\"","255":"Вот в таком примитивном варианте - можно, но когда там тупо глухой колбэк стоит - не стоит","256":"ну я конечно минут 5 пытался сформулировать так чтобы понял","257":"а, он co-founder","258":"они так json десереализуют","259":"Ну, кто пнет первый эту фею ?","260":"я про компиляцию","261":"ну то есть 200мс это на вывод","262":"там nil == discard если что, это просто значит что это пустая ветка","263":"Ну это очень специфичные моменты. В таком случае да - понимаю зачем.","264":"ор))","265":"https:\/\/forum.nim-lang.org\/t\/8375","266":"в ниме вообще нет кодировок вообще-то","267":"гусь и кейл это кто?","268":"ну, это выход newStrLitNode","269":"всё кидают в dict'ы","270":"как говорится,","271":"без этого нет","272":"Тоже интересно","273":"ор","274":"Zim","275":"Да работает он","276":"Меня ужасает скорость твоей с которой ты печататешь...","277":"В Википедии норм описывается","278":"","279":"удачи","280":"Выслушаем другую точку зрения","281":"вот у нас лучшее комунити","282":"охуеть, правильно","283":"хмм","284":"ыаы","285":"https:\/\/crystal-lang.org\/sponsors\/","286":"Вот спасибо за совет. Все легко поставилось","287":"чем проще синтаксис, тем меньше ошибок и быстрее компиляция","288":"","289":"я про кросс-компиляцию","290":"так легче","291":"да нет, это выражение целиком не того типы","292":"Language:\n`👑 (Nim)`\n\n**Source:**\n`var a: int\n\n(a, a) = (1, 2)\n\necho a`\n\n**Result:**\n`2`","293":"","294":"Он знает","295":"","296":"Я тут подумал, мне питон нужен только из-за opencv, templateMatching, чтобы различать надписи и отдельные фигуры, tesseract не подойдет, хотя бы потому что недостаточно быстр. И я тут подумал, ведь можно различать фигуры по определенной базе последовательности пикселей. Мб есть какой-то простой алгоритм или реализация этого на другом языке? Я подобное писал на расте, из кучи if, но потом забил и стал юзать питон","297":"Правда, не знаю, как Jai применим для общих задач, он всё-таки под игры заточен.","298":"Ща, попробую тестануть","299":"ну нет, сначала обсудим что такое нормальные языки","300":"нуу.. а то что получается после cast[uint] — и есть uint представление адреса процедуры?)","301":"да ему нечего корячить","302":"исключения придут если чо там где я их жду, а не хер знает где.","303":"Блять","304":"","305":"\"ханжа\"","306":"А там ты не присваивал","307":"вот бы компилятор об этом говорил","308":"Оценка выдачи поисковика","309":"ты можешь чекать кайнд в when по логике","310":"но все равно можно было бы сделать правила по которым весь дефолтный ним был бы нон нуллабл, оставив нил для сишки","311":"хз","312":"правда там триал вроде 3 месяца","313":"а можно данного бойлерплейта избежать? что-то не могу вспомнить\n```MyStruct(user: user, tag: tag, url: url)```","314":"Болгария?","315":"без ошибок","316":"https:\/\/youtu.be\/RLl1pTu3_J8","317":"Думаю по времени вылечу","318":"","319":"я сам уже сравнил если что :)","320":"да","321":"ну не знаю, не знаю","322":"","323":"и делают примерно одно и то же, пишешь слово над функцией и теперь эта функция стала особенной","324":"","325":"Всегда сука такие самоуверенные, что в их софте не может быть ошибок, яебал","326":"До mastering nim вышла","327":"их можно заменить другими регистрами того же размера","328":"Не прокатит. Это тип в макросы идёт.","329":"Я понял, для меня и так сойдёт","330":"BTW! I USE Terminus as my font!!!! EVERYWERE TERMINUS BITMAP FONT!","331":"```proc write(x: string): string = \"hi\"\nproc write(x: int): string = \"bye\"\n\n# let myprc = write # error!\nlet myprc = (proc (arg: string): string)(write) # argument names don't have to match\necho myprc(\"hi\") # \"hi\"```","332":":)","333":"нет","334":"заебись","335":"кст, там мне кажется про алису загвоздка есть","336":"Если мне скажем из строки надо получить float32 то норм делать типа `cast[float32](myString.substr(0, 3))`","337":"для рантайм есть к примеру https:\/\/github.com\/yglukhov\/iface","338":"хоть и не совсем плачевный, though","339":"ну я про USD","340":"ознакомление с евангелионом обязательно?","341":"И Java тоже","342":"что планируется для следующей стабилки - 1.6","343":"потмоу что всё что завязано на ПК и реально поддерживается известными брендами железом - это по-любому будет win, ну а *nix - это уже как там великодушие производеля покажет себя","344":"Это -Xmx1700M","345":"в некоторых случаях, где это безопасно, компилятор может присвоения типа \"let b = a\" перевести в простые алиасы","346":"> сборище объектов - цифр","347":"huyeah","348":"","349":"Баяяян","350":")))","351":"\"or we'll die trying\"","352":"Ну смотри, когда люди пишут код в разных файлах, зачастую люди постоянно делают импорт одной и той же библиотеки несколько раз. И вот есть ли такая \"штука\", которая во все файлы добавляет за тебя все эти штуки по умолчанию.","353":"Аааа","354":"ну по-другому и норм","355":"Замарались.","356":"у мя уклон в веб, тут часто похуй на оптимизации","357":"так и есть ))))","358":"ты упёрся в то, что флаги трогать не хочешь и сокет трогать не хочешь - значит ты не должен и создавать его руками. просто пробрось все параметры внутрь ф-ции и всё.","359":"В каком плане \"предпочтительней\"? Стабильность?","360":"у меня он не смеет так делать)","361":"потом в отдельную переменную с умножением","362":"Не","363":"В расте чувствую себя зажатым а тут слишком свободным","364":"*py","365":"Но я находил утечку старой инструкции","366":"О ебать ноунейм ВПН заработал","367":"jvm не нужна","368":"Комменты это же просто группы","369":"Блин, когда я ботами занимался, я сразу понял, что апи такое для того, чтобы было проще, и понимание stateless в том смысле, что ты не знаешь, что ты отправил — это нормально и доступно","370":"он просто","371":"кристал","372":"бывают процедуры обычные и closure'ы","373":"Умора","374":"Казалось бы, почему cdek не пошта России","375":"@Yardanico через posts.json","376":"я не спорю","377":"change my mind","378":"`replaceVarsInFile` я конечно кода не вижу, но по идее файл или ручками надо создать, или предусмотреть его создание автоматом","379":":DD Главное как копают землю, а не кто ))","380":"ну там 2 версии же","381":"Так зачем","382":"хотя PRы ревьювит","383":"там оно есть","384":"Хотя вот trace несколько необычно","385":"Куда смотрит Грета Тунберг","386":"Это terralith","387":"нечего делать","388":"Задумка","389":"блять","390":"вор","391":"ну в отдалённом будущем","392":"и в последний раз у меня не завелся LSP","393":"Это из ванильного MC если что","394":"Ну а по факту он настолько справа, что его не видно","395":"https:\/\/nim-lang.org\/docs\/system.html#%40%2CopenArray%5BT%5D","396":"нет","397":"я на 99% уверен","398":"да так рофлили под статьями про wasm, а может не рофлили","399":"у нима она \"сильная\", не как в Си к примеру","400":"У васма все равно сколько дали памяти, столько и юзаешь","401":"есть даже целый туториал","402":"Если нет боязни лиспов, то могу посоветовать racket. Крутая штука и функциональная парадигма преобладает","403":"Ну я про смерть даже и не заикался. Просто ты написал, что считаешь себя самым разумным человеком на земле, потому я подумал, что ты считаешь, что где то ещё есть люди.","404":"Это likely\/unlikely меняет порядок размещения веток в бинарнике","405":"там же Text","406":"ну тем не менее похоже это default way на будущее, тот же kakoune и kate завились с пол-пинка","407":"Это доебалась до китайцев и они в принципе выразили интерес, сказав что будут рады сотрудничать когда приду уже как юрлицо","408":"ну и да, второе, самое главное, оно течет","409":"То что она сервером генерируется это похуй, если в ней жса нет - она статична. Это SSR называется","410":"и народу хрен-да-нихрена...","411":"Не, я сгенерил очевидно фактически неправильный ответ ИИ и в свежем диалоге попросили найти ошибки. И он такой \"все ок\"","412":"ним быстрый же","413":"Может","414":"в std?","415":"но вообще вопрос странный","416":"Никогда не было, и вот опять","417":"А с чего ты взял что оно есть?)","418":"Короч я понял. Надо писать замену OpenSSL на Nim, тогда вопрос будет решён.","419":"а, ну я такое очень редко, и, мне кажется это часто от терминала зависит","420":"http:\/\/tonsky.me\/blog\/disenchantment\/","421":"видимо просто имеется ввиду юзает","422":"ну я кинул ссыль что разраб мне сказал","423":"какой-то чел пишет юзай nim-result, но кмк это бред - nim не раст","424":"или учёба засосало настолько...","425":"но оно есть","426":"У меня так друг в русскоязычной команде работает, но вся коммуникация и документация на англе","427":"switching renderers makes it faster but comes with different bugs","428":"а гуй пишешь на свифте, прям из xcode","429":"на \"программиста\", ага","430":"лет 6 наверное назал","431":"styleCheck вроде улучшили","432":"виктория штоле","433":"кстати относительно линуксов и WSL:\nвот с моего компа:","434":"Шашлык многое в нем улучшил","435":"А я не понял)","436":"А что так?","437":"где?","438":"а кто потенциал определяет","439":"if no update in chat -> update message\nelse if got update from chat -> send new one","440":"","441":"см Си","442":"юнити не движок а фреймворк","443":"да не реф","444":"Ну да совсем немного осталось до релиза 1.0:\n\nhttps:\/\/github.com\/nim-lang\/Nim\/milestones","445":"you of course can ask a question in this group but there are much more english speaking people who could help if you ask in english","446":"Меня убил его код выдаваемый для хэловорлда","447":"sodium","448":"Просто сложилось впечатление, что раз монорфизация, то это никак не может быть дженериком. А какая разница во что я это генерирую, если у юзера все равно тип стёрт","449":"Ну глубоко","450":"","451":"а есть разница между разными ARC без ORC?","452":"столько всего пропустил","453":"","454":"3) новый компилятор собирает последний компилятор (т.е. сам себя)","455":"hindley-millner работает в обе стороны - то есть вызов функции например может разрешаться на основе того какой переменной ты присваиваешь","456":"я подберу теги","457":"> не получишь за это денег -> длясебяшка\n\nне обязательно, может длядруго...шка","458":"а ванила уже совсем иначе","459":"ядро обработает команду","460":"Если бы я сейчас выбирал, я бы отказался и писал диплом как обычно","461":")","462":"прикинь каждый популярный *fetch в репу добавлять?","463":"чтобы фильтровать аудиторию","464":"нахуя","465":"лучший язык","466":"да ладно","467":"капитализм всем своим естеством поощряет заведомо авторитарные структуры","468":"я чёт подумал","469":"следствиее популярности js на фронте","470":"Земля плоская, @crystal410 ?","471":"а я анилибрии фан, и андабов с няя си энджойер","472":"Интересно, есть ли вообще туториалы по программированию от француза?","473":"не значит что они работают конечно","474":"Спасибо за пояснения","475":"Уберут варнинг по умолчанию","476":"Я про наоборот","477":"главный файл C API","478":"Фига","479":"Жду плевков на прощание :)","480":"Language:\n`👑 (Nim)`\n\n**Source:**\n`proc makeCall(pr: pointer) =\n  cast[proc(a, b: int)](pr)(1, 2)\n\nproc mySum(a, b: int) = echo a + b\n\nmakeCall(cast[pointer](mySum))`\n\n**Result:**\n`\/tmp\/tmpjugrpi2d.nim(2, 3) Error: expression cannot be cast to proc (a: int, b: int){.closure.}`","481":"?","482":"а, ну и там было __I checked your previous posts a bit__, то есть, бан не за этот тред, а по совокупности","483":"","484":"Иногда работать одному проще в разы. Пропадают сложности с логистикой","485":"что когда коллаборатор - видно что коллаборатор","486":"except вполне можно специализировать","487":"не слышал о таком","488":"Раз в месяц со старыми друзьями собираемся","489":"Комп с моником таскали друг к другу, шобы по нуль модему поиграть 😂😂😂😂","490":"или что там в качестве сборочной системы идёт на маке","491":"nimpretty","492":"В С это решается руками без проблем. ГЦ тупо не нужен совсем. Если хочется отслеживание не руками - велкам в С++. Там умные указатели всё решают давно.","493":"nim c t3330.nim - я так делаю, может и не правильно 😊","494":"перманентное состояние с этой нейронкой","495":"","496":"И не выйдет","497":"на одну и ту же локацию","498":"А через llvm ir ллвм не делает","499":"хмм, кстати ща задумался, а валуе типы в общем случае без всяких владений и мув семантик копируются при возврате ?","500":"shr shl","501":"если есть время и возможность, будет кайфово. Тут важен принцип регулярности, он должен мозолить глаза, как тот же раст или го","502":"","503":"Ну рынок порешает.","504":"use GNU Products","505":"Language:\n`👑 (Nim)`\n\n**Source:**\n`echo `+`(-10)`\n\n**Result:**\n`-10`","506":"та там выше уже двое шутили","507":"скорее уж будет что-то типа debug(x: MyType)","508":"но для этого нужно импортировать модуль?","509":"Ты душнила","510":"С какими пикселями?","511":"ТВАРЬ)))))))","512":"Решил свой вопрос пока так и очень тупо:\nАсинк луп в один поток, гуй в другой, на бд коннектор навесил lock\n\nНе бейте.","513":"ну компиль под arm","514":"А чо это ебнутые... Правильно все делают. Это же не только ради Телеграма. Это чтобы православный чебурнет одной кнопкой запускать. Рунет сразу в рай, а они все просто сдохнут. Потом начнут VPN щимить. Вот есть IP и с него постоянный канал на IP за бугром и сигнатуры VPNовские. Заходим в консоль ФСБшника во Вконтакте и смотрим кто это там с того IP забугорного сидит...","515":"Оно даёт нужный код в newTestExample","516":"Я так и не понял бустрап компилятора","517":"С точки зрения языка он является отдельным типом, а не их совокупностью","518":"и будет паскакаль.","519":"нинавижу питоний отступо синтаксис","520":"И зуй хнает что там с сетью","521":"Скажи это приложениям на electron","522":"Но ладно","523":"?","524":"понятно, уже ADHD kicking in","525":"Ыыыы","526":"https:\/\/github.com\/telegramdesktop\/tdesktop\ncheck this","527":"Но самое имбовое было бы обосноваться на другой планете, скажем на Марсе. Это идеальная позиция для обороны. Вражеские шатлы можно достаточно эффективно сбивать ещё на подлёте","528":"нет, прост эт мажик","529":"https:\/\/github.com\/StefanSalewski\/gintro#current-state-of-these-bindings","530":"В целом — с чего бы","531":"Да","532":"У меня было больше и поминутка или по трафику, вот было приключение считать и рулить. Правда я не писал, а рулил админами всего этого хозяйства.","533":"хорошо что Crystal Dog про lite-xl сказал, иначе сейчас бы это говно клепал в блокнотике","534":"Это из документации к genSym. Похоже это значит, что объявление и использование должно быть в одном месте. А я генерирую символ в одном месте, объявляю тип с этим символом в другом, использую в третьем и только под конец соединяю все это в один stmtList","535":"Понял","536":"ну не умрем","537":"ну я же образно","538":"","539":"вроде удобно","540":"ну точнее ты сам ручками им управляешь","541":"тогда -d:danger сразу","542":"Есть нода типа `nnkRecCase`, я могу проитерироваться по ней исключив первый элемент?\nНаивный `node[1..]` не работает\n\nПока приходится в самом цикле исключать с помощью if","543":"но явно люди ещё повысят","544":"если NSFW хочешь то ещё добавь","545":"но принцип очень близок","546":"Он тоже по VM, если не ошибаюсь.","547":"Этот чел уже несколько лет работает флаттер разрабом, пару компаний поменял с повышениями","548":"чтоб запустить","549":"привет","550":"только для клиента макоси instantview на десктопе","551":"~~безопасность превыше всего~~","552":"не думал что замена цикла на copyMem так в скорости выйграет","553":"перепешите на кристал хотя бы","554":"но што поделаеш","555":"CNAME(\"deser\", \"gabbhack.github.io.\"),\n    CNAME(\"gemi\", \"prunariu.space-nomad.com.\"),\n    CNAME(\"hayago\", \"liquidev.github.io.\"),\n    CNAME(\"loco\", \"moigagoo.github.io.\"),\n    CNAME(\"moigagoo\", \"moigagoo.github.io.\"),\n    CNAME(\"norman\", \"moigagoo.github.io.\"),\n    CNAME(\"norm\", \"moigagoo.github.io.\"),\n    CNAME(\"xidoc\", \"xigoi.github.io.\")","556":"отступ сделай","557":"почему уместнее?","558":"Ребза, спешу поделится, гля шо нашел https:\/\/github.com\/rxi\/lite","559":"А шо это?","560":"","561":"у тебя смерть будет в обеих случаях есть кабель сдох","562":"зачем","563":"в каком смысле?","564":"ещё раз пишу, как же тогда там это работает?","565":"правда справедливости ради чем больше окунаешься в реальность тем меньше тянет на аниме","566":"типа вот смотрите я сделал говно из палок, как круто?!?!","567":"и да, такое же есть для питона","568":"ор)))","569":"","570":"","571":"я понимаю про дефекты, я не понимаю почему IndexDefect залетает в дефекты _всегда_","572":"ща подумал. по идее что мне надо чтобы заменять монгу на InMemory в 1 клик","573":"like shit, we can't find a div nessesary for parsing, there is nothing else to do","574":"Ос - программа - иде","575":"сколько работы у тебя появилось) и посикить и посмотреть фреймворк и фичи потырить","576":"Ага. А зачем","577":"разве изменение стейта это не определение сайд эффекта","578":"все проще. Вот эта функция. Вызывается 1 раз. Отправляется в аллокатор godot потом может быть освобождена.\nКак то так. Дальше уже godot управляет памятью.","579":"Я буду среди тех, кто пишет: \"а я с самого начала говорил!\"","580":"Куда ты тут вставил задержку - я так и не понял","581":"Зачем он сделал varargs","582":"if and only if","583":"Пол is who","584":"Как раз про них. зачем они нужны?","585":"оно не ломается. оно правильно работает, а вот алгоритм у тебя похоже кривой и от этого ломается. 🙂","586":"а тут они бесплатно такие ответы","587":"Дебажить в 4 раза больше лучше, чем в 5 раз больше думать как тебе так спроектировать чтобы бороу чекер был доволен","588":"никогда не понимал зачем скриптовому языку статическая типизация... Дело привычки? Привильнее наверно сказать - указание типов переменных, как недавно в питон воткнули","589":"Поэтому оно редко используется, и чаще всего теми, кто пришел в ним из питона","590":"Чья девочка тут ходит !?","591":"Это мотивирует братишку скидывать больше кода","592":"Может он просто над задачкой моей задумался так что положил ДЦ где хостится","593":"... оптимизируюссс","594":"версии","595":"тут не спорю","596":"Даже в третьем или каком то там старом думе","597":"Не каждому дано хромиум собирать на домашнем","598":"стартап тайм нулевой","599":"кажется там проблема откуда-то из глубины template вылазит ... и кстати  это логично, понял","600":"Для добавления архитектуры в принципе нужно просто добавить название, битность и т.д","601":"И в целом я для себя тоже не вижу причин не юзать","602":"А, столкнулся с проблемой после скриптовых языков. Решил сделать msgpack с этими самыми... С запаковкой все норм, практически, а вот распаковать и получить неизвестную структуру - фиг. Даже в haxe есть dynamic, а тут...","603":"но всё равно","604":"Думаю народу пригодилась бы мелкая платка-расширение, ват на 70 чтоб без доппитания и с производительностью как у какой-нибудь 3090","605":"не, я именно про длину колстека","606":"","607":"ну да, синтаксически выглядят как типы суммы, а на самом деле сахар для дженериков, мяхх","608":"затрален","609":"это всё хорошо в теории. на практике - нечитаемо","610":"how to run","611":"я недавно зачем-то прослушал полное заседание комиссии в конгрессе по поводу twitter files","612":"типа есть файл","613":"Там дальше cblake говорит о том, что тестирование orc на большой кодовой базе, с которой знакомы разработчики (компилятор) полезно, на что Araq ответил:\n\n\"Конечно, но время, которое мы потратим на koch boot --gc:orc это время, которое могло бы быть потрачено на IC или not nil.. сложный вопрос\"","614":"мой друг думает что это супер умный бот))))","615":"?","616":"Да и ты первый кто в этом чате поднял этот вопрос за кучу времени","617":"почему то первыми вылазит не документация","618":"а что за вуз, если не секрет?","619":"😂😂😂😂😂😂😂😂😂😂😂😂","620":"не сегодня kek.su, не сегодня","621":"Хорошее кино. И в тему. 🙂","622":"Сейчас вместо врайк какая-то другая компания продвигает","623":"это надо отпраздновать","624":"nerd font","625":"Araq вообще вроде немало языков знает и следит","626":"Я бы предложил компиляцию в dll ним","627":"аа погоди","628":"а так да, это болезнь","629":"","630":"я чай","631":"А то перегружать можно, а дженерики нельзя, как-то нелогично","632":"стоп, в ниме есть вывод типов по хинди минди ?","633":"не всегда оно удобно. Даже напротив на моем опыте сделать брейк гораздо проще чем хреначить в условие цикла длинющее выражение","634":"","635":"не классы","636":"типа поэтому можно писать SQL выражения без кавычек и т.д","637":"я ему говорю типо зачем так странно писать","638":"всё бы ничего, я бы стерпел, если бы не начало строчек с запятых","639":"попробую head","640":"Поздравляю)\nНикогда не понимал почему все всегда желают здоровья, но сейчас, сгибаясь из-за давления, понял, что желают того, чего самим не хватает. Желаю здоровья)\nНе забывай выходить трогать траву (или снег). Помимо написания лучшей ОС\/языка\/etc должны быть и простые дни на воздухе - для разгрузки мозга и тела в целом.\nВ остальном, развивайся и изучай что хочешь. Если что-то надоело - бросай. Гораздо лучше понять, что что-то не твое, раньше, чем терзать себя по каким то глупым причинам.\nНадоест писать ОС пиши другое, и пофиг что в чатике напишут","641":"Самый прикольный исходник на C++: греческие имена, японские, средиземье и т.д. :)","642":"шутка","643":"кстати","644":"и прикол в том, что там основа движка на FreePascal","645":"ну да, на 128байт интро оно не потянет :)","646":"там по порогам каким-то, их можно менять","647":"Причём реализация методов может находиться отдельно от файла с телом класса","648":"как компилили до первой ОС?","649":"щас","650":"Там я думаю самое то asm или уж сразу маш коды :)","651":"https:\/\/github.com\/ringabout\/awesome-nim","652":"всё _немного_ сложнее, попытка поймать IndexDefect теперь через Error не работает","653":"А ты в МСК или регионе?","654":"Зачем?","655":"У меня основным языком был GDScript, сейчас C#","656":"примаунтить без рута можешь?","657":"в Ниме ты и стринг не можешь сделать","658":"Без никакого обмана и без перевода с китайского","659":"капец","660":"Section 4 - 6 If condition","661":"изи же","662":"Просто таймаут","663":"В плане?","664":"Пример опять же раст - сколько там людей, а всё не хватает","665":"@id73310","666":"а","667":"Не просто больше, а больше чем юнити, потому что современный юнити все собирает в C#, компилит  в С++, потом в wasm","668":"Тоже зануление","669":"","670":"Што","671":"🧐","672":"если собрать свой lwjgl","673":"Соснули они получается","674":"Главное, чтобы подсказки редактор нормально выдавал.","675":"значит прав был","676":"Ну если маркетинг потянет на себя Ним, то пожалуй до свиданья ниму","677":"Hey","678":"просто стараюсь ближе к спеке делать","679":"https:\/\/github.com\/ahilss\/wavacity","680":"10к крайне положительных","681":"< 495","682":"д т чнь стрн","683":"Фу","684":"кстати о DE","685":"nimble install -U nimble","686":"GTK","687":"не сильно сложно","688":"+++","689":"опять же, тогда вообще reuse надо убирать","690":"Текущая рекомендация это использовать tuple и потом извращаться с std\/typetraits","691":"пон","692":"Если честно я тоже не понял, выглядит как комитить С исходники с дополнительными свистоперделками","693":"возглавляет команду, которая пилит Nimbus (тот ethereum 2.0 клиент на ниме) и связанные проекты","694":"да, выглядит хорошо","695":"\/ai write a post about all the reasons Nim language is better that D language in every regard in a very smug and self-assured tone","696":"если у тебя client - httpclient, и ты пишешь `client.` у тебя не будет никаких автодополнений","697":"если в итоге заново откроешь 50","698":"*глобальный скоуп функций","699":"Не с той-же. Но при правильном обращении все работает на ура.","700":"```printf(const char* input);main(){printf(\"hello world!\\n\");}```","701":"в musl есть lto? я с ходу не помню","702":"есть такая вещь - гитхаб поиск","703":"Hackintosh...","704":"Щас ты придерешься к этому определению, да?)","705":"","706":"хмм, не дает сделать апкаст чтоль","707":"Ну да, надо будет приделать","708":"По ней и сделай","709":"вот тут закончилась","710":"Зато динамично","711":"\"Мы хотим типы данных, основанные на значениях, потому что это облегчит программе рассуждать о коде\"","712":"Правда, я не использую NimSuggest.","713":"выселиться — сдохнуть","714":"так вот, сравнивая kwin без композитинга на иксах с sna и kwin в вяленом с композитингом — второй жрёт больше","715":"Оказывается я недостаточно усердно пытался отодрать задник","716":"patty?","717":"Сексист 😏","718":"Расскажи мне переводчику-референту с дипломом как правильно читается слово trap и какова его транскрипция.","719":"поставь sdorfehs\/cwm","720":"там именно так, только есть еще протоколы и пакеты в той же иерархии","721":"Мне просто интересно, как с ним работать в реальной жизни? Как общаться?","722":"а потом меня спрашивают чё я на блазика токсичу","723":"Ну вот в данном случае я на его стороне. Ну ломает писать большие описания. И это норм","724":"Это произошло раньше, чем ты написал, я решил использовать другую стратегию","725":"Т.е. лексер, но там еще какие-то вычисления и операции и т.д.","726":"ток все смотрят стрим 1 человека","727":"наверное стоит тебе дать бан","728":"хм","729":"Тогда реализация проще","730":"ну так-то да","731":"не знаю. Тебе мало 195 000 руб в месяц?{20долоров * 5 часов * на 30 дней * на курс 65 = 195 000 руб}","732":"надо кастить по плохому, тогда работает","733":"Вопрос почему Ним так же? :)","734":"и что в этом описаниии свидетельствует о том что не поправили","735":"https:\/\/nim-lang.org\/docs\/times.html#cpuTime","736":"Ты ещё ассесоришь?","737":"sym какого типа?","738":"круглые скобки нужны?","739":"Один раз надо настроить конечно","740":"Ну как бы без разницы, в плане что какой-то ci это должен покрывать","741":"думает что это то ли python, то ли bash, то ли что-то другое","742":"Где X это тривиальная хуйня типа открыть файл на ниме","743":"Как же это прекрасно","744":"Написать хуйню","745":"","746":"чтобы спрашивать вопросы по ниму через гыпытэ","747":"Иди питон бери если хочешь скриптовой","748":"Ищу коммунити для цифровых бомжей типа меня","749":"если проблема в этом, почему нельзя просто выключить range проверки для кода","750":"тоже не особо приятный","751":"Надо макрос","752":"для тебя веб все еще обезьяны на лендосах","753":"xdotool не работает чтобы проверить","754":"Nim же еще не может в андроид, я не прав?","755":"это он где?","756":"","757":"ㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤ!","758":"Привет Carter, добро пожаловать в ru.nim.talks! Как дела?","759":"в самом документе на телеграфе","760":"Привет 🇩 🇦 🇼 🇳, добро пожаловать в ru.nim.talks! Как дела?","761":"надо принять","762":"gtk","763":"ну типа","764":"А что не так?","765":"черт, прям очень хочется поменять этот зен оф ним","766":"Можно воспользоваться итератором: https:\/\/nim-lang.org\/docs\/os.html#walkDir.i%2Cstring","767":"зачем-то заебно по кускам стримят","768":"```proc a(d: int8) = \n  echo d\n\n\na(256)```","769":"Ну и если в таске там протащить зависимости это дикая боль то со внешним скриптом это уже делается автоматом. Ну вот как пример - https:\/\/github.com\/haxscramper\/hmisc\/blob\/bad9877684c71122b0c8e6686686ff2edca51dd1\/hmisc.nimble#L20 для генерации документов микрокостыль","770":"Все равно пока эта коллекция просто рандом ссылки котрые кидают","771":"почему сразу уведомления не прилетают, что чел напечатал в чат то-то","772":"Я готовлюсь к вело сезону )) я хочу ща марш бросок сделать, и к лету высвобдить время для покатушек ))","773":"","774":"","775":"\"информации о Nim \"","776":"","777":"да передается копия","778":"я же повторюсь собирать из под виндовс на виндовс это попаболь.","779":"Вот результаты когда аргументы уже внутри программы:\n```perf stat -r 3 .\/main\n[dlang ldc]\nldc2 -O3 -ffast-math -reroll-loops -flto=thin main.d\n1,48002 +- 0,00453\n\nldc2 -O3 main.d\n1,5083 +- 0,0148\n\ngdc -Ofast -LTO -ffast-math -funroll-loops -march=native main.d -o main\n10,3748 +- 0,0365 seconds time elapsed\n\ngdc -O3 main.d -o main\n12,3032 +- 0,0303\n\n[crystal]\ncrystal build main.cr --release\n11,3591 +- 0,0303\n\n[rust]\nlto = true\n32,236s\n\nwithout lto\n13,103\n\n[c and cpp o3 and ofast - similar]\n[c]\ngcc -O3 -ffast-math -funroll-loops -LTO -lm main.c -o main\n6,6119\n\nclang -O3 -ffast-math -freroll-loops -flto=thin main.c -o main\n12,8160\n\n[cpp]\ng++ -O3 -ffast-math -funroll-loops -LTO -lm main.cpp -o main\n6,6000\n\nclang++ -O3 -ffast-math -freroll-loops -flto=thin main.cpp -o main\n12,8419\n\n[python pypy3]\ntime pypy3 main.py\n59,331s\n\n[python numba]\n14,340s\n\n[nim inline]\nproc `^`*[T](x: T, y: Natural): T {.inline.} =\nin\nmath.nim\nnim c -d:release .\/untitled.nim\n10,515s\n\n[nim]\n2m47,514s\n\n[gfortran]\ngfortran -Ofast -LTO -ffast-math -funroll-loops -march=native -o main main.f\n1,92337\n\ngfortran -Ofast -LTO -ffast-math -funroll-loops -o main main.f\n0m3,558s\n\ngfortran -O3 -LTO -ffast-math -funroll-loops -march=native -o main main.f\n0m12,571s\n\ngfortran -O3 -o main main.f\n0m13,550s```","780":"Кроме ООП","781":"У асинка можно свой бекенд ещё написать","782":"huuuge games","783":"ну в других выводит полседний нул","784":"Взял с https:\/\/github.com\/Yardanico\/nim-snippets\/tree\/master\/pkgraph файлик populate и закинул в neo4j","785":"Раньше срачи были интереснее под релизами Nim","786":"Это не его репозиторий изначально","787":"suffering from success","788":"не доказывает) такое я могу сделать в C","789":"тогда он выбрасывает свой аллокатор, и напрямую каждый раз юзает malloc\/free и т.д","790":"Because Spotify","791":"знач я его для своих кошек купил","792":"🤡","793":"Но ведь\n> На Nim вполне приятно писать, только типов не хватает :)","794":"Гений мысли","795":"https:\/\/play.nim-lang.org\/#ix=2Vsc","796":"why does this sticker say \"attack\"","797":"https:\/\/stackoverflow.com\/questions\/75712315\/how-to-run-an-external-program\/75712316#75712316","798":"GNU — GNU is not Unix!","799":"someSeq: @someSeq","800":"оба мимо","801":"Вот нет, у меня в продукте крутится на ниме прога сбора статистики по виртуалкам через libvirt","802":"","803":"это же не про nim","804":"Я помню такие шутки были про win95 что надо переставлять, но с виндой за посление лет 7 не помню таких проблем","805":"мы про обычных","806":"Нет бы написать \"спасибо братишка, красивый код\"","807":"а больше никто не занимается","808":"Спойлер: ничего не будет сделано","809":"А это точно \"автоматическое\" управление памятью? 😀","810":"","811":"Ну вероятней всего это с++. А что дальше - хз. Я ровдмап нашёл. Там 95% теории. И всё. Ну про треды есть, про сериализацию.","812":"tsun.dere.life\nyan.dere.life\n\nНу вы поняли смысл","813":"стоп, а в тип просто так положить функцию нельзя?","814":"я имел ввиду F12","815":"это не питон, друг","816":"Нет","817":"сестра на 6 лет старше, отдельно живёт","818":"Возвращай тогда T :)","819":"Попробуй вспомнить, где ты это услышал в первый раз. Если дома постоянно крутили, пока ты рос, вот и отложилось в подкорке и глубже. 😊","820":"Ну а кроме этих 4 я даж хз чё ещё назвать","821":"тогда typed","822":"читается почти как английский","823":"Тоесть тупо не указываются","824":"ы","825":"[hjsf](tg:\/\/user?id=2018444822)","826":"Потому что не первый случай в ИТ, когда не нужно, не нужно, а потом раз - оказывается одеяло уже перетянули","827":"и шо этим можно заменить готу и код станет менее лапшой","828":"@zhenyamega","829":"почему нельзя пользоваться просто тем дистром, который тебе нравится?=(","830":"интересно","831":"я знаю что там у всех floatSize","832":"говорите русский язык","833":"","834":"почему в этой игре украина показана с крымом","835":"ssd - server side decaration","836":"но они на самом деле во многом похоже","837":"https:\/\/dtf.ru\/u\/173123-unknowncat\/1666390-rutracker-org-provodyat-i-sovmestno-s-vk-play-atomic-heart-reklamnuyu-kompaniyu","838":"Так каждый релиз","839":"так ты строишь в самом кораблике","840":"Пробовал кто нить worm и nimdow","841":"https:\/\/github.com\/nim-lang\/Nim\/issues\/6248#issuecomment-471333413\n\nЭто так тупо. Обычные алиасы работают как надо и его это не волнует","842":"У Гугла вообще просто название большого числа","843":"ну по сути это разные типы","844":"Я надеюсь, что ты понимаешь, почему)","845":"я чет вообще не понимаю с автосаджестом этим, вроде он ниче не видит","846":"Ярд 2.1.3b","847":"в зависимости от задач","848":"я знаю что такое иксы11. не надо тут","849":"Внутри всё по другому, а снаружи - буквы.","850":"Любите морковь?","851":"Тормозить не будет","852":"В целом, либо извращаться и писать свою имплементацию строки с чанками, либо добивать каким-то спецсимволом и его скипать.","853":"Я просто сказал чтобы он писал так как будто он под коксом","854":"всё чисто на ниме, никакого С кода)","855":"я правлю докер с базой и прочую лабуду, которая быстрее не локально","856":"Забавно, но это все в точности как в вала","857":"буду новый TeamViewer open source делать","858":"","859":"но выглядела она... как любая объектная система сделанная в сишке","860":"эт над в контейнерах запускать","861":"Так как нужна последняя версия ffmpeg","862":"","863":"С раста надо, модель памяти похожая","864":"5 ЛЕТ","865":"ну чтобы точно не переперезаписывать","866":"Зачем, если в C есть встроенные типы?","867":"у него там другие тупые тролль посты про байдена и трампа и причём ссылка указана ni****s.com","868":"Чатгпт именно так обучали","869":"Через raises который","870":"Мне интересно, чем отобьёт оппонент, кто топит за теги в geany","871":"у нас есть в чате настера scanf?","872":"`let parseModeStr = block:\n  if parseMode == ParseMode.None:\n    $bot.parseMode\n  else:\n    $parseMode\n\nif parseModeStr != \"\":\n  requestData[\"parse_mode\"] = %parseModeStr`","873":"Все равно две проверки","874":"kde может работать и в wayland","875":"+","876":"во","877":"даже такое есть ) monzo.com","878":"винда хоровая ось","879":"Можешь пояснить что за файл с *.nims? Он применяется чисто для конкретного файла с таким же именем?","880":"Нахуя","881":"я, конечно, понимаю, что механическая коробка сложнее автомата. но есть человеки, которым даже не перепутать газ с тормозом - проблема. и дело тут вовсе не в машине. не?","882":"`gorge`","883":"я тс уже ковырял","884":"и я не знал, что новые концепты уже можно использовать","885":"А чо за вопрос","886":"ты чо","887":"apt-get уже обогнал по юзабилити IMO","888":"правда у меня блочится всё","889":"а так они хорошие прям","890":"надо брать 🙂","891":"hello world бинарь кросс-скомпиленная","892":"Уронит программу","893":"не в рантайме","894":"вот чтобы такое не попадало в уведомления и т.д","895":"Поздно","896":"Ну, так-то да, но как по мне большинство его \"экспериментов\" бесполезные","897":"типы суммы в питоне через |","898":"примерно как и у тебя","899":"Главарь","900":"к шаблону этому никакого отношения не имеет от слова вообще","901":"Выйдет","902":"всё","903":"тяжело мне твои dslки понимать","904":"но 0 не позитивный","905":".","906":"","907":"choosenim -v","908":"Просто статья.org на гитхабе, блога пока я так никакого и не настроил","909":"Но я так, до кучи, а вот под мобилами все изумительно работает","910":"Я вот тоже мечтаю начать его изучать)","911":":D","912":"Так что дело твоё, но смотреть с позиции \"одинаковые жсономешалки\" не рационально","913":"игра, сошиал казино","914":"```void NimMain(void)\n\n{\n  long lVar1;\n  code *local_8;\n  \n  local_8 = PreMainInner;\n  systemDatInit000();\n  systemInit000();\n  (*local_8)();\n  randomize__JYHVSm4CtuuZW3MM2Ut4bQ();\n  if ((((nimInErrorMode__759bT87luu8XGcbkw13FUjA == '\\0') &&\n       (lVar1 = rand__v7jZDEs4VOsrcpvk0yo8Rg(100), nimInErrorMode__759bT87luu8XGcbkw13FUjA == '\\0'))\n      && (num__Ms6coKUdqNZbJxuxgjJQDg = lVar1, lVar1 == 0x32)) &&\n     (echoBinSafe(TM__zGdEWNu2xofFzHVAYAbYTg_2,1), num__Ms6coKUdqNZbJxuxgjJQDg == 0x32)) {\n    echoBinSafe(TM__zGdEWNu2xofFzHVAYAbYTg_2,1);\n  }\n  nimTestErrorFlag();\n  return;\n}```","915":"megami ryou no ryoubo kun","916":"ВАХВХАХВХА","917":"Правда странно что он там в чате по V забыл","918":"это виндовый веб сервер","919":"","920":"Defect и CatchableError","921":"","922":"Блять","923":"Я почему спросил, допустим tuple и object можно под одну крышу затянуть, а вот это....","924":"но всегда можно будет юзать ARC","925":"Он тролль)","926":"почему всегда так тяжело начинать ковыряться в чужих проектах, но кажется (ошибочно) - так легко накидать что-то своё?","927":"Попробуй {.experimental: \"views\".} в начале файла","928":"Попадают, просто конкурс слишком большой. Летом вот подал поздно, сказали что раньше надо было или осенью иди. А у меня же учеба","929":"есть игра на фпц с сдл2","930":"ща покажу","931":"А вскод просто модный как и нода","932":"хз, я такого бота уже видел похоже","933":"Я собирался сам писать язык. Среднее между питоном, лиспом и сями. )))))) Но потом на dou прочитал статью Глухова про nim. И подумал, лучше присоединиться и пользоваться готовым чем самому все делать. )))) Тока хотелось бы что бы быстрее все двигалось и развивалось ) Меня очень волнует вопрос не загнется ли nim ))))","934":"https:\/\/vk.com\/wall-100232460_30401","935":"но такие фичи не поддерживаю","936":"пф","937":"там потеря точности может быть в пару процентов максимум, а за это в 2 раза меньше памяти","938":"Привет","939":"","940":"Покажи мне хоть 1 REST с нотацией которую ты хочешь","941":"@yardanico, несогласованная реклама по сути","942":"Ты же знаешь, что orc это просто arc со сборщиком циклов?","943":"ну да, потому что у тебя воид","944":"и пока не увидят ним, не знают, что им точно нужно","945":"😄","946":"но он всё равно с нимом не работает нормально","947":"@cmd401","948":"можно и myConnection[].id","949":"потом перечитал","950":"cstring с ним стороны идёт","951":"Там в смысле","952":"nimble run","953":"я не так подумал","954":"чем ты так тестишь","955":"ну похуй короче","956":"в ниме с arc\/orc класс хранится в строке тоже","957":"Не я все таки напишу описание","958":")))))))))","959":"В одном проекте? 😏","960":"инверсия зависимостей это","961":"я сейчас только на теме \"Кортежи\" в Nim basics","962":"Вот вопрос, почему `var test = Test(a: 100)` можно, а\n```var test = Test:\n  a = 100```\nнельзя?","963":"пока у тебя есть подписка","964":"Да и на питоне нет многопотока","965":"Ща вспомню","966":"из ниоткуда","967":"А есть какие-то тесты где видно падение производительности ? Как ты это обнаружил ?","968":".","969":"зачем тебе ним?","970":"Если компилить что-то попроще компилятора, то работает","971":"пока ещё draft","972":"Вот ты по каким учебникам учишься ?","973":"он и в англочате уже близок к бану мной же","974":"https:\/\/github.com\/al6x\/nim\/issues\/4","975":"а больше некому","976":"как это вообще работает?","977":"Тогда проблема с обработкой лимитов будет","978":"В общем развернул как мог: https:\/\/forum.nim-lang.org\/t\/9765#65857","979":"Пока далек от этой темы","980":"ну","981":"Aristo Ignatius","982":"Я пока не могу ни послушать ни вступить в вч","983":"Ну за, банальный пример где Dog . say Cat.say","984":"Ну нет в Bot API login\nПотому что logout не для того для чего ты думаешь","985":"((","986":"мне из помоек хватает доминос","987":"Там r","988":"нно, у меня нет выбора, мне нужен виджет код едитора, а из нормальных есть только вебный от vscodа","989":"теряется доступность (accessibility)","990":"sqlalchemy","991":"ты*","992":"","993":"","994":"покажи мне адекватных программистов которые ни-ни в английском","995":"Можем открыть итчь и посмотреть.","996":"да я погляжу у тебя стабильно по жизни логика какая-то обратная","997":")","998":"Нет конструктора - нет возможности его вызвать. Функция-фабрика не решает этой проблемы.","999":""}}