{"text":{"0":"Hi Alvaro!","1":"thank you very much Fábio","2":"yes we are noisy people.","3":"","4":"but maybe can be improved by moving swrver to linux?","5":"You can try with these testing Linux for raspberry https:\/\/arm-files.devuan.org\/ i think they do not have systemd and compare result with and without it.","6":"Somebody did a compiler using the Pascal parser included with the FCL.","7":"well just tests. very hard to make material design compliant application.","8":"BrainMM","9":"It seems to me that such materials should not be lost only at the Quora. But, and at least, somewhere else to publish, in a blog, for example","10":"In release mode it is smaller, but not significant - 380K vs 420K","11":"🆗","12":"You seems to have no idea, how many people come by, claim they would contribute and actually never did anything.","13":"I prefer single windows style of Delphi","14":"as i said, mix there","15":"using the unit custhttpapp don't create the Application var conflict","16":"I can't say count from x to y with steps of 10","17":"in the finally block","18":"https:\/\/gist.github.com\/fluisgirardi\/346c345057d851010d1de8bfcfe98752","19":"yes we can help you... but how this can help you in your future job? Will you ask us everytime you have an assigment?","20":"","21":"Are these adds for your app or is it an opensource project?","22":"but i know it is not comparable with c# lets' say.","23":"yes it's possible but not a good idea","24":"But that's invented yet","25":"regs.h.ah = 0x13;","26":"says that it's soft-float abi","27":"It was a debug thing that he uses when making a new release","28":"Very fast array routines, look at https:\/\/github.com\/fatihtsp\/FastArrayOps","29":"I dont know how to explain, under dos\/win no problem, but under Linux when i open an xterm compiled programs dont show the tipical characters of the tools characters map. There is somewhere i can change a specific configuration\/character code as IBM or similar for xterm\/bash?","30":"Installed via fpcUpdeluxe.","31":"main file is the libclite.pp","32":"no, but you can use TList<UnicodeString> or something like TWideStringList = TList<UnicodeString>;","33":"try this : https:\/\/github.com\/newpascal\/fpcupdeluxe\/releases\/download\/v1.6.0q\/fpcupdeluxe-i386-haiku-qt5","34":"Time to come back! 🙂","35":"but how a developer will see code review comments?","36":"- splitter do not show properly\n- some panels do not show \n- alignment show widgets in a weird way","37":"Try to understand it, make some efforts. Nothing is free...","38":"what and how i must to do now?","39":"I understand wrong","40":"surface rendered from the 1611 images, as you can see on shot","41":"But what id like to have is it:\nhttps:\/\/www.blaisepascalmagazine.eu\/product-category\/books\/","42":"How to convert UTF8 to past standard ASCII table in free pascal?\n\nI'm a programmer who doesn't believe in the impossible, so I'd like to see free pascal recognize a 1-byte latin character.","43":"I love Delphi","44":"but is better to hook things manually because this is a bloat piece of library","45":"```ASomeStream.ReadBuffer(AVariantVar, 16);```","46":"Any chance to make a proof of concept with delphi community for Android? Is Android target possible in community version?","47":"Do You write directly to a file log or through a Linux logging daemon (syslog)?","48":"mORMot easy way","49":"\/poll@PollBot","50":"Sorry... let me watch it.","51":"I do not tried )","52":"\"record\"👀","53":"different error message...","54":"Im undestand go to (i receber basic linguagem) continue my works kkkkkk","55":"Linux containers (at least)","56":"Delphi looks a little better","57":"maybe GTK widgetset","58":"Before implementation, right?","59":"No, there is no magic pill here. Embarcadero is unlikely to want to make a converter of Delphi to Lazarus )  As for the built-in converter in Lazarus, then, of course, if there are non-standard components, then everything is unlikely to pass automatically. Almost always manual intervention into the convertion and bringing the conversion to mind will be required","60":"Aaa OK","61":"very sad :(","62":"wow!","63":"one of the biggest limitations is embarcadero","64":"strResult:='Congratulations you are on ideal weight';\nshowmessage(strResult);","65":"Did someone work with the video? Are there freepascal libraries for the simplest actions on video? For example, to split a video into parts","66":"Other methods don't work","67":"it won't, rarely is anything perfect","68":"Has anyone encountered the problem of sharing the GUI screen of an application developed in Lazarus? That is, when I try to broadcast the application window, nothing happens, the program cannot capture the window. At the same time, it turns out to broadcast the entire screen, but if you select only one application window, then emptiness is transmitted. I used to think that such a problem is only in telegram, but it turned out that the problem is more global....\nHere somebody reports a similar problem in Skype\/Slack\/Zoom https:\/\/forum.lazarus.freepascal.org\/index.php\/topic,61446.msg462550\/topicseen.html","69":"I checked this code both in the Windows and Linux: It is works","70":"my understanding is yes. fpc has no this problem. because malloc() is implemented in glibc. it uses mmap() and sbrk() kernel calls.","71":"Hello all good people of freepascal and lazarus land! Sorry to interrupt. Its 6am in Malaysia, and i got question in my mind. Nowadays there are many good charting libraries programmed in JavaScript. While there is a nice charting component TAChart in lazarus, compare it to chart.js library, chart.js library wins hands down with more features, and also the chart is very neat, plus transition animation etc. I waited for long time for this to appear in lazarus,msvc, delphi, c++ builder etc, but it seems doing this kinda this is easier in JS and HTML5. The question is, is theres a standard way to display charts, or anything in JS inside lazarus?","72":"you are happy and proud","73":"Sorry there are so many acronyms. What is IRC ?","74":"may be somebody know about 'reference to procedure' feature? is there any hope for implementation in fpc?","75":"actually in my company i made a cross platform app platform with its own built-in cross platform IDE","76":"You can use delphi help. But Lazarus has wiki\/websites\/forums","77":"Xamarin uses native libraries on Android and iOS, while Delphi FMX is written from scratch, draws everything itself by using OpenGL.","78":"","79":"Hi guys. I want a cool chip and implement it.\nLet's say a client downloads my application via Github version 0.1, I released a new version a month or some time later. The client's application must be updated. How do I do this?","80":"either raspberry pi or architectural chroot on desktop","81":"in whcih case I can actually run lazarus like that as well :D","82":"I have issues with creating a file for usage in `uses`","83":"gcc supports it","84":"then i could pipe it to | denoise | then to","85":"Where have you found it? It should be streaming2.pas in the package streams.","86":"I worked on that project for 1 week that too not full time the one I showed you... it's online, I wrote all the REST API services, it doesn't crash or hang...","87":"What did you try with Delphi? Declaring inline vars?","88":"that's the diference about static and dynamic linking","89":"Thank you in advance for your attention and help.","90":"IF I use that library the apps memory will grow over time. When you say Decimal should I set it on Windows ?","91":"Btw when you search for something in a dictionary, it will use hash, it does not compare the raw value","92":"```{$MACRO ON}\n{$IFDEF Windows}\n  {$DEFINE extdecl := stdcall}\n{$ELSE}\n  {$DEFINE extdecl := cdecl}\n{$ENDIF}```","93":"Nothing yet... I was wondering if anyone had tried it.","94":"ok thanks","95":"(you always have to select between fast, but low quality, or slow with high quality)","96":"can FPC be adapted for 8 bit machines?  for example C64, MSX, Spectrum","97":"no, there is MUCH bigger advantage, you see, terminal traditionally does not support grich media other than ASCI art","98":"modulaneme.functionname","99":"When you try to load a website but get an error message, don't trust the message to fast. Sometimes you can reload and will get a correct response. Then the problem is sometimes, that the web browser disconnected to early because it was made for a shorter response time. If it is not possible to control the response time in the user settings, it is a bad browser and should be replaced by something better. Usually a better browser is a newer browser with this required feature, because older browsers have missing other features.","100":"Can FPC compile Modula? Can I use Lazarus and all it's tools?","101":"wow :) first of all -  let's go back to suvey we started with.","102":"I've been working for ages on my top down game and made a new, quick beta release today. so if anybody can test it and give some feedback, i will be much grateful (Game is currently compiled for win32): \nhttps:\/\/www.pascalgamedevelopment.com\/showthread.php?5442-Top-Down-City-Topic-Reboot&p=149403&viewfull=1#post149403","103":"Not fpc dialect","104":"The other two people are willing to learn with Amit so I guess it’ll be good keeping my 🤞.","105":"Just starting. It includes some very powerful libraries for PDF, JSON, JWT, WebSockets, direct DB access, REST, and many more stuff. Then there is the ORM, wich is wonderful, but just if you want to use an ORM","106":"Not Alİ","107":"Yes. It's fast for me too","108":"`function ISO639_1ToLangName(const aLangCode: String): String;\nvar\n  i: Integer;\nbegin\n  i:=AnsiIndexStr(aLangCode, ['ru', 'en', 'de', 'es', 'fr', 'ar', 'zh', 'be', 'he', 'it', 'kk', 'pt', 'uk', 'tg']);\n  case i of\n    0: Result:='Russian';\n    1: Result:='English';\n    2: Result:='GermanNewSpelling';             { TODO : GermanNewSpelling 2 German }\n    3: Result:='SpanishModernSort';\n    4: Result:='French';\n    5: Result:='Arabic';\n    6: Result:='Chinese';\n    7: Result:='Belarusian';\n    8: Result:='Hebrew';\n    9: Result:='Italian';\n    10: Result:='Kazakh';\n    11: Result:='Portuguese';\n    12: Result:='Ukrainian';\n    13: Result:='Tajik';\n  else\n    Result:=EmptyStr;\n  end;\nend;\n` and this )","109":"hahaha","110":"for push the password","111":"sure, I use interfaces it's not a class","112":"But a lot of generic stuff there as well, liek the atuProcess","113":"Yep.","114":"http:\/\/www.pascal-central.com\/macp2.html","115":"1. This is all out of place. Has nothing to do with the problem\n2. And in any case, what YOU wrote is incorrect. Are you confusing Pascal with PHP or JS","116":"resolve ..add new method  `jForm.Asset_Exists (filename)`","117":"except mobile i prefer it over delphi","118":"Is there a quick way to create and record many variables (99) of a form ???","119":"What is different https:\/\/github.com\/fluisgirardi\/pascalscada from https:\/\/github.com\/fluisgirardi\/pascalscada_v0?","120":"If you're doing a small library \/utility type of thing, then you might care about binary size. But just using  fpc's classes unit adds about 140kB, so taking just a specific part of it might help keep the size down","121":"why i can't get value in \"IItem(List[i]);\"","122":"But since my small lib does not use API, but various unofficial features, I have to change and add something from time to time. I thought if someone wants to work with instagram as well, I thought to put this class to work together. But not yet sure of the feasibility","123":"these are global packages right — all projects share the same version? or you can pick a specific version for any project? From quick glance it seems like the former","124":"But I have not yet programmed applications for mobile devices","125":"register that, sounds good","126":"INSERT INTO Table2 (id, data) SELECT t1.id, t1.data FROM Table1 t1 LEFT JOIN Table2 t2 ON t1.id = t2.id WHERE t2.id IS NULL;","127":"yes is a abstract example","128":"There are some. IIRC RemObjects has one, which is used with some changes by Smart Mobile Studio.","129":"at least, coz trunk have (teoretically) better debugger and less some old bugs and missing language\/lib features","130":"Sorry, there is no time at me for researching of your code. Maybe is better to run with more simple examples with this framework?","131":"Then become part of the government 😂","132":"you can store your custom components into a XML for example and draw it in runtime","133":"That's a bit of magic from LCL here... Basically all frame components are wired into owners form, so all components are referenced into","134":"isn't it slightly slow starts?","135":"Hi guys! Can you send me chats and job search channels?","136":"Can You send me the code?","137":"Firemonkey is a good option too but is like xamarin native apps but framework is very heavy","138":"Fatal: Cannot find LibC used by SysUtilsAdds.","139":"1. you could try to use some virtual terminal in your program, for example gnomes libVTE library","140":"so boring to adopt program from single object\/window to many objects\/tabs :(","141":"but I don't know a combo with two columns","142":"yep","143":"https:\/\/github.com\/Al-Muhandis\/fp-telegram https:\/\/github.com\/Al-Muhandis\/brook-telegram","144":"I can do your work but not for free","145":"Thanks. I'll need it on Linux. I guess I'll just make a simple delay first","146":"Cut off the interferences of Apache + PHP versions, that in some cases I can't control without undesirable results...","147":"Haha I am asking a question lol. Afrikaans dude and a Spanish dude speaking English","148":"You are deleting an Runprogram object even though it has not finished","149":"and if those are points then may be switch to mobile might be much simpler for lazarus than we expect.","150":"and you cannot edit the code outside","151":"i saw your sample got full arduino hmi also right?","152":"We are already paying for VS but they wanted to make application for Windows, Linux, Mac ... problem is VS supports Windows and using GTK you can program Linux but not Mac, Delphi was a good choice... so was Electron...","153":"Hi. I solved the problem. The problem was in the `ParentColor` property on the form","154":"+++","155":"in your program?","156":"basical is a auto redial app type","157":"Merry Christmas","158":"yeah! and soldat too","159":"\"Issues\" part of gitlab have not and patch to restore Win7 FPC compatibility. Why it not implemented yet? Not so comfortable  to use trunk with this problem on Win7","160":"Hello there. Am new here! 😄","161":"but no module exists there","162":"With vscode","163":"I'm doing some retro programming and don't have 32bit trunk at hand. I only wanted to quickly test one compression unit, without much setup","164":"Yes, a time of research, and a time of work, all still very new, will undergo improvements","165":"Hi. How do I add Titles to the fix row in a string grid? I know how to add to the Coloum at the top","166":"how to build forms to be dll ?","167":"I don't know if this will be done automatically. But you had to configure your project manually to point to your target library folder...","168":"https:\/\/www.c64-wiki.com\/wiki\/Pascal","169":"I'm sure","170":"Compile package lzchatgptwizard 1.0: Exit code 1, Errors: 8\nuconsts.pas(11,23) Error: Identifier not found \"WM_USER\"\nuconsts.pas(11,37) Error: Illegal expression\nuconsts.pas(12,25) Error: Identifier not found \"WM_USER\"\nuconsts.pas(12,39) Error: Illegal expression\nuconsts.pas(13,34) Error: Identifier not found \"WM_USER\"\nuconsts.pas(13,48) Error: Illegal expression\nuconsts.pas(14,31) Error: Identifier not found \"WM_USER\"\nuconsts.pas(14,45) Error: Illegal expression","171":"how to make an alert when the exit button is run","172":"two times failied","173":"*sigh*","174":"why not? imagine you have an interface with some methods that have to be implemented, and you define a base class that implements the 90% of the contract on that class but declare one method as virtual (10% remaining) that you can override it using another class.\n\nFollowing code would make it clear :\n\n```Interface :\n\ntype\n  IFoo = interface\n    procedure Bar;\n    procedure Bar2;\n  end;\n\nAbstract class :\n\ntype \n  TBaseFoo = class(TInterfacedObject, IFoo)\n  public\n    procedure Bar;\n    procedure Bar2; virtual; abstract;\n  end;\n\nOverride class :\n\ntype\n  TChildFoo = class(TBaseFoo)\n  public\n    procedure Bar2; override;\n  end;```","175":"I don't understand what to do","176":"","177":"Another way to improve my English","178":"Thanks","179":"MyForm := TForm.CreateNew;","180":"i think what C does is it checks if 5 * sizeof(int) is contigous in that ptr. but what you say is a ptr to the first element. 🤔","181":"what are the properties of the person we need to process? Height and weight?","182":"nice to meet you","183":"that what i am working on, Aria2c is good, but it failed for some magnet included mine, it kinda bug in it","184":"(omg i am running an arm lazarus from chroot!)","185":"Because we have devices on field and the software has to scan all the IP address and detect the devices.","186":"That you should at least verify if it is true or if it works before reposting them","187":"I'll try start using THTTPApplication","188":"You can also use cdecl. Afaik, fastcall is compiler specific.","189":"By the way, there is a ready-made function in the `fp-telegram` for markup isolation  `MarkdownEscape` (`tgutils` unit)","190":"https:\/\/github.com\/dieletro\/tinjectlaz\nPublic github.\nNow we have the support of the Lazarus guys to see if this project comes out ...\n\nWe need support to be able to bring this project to Lazarus\n\nThis is TInject for whatsapp","191":"and SO as well as TIOBE index maintainers spoke...","192":"Okay... whatever you said here is beyond my limited understanding lol","193":"Oh, well, the problem was in me. I was pushing buttons not in the console, but in generated window. Stupid me","194":"For minor version","195":"https:\/\/github.com\/xor-el","196":"THanks. I try","197":"and before, I like very much that language 'force' a good code structure, variables, interface, etc..","198":"Is Indy working for Linux?","199":"Is a bot, but has feelings.","200":"I like to work with interfaces, tdd, ioc...","201":"There were problems, but they are not related to **the design**, but rather to the fact that I was not able to properly test that","202":"detect small bugs, translate some text, write some examples for the rtl or packages. Such kind of things.","203":"thanks for answering","204":"Project options resources are empty","205":"","206":"I don't use it, can't say","207":"👍","208":"FreePascal and Delphi improved a lot","209":"maybe it's a chance to move to containers","210":"but I guess it depends very much on what aspects are you considering","211":"Ofcourse the application wouldn't work in Nextion.","212":"sorry 3.2.0","213":"\/info method","214":"That is nonanonymous?","215":"i am not a globalist probably. (:","216":"Of course.. \nYou said that t2 and t3 is detail for t1, right? \n\nSo, t1, t2, t3 must be share foreign key.","217":"Here the average developer gets about $ 2000 a year. There are vacancies where about $ 10,000 a year is paid, but it's impossible to get there, I already tried, there it is necessary to bribe about $ 5000.","218":"I3-16Gb-SSD120-\/home(500Gb)- Mint TARA","219":"and purely because of the IDE","220":"damn! why so easy things not implemented normally? no closing icons emulation for pagecontrol under windows, no \"RowSelected\" property or normal row deleting for stringgrid? WHY?!","221":"Is there anything for Fourier Transform and Wave noise filtering in Lazarus?","222":"Parallel is similar and compatible with TaskPools... TaskPools is basically an orchestrator for structured parallel work, look it like an automated \n```TObjectList<TTask>``` that it calls to every ```TTask.Run```","223":"Wow... simply wow... I tried making 4 applications for doing something very simple.","224":"Настройки or command \/settings","225":"sure. but as i said, i uses cycles usually (almost the same, just source little larger)","226":"so you was not joking.","227":"anonymous functions and closures is the same thing. at least in Dephi","228":"Last time i used it in the past, it had paw on the logo","229":"aaa coool","230":"By the way guys you told me lots of classes for WebSocket and actually 0 worker, they didn't compile or didn't for some reason... wasn't supported proper, I don't think WebSocket is that complex... seems like I have to make a component myself.","231":"Until I not decided what kind of group it will be (English, bilingual or multi-lingual). Those who have suggestions for development are welcome to the group","232":"So, there is a model and a data buffer.\nThe user works with the data buffer. This is a copy of the model in memory. If the user saves the data, they are written to the main model.\n\nIn fact, this is a pattern of \"intermediary\".\n\nBut there are difficulties with OOP.\nHere is an example code, look:","233":"here is my github https:\/\/github.com\/turric4n","234":"*cast","235":"ummm...","236":"exec ( string $command [, array &$output [, int &$return_var ]] ) : string","237":"No","238":"i hv a video but in chinese","239":"Shanghai","240":"@fimkold where is your updated mpeg decoder? https:\/\/sourceforge.net\/projects\/delphimpeg\/ ?","241":"https:\/\/github.com\/newpascalfpcupdeluxe\/releases\/tagv1.6.1g","242":"anyway if you need to use TResourceFile you need to open a bug into Mantis","243":"As for the fp-telegram, I haven't started the project yet, but I'm thinking of following the same line as TelegAPI, but as you are already on the circuit, I'll take this idea away, but I make myself available whatever it takes","244":"Aaa OK yes then that should work. Now to find a good threadpool unit that will work on FPC","245":"but i compiling lazarus by latest fpc trunk","246":"A computer with Ubuntu is weak... But ...","247":"I started going RAD with D1; but I'm intrigued with your statement","248":"still the same error","249":"event focused on Brazil","250":"you can use JCL:\nhttps:\/\/wiki.delphi-jedi.org\/wiki\/JCL_Help:Unicode.TWideStringList","251":"I use fpcupdeluxe and yes, it is a really useful tool","252":"http:\/\/s40in.blogspot.com\/?m=1","253":"Hi! There is a native web server on FreePascal wiki.freepascal.org\/fcl-web . There are enough frameworks others. For example, brook framework (not sure if it can be embedded in a desktop application because It uses the TApplication heir). And @Turrican has its own web server [framework](https:\/\/github.com\/turric4n\/TNs_HTTPRestFramework\/)  .","254":"Cool","255":"you need to load page and run the javascript inside at the same context","256":"you can learn new pascal with this guide","257":"Make learning by doing 😉","258":"The new problem after the change is that Linux and Mac OS can be normal. Windows needs to generate some events on the form (for example, moving inside the form) to change the interface normally.","259":"There, I guess Delphi RAD really shines and is able to kill anything else","260":"Dear manager wishes success in my \"Micro Servos\" work. No more obstacles. 😊","261":"Yup, use it at work for automation","262":"on FPC 3.0.4 :(","263":"but not delphi least","264":"If you are talking about custom attributes, it wasn't released yet...","265":"yes","266":"but the power of this framework make you powerful and it can compete with other languages and frameworks","267":"Hi guys do you know if free pascal compiler support extended syntax for pointers ?","268":"👀👀","269":"hahaha.","270":"Aaa OK so if I wait till 2.2.0 then what I build in 2.1.0 should work?","271":"good that double commander has that.","272":"Или бл, руссукие есть?😃","273":"But it is also a very big project .... very hard to import i think.","274":"i guess there is a russian language pascal chat.","275":"It is a good idea - server terminal via telegram )","276":"Can someone help me with this program?  I can't use arrays The program will ask the user for the number of ships to sink.  Then the program will randomly activate a series of variables that represent the ships on the game board.  For example, if the user enters 3 ships on the screen, then the program will initialize three variables that simulate the 3 ships entered by the user.  Once the board is initialized, the player will be asked the position where he wants to place the bomb to sink one of the positioned ships.  The way to simulate the keyboard will be to use a set of 6 Boolean variables that will be activated randomly by the program.  Player board size (6).  Each time the user inserts a position, it will be checked whether the inserted position sinks a ship.  In case of success, the message “Ship sunk!” Will be displayed on the screen.  and that position will be marked with an X;  otherwise it will be marked with a 0 and the message “Water!” will be displayed.  The game will end when all the ships are sunk.","277":"Well, I would expand Brazil to the whole of South America. There are other countries in Latin America in the group","278":"how to execute command linux in lazaru examples sudo cat unit1.pas > \/dev\/usb\/lp1","279":"Bro @Fabio_PascalSCADA , i couldnt find any pascalscada hmi pallete? Just opened sample rtu corn weigh, got error on hmianimation unit, i got unit inside src\/hmi\/ but the project cannot find it, tried reinstalling hmi -> got no luck :)","280":"I do not know what TMethod is, but my guess is that you need to create it first before working with it, just a guess","281":"unfortunately in the FAQ they say they have no plans to port it to other systems \n\n**Question:\n**```Will the player be ported to another operating systems (Unix-like, Linux, Mac OS)?\n\n```**Answer:\n**`AIMP for Android you can download in Google Play.\nWe do not plan to port AIMP to other systems.\nYou can try to use Wine to run it under the Linux and some other Unix-like operating systems.`","282":"yes decoder is not play, but if you can make a pcm output maybe exist native pascal library to play it?","283":"There will be two Indians )","284":"It's optional feature","285":"yes, with setExceptionMask([]);","286":"Matter of habit. I'm used to a different ORM, template engines, and HTTP servers. But I've heard that mormot powerful tool. There are definitely people here who used it","287":"But at me manually something is impossible with lazarus 1.8","288":"https:\/\/forum.lazarus.freepascal.org\/index.php?topic=16665.0","289":"Ah that's neat so I can make Mac Applications without XCode, cool thanks.","290":"otherwise we'll not have a community in 10 or 20 years.","291":"There is 3 methods:\n(1) From repository, I dont recomend that 'cause you will need to change chown\/chmod files.\n(2) Using fpcupdeluge, easy and not erratic way:\nhttps:\/\/gladiston.github.io\/hello_lazarus\/instalacao_linux_fpcupdeluge.html\n(3) Using git and compile by yourself, it´s good to learning:\nhttps:\/\/gladiston.github.io\/hello_lazarus\/instalacao_linux_git.html\nUsing 2 ou 3, I prefer install fpc from repository before install lazarus, it´s more fastest.","292":"👍","293":"i'm with ubuntu 22.04","294":"@Turrican will surely be able to contribute a lot once i finally swnd him ubuntu phone","295":"how can you know if you haven't seen the code ;)","296":"mysql command does that as well","297":"Any time!","298":"tool palette is overrated :)","299":"I am sure that it will replace with '?'","300":"because you should not do non-gui data processing within the lock","301":"that's not an error. \nIt's just the compiler warning you that you didn't  set any data to that var. So, if you try to read you may get some memory garbage ,,,","302":"Yeah but I'm into embedded systems where I can't afford REST as it is slower.","303":"you will not fail","304":"just a sidenote, it is pretty awesome about this group, that every now and then someone pitches up an arbitrary term or key word, and I learn a new, unlknown before, thing for Object Pascal","305":"why i can recompile Lazarus by \"make clean bigide\" but can't use \"useride\" by this way?!","306":"English :) But my answer is NOT Data Aware","307":"Can someone help me with a small request. I need to save the source code of a webpage after javascript is processed on that page. I managed to compile and use fpCEF\/CEF, but I have no idea how to get it to save code, there's no straightforward procedure for that. Can anyone help with this or some other method?","308":"Hi;\nIs there a database Tree view component that we can use in Lazarus?","309":"Hi Junior Filho!","310":"What is this? :\/","311":"also, using TThreadList does the same thing in the end","312":"Tab1 is Frame 1 and Tab2 is Frame2","313":"found it nvm","314":"English, please","315":"yeah i found it thanks 👍","316":"some mocking and IoC frameworks would be great on fpc anyway","317":"it cos i saw in source\n```function TRawbyteSearchRec.GetTimeStamp: TDateTime;\nbegin\n{$if declared(FindDataTimeToDateTime)}\n  if not FindDataTimeToDateTime(FindData.ftLastWriteTime, Result) then\n{$endif}\n    Result := FileDateToDateTime(Time);\nend;```","318":"I'm doing libraries too :P","319":"","320":"Normally in other rooms I'm the oldest person... I think here I might be on the younger side lol","321":"yep","322":"Tprocess is an option but but i refer to something callable as a function.\nJurasicPork user created some similar years ago but now that wmic is deprecated and powershell way is the recommended method...\nHow can be called a powershell cmdlet using TProcess?\nAs it need admin rights i see it complicated.","323":"https:\/\/www.googleadservices.com\/pagead\/aclk?sa=L&ai=DChcSEwjRveaA0bvfAhV2KNMKHYcUAdMYABAEGgJ3Yg&agsac=8lZCuBm9EVQ&ohost=www.google.com&cid=CAESEeD2j7538BD3BR54aMJIkiqI&sig=AOD64_1IMp6x5wlIrT1o2cBc20XzVmxOHg&ctype=5&q=&ved=0ahUKEwjf3t2A0bvfAhVPxIUKHeWAApwQwg8IEg&adurl=&ms=CoACAGc0hvyJSJ2sSNdLa91Kh5K5a70w3d-1rhbFo2lZkb_SoF8zv_LZ_n5CTF_7X4r83MGcHPO9pu714mjjoV0pm3u7SNau58mqdSNbx1c8vEZnHkl2Vtpyu5KiocBUbGTdPcylAf9xZCjXCmVBHD8WQBFUo0mZa1L_VagEROI8GRuw7bAC9MGaZVVWesxd-1KliqyDQcyUJil0Gw0NXaheTNbXqhk2AXAMmBNE3uEAOit6jjbNEh3_zZ1sf6-BVABKoLv96YN_fh1zO76dK-FfWDGR8Ey6OAQLjQ-CLpo50xt3_RPETIHEvFko8GxV5aB-mmAJQAqPMrvdFXAFT2sk7xIQthcPY7jO7X-2okZTj93YWg","324":"ah, i think, signed\/unsigned value problem","325":"ReadFile.pas -> ReadFile.dpr?","326":"🤷‍♂️","327":"i delete lazarus (","328":"what about cross compilers for ARM? Could you please tell some more?","329":"Waw, Lazarus? ما شاء الله","330":"and gtk too","331":"I feared it 😱😉","332":"nexus5 is one of few supportes devices check ubports.com","333":"?","334":"Luckily, telegram has just incorporated a new option in Settings-language to activate the translation button. Possibly the most useful in a long time,","335":"That's why Delphi is not popular today","336":"Yes, my bot is running in separate thread.","337":"(my question is not about fp but about pascal in general)","338":"Only SSH `top` command does not display... A pity. (\n```TERM environment variable not set.```","339":"Is there a way to get SELECT substring of KEYWORD? Like `MATCH` `*abcedf*`","340":"None of them have that class in .","341":"If there are ideas on changing the structure of the hierarchy of classes and their interaction, I would try to change something... Since the project at the beginning of development","342":"and direct conversion hh.mm float value to string?","343":"that's not the problem at all...","344":"Ex: '0positive;0negative;zero' would apply the 0positive mask to positive numbers, and so on","345":"good night! Did you receive this emai?  __\"Crowdfunding to speed up the development of pas2js in Lazarus Widgetset and fpDebug to FPC\"__ What do you think? \"","346":"What I love about this is it all runs on a Raspberry Pi. Little $30 computer that does all of this and more. The guards need to press a button on the touch screen every 30 min at night to stop them from sleeping. If they do not press the button I get the imge from the DVR and Telegram it to the control room.","347":"Haven't heard about idris nor used haskell. I find python to be quite handy at times when i need to do some quick text processing task","348":"Yes","349":"please be more concrete with your question","350":"butni had sth different in mind","351":"Cool, too bad can only partially understand","352":"🆒","353":"i am not sure if some work is already in process in that area","354":"every modern languaje","355":"Raudus already did it on 2009 😅","356":"Firebird 4.0 is close to be released","357":"yes i know a just make and example","358":"Tell me how I can interact with MS Access PascalABC.NET ? I think you can also throw an example on Lazarus if possible.\nI would also like to take values from the database or assign a new value to some field","359":"I will give you a program unit as an sample. Then you need to use the protocol of the new battery and modify the unit to work with the new battery. The communication is over rs232 serial but it is all in HEX values that you need to modify to get the decimal values.","360":"firebird3up, no?","361":"Console, embedded, gui apps","362":";)","363":"ah yes, that I have!","364":"into multiple binary files","365":"Do you mean delphi? Well, I think you can also add it. As a rule, it is adjacent to Lazarus. Specifically for delphi, there are similar lists somewhere, too","366":"With units everything is clear: if necessary, I will use conditional compilation","367":"thanks! I read it, and u derstood. I must agree with @gbakhtadze , but also I have another thought. This example illustrates an advantage in performance against a very specific case. And as far as I understand, it is a real improvement. But only in that specific case. To me it seems, that this specific code (which uses interface) could be coded differently, without the performance penalty. Interfaces are already higher level of abstractions which means that they are a tradeoff: easy, but with overhead.","368":"i can compile without problems... but I use Lazarus with FPC 3.1.1","369":"it's all showoff, best moments compressed into minutes of what my life does NOT look like for 99% of the time :P","370":"guys","371":"try Alcinoe components","372":"Yeah I know that is what I have to do, today 3 people came for interview, when I told them they will have to use pascal they said “what is pascal”.","373":"thanks for your help","374":"Yeah that is what I said... it's a good tool for hobbiests and amatures... it's not for professional use.","375":"maybe even Orca will get rebooted","376":"Yeah, but it'il be a big deal.","377":"We say: \"Hayırlı işler.\"","378":"Cool. Code says more than a thousand words! 😉","379":"good luck then","380":"GC is not smart enough in some cases, we have a big challenge with a script for copying files to webdav share from local storage with help of power shell","381":"But you are free to do whatever you want","382":"And datetime to string like:\n`sDateTime:=DateTimeToStr(aDateTime);`","383":"make a DTO class based on the service JSON responses and desirialize into Object using RTTI","384":"can we get an interface from the ppu file?","385":"then select that implementation from config with ```ITranslationServiceLocator```","386":"so you have the program main.exe running and then call it sef with some parameters","387":"Syntax.","388":"If \"free pascal\" would be \"free Delphi\" thats would be another history.","389":"Sorry itszso hard to me to type with on screen keyboard.","390":"Yes. I never tried.","391":"show","392":"Respect for those who write in Lazarus, it's so hard","393":"Ok, you start implementing the model TCustomer","394":"I think that should have their own widgetset, to concentrate efforts","395":"I use `+=`. But it is FreePascal style too. It is turned on by default in `ObjectPascal` syntax","396":"add new method to class","397":"I do SQLite3 encryption under mORMot. And mORMot is not complicated at all! I can teach us","398":"Something like this?\nif (C in ['A'..'Z']) or (C in ['a'..'z']) then ...","399":"So I'm in the right way...","400":"You could create a single custom control (instead of so many) that draws the whole image, loading the shapes from a SVG file (easy to parse for simple shapes, its a xml).","401":"You can build any combinations of Lazarus and FPC versions. For example, I have in addition to a stable Lazarus\/FPC branch there is a trunk Lazarus2.1.0\/FPC 3.3.1","402":"Usually that's called compiling or building, strange. Maybe a translation error... 🤷🏻‍♂.\n\nSince you IDE is called PascalABC.net, are the created exes fully independend or do they need a dotNet runtime environment for working?","403":"\/admin","404":"If you describe the behavior of list classes and You don't want classes... You are using the **Object** Pascal language","405":"ok found it : http:\/\/forum.lazarus-ide.org\/index.php?topic=31915.0","406":"Your client can send POST request which is written in lazarus.","407":"+1 to portuguese.","408":"\"getwinversion.lpr(9,20) Error: Incompatible types: got \"LongInt\" expected \"Pointer\"\"","409":"Hello! Programming is popular among electrical engineers ;)","410":"Of course","411":"Alternatively you can you use www.deepl.com","412":"More lighter n fast compilling than emb** did 😅","413":"Not only UWP","414":"How are you ?","415":"Stupid looking startup screen.","416":"Thanks, I'll take a look","417":"https:\/\/kriscode.blogspot.com\/2017\/11\/lazarus-on-arm-ubuntu.html","418":"But in some critical situations, it seems that the default value does not work. As an example with threads (more than 100 did not run), when I set the stack size","419":"there aren't many developers because project devops are outdated... A GitHub repository for example with pull requests flowing is the way to go (IMHO)","420":"why to bother? compiling in wine is straightforward","421":"16 January 2020 14: 44  \nA collaboration protocol signed between the Ministry of education and the information and Technology group (BTG) will allow the Embarcadero Delphi software development program to provide free access to one million students in more than 1600 vocational and technical schools affiliated to the Ministry.  \n \nKemal Varın Numanoğlu, general manager of vocational and Technical Education, stated that they care to educate students in vocational education by having the most advanced skills needed by the labour market in national and international platforms and to carry out all education processes in close cooperation with the sector.\n \nNumanoğlu stated that they continue their work within this framework and stated that the world has become digitized and that the importance of the software sector is constantly increasing.\n \nNumanoğlu stated that new and different job opportunities were born every day in this sector and stated that they wanted to train students who were able to master information technologies and capture the age.\n \nIn this context, BTG General Manager Sefa Akbaş and BTG company founder Yücel Tepeköy signed a protocol between the Ministry and BTG stated Numanoğlu, \"with the protocol, we will introduce our students to Embarcadero Delphi software. With this technology support provided to students, an important contribution will be made to improve the quality of vocational education., \"he said.","422":"do you need confirmation that the thread is dead?","423":"we need to promote Pascal game area :)","424":"Anyway above code smells","425":"What should we replace \"İ\"?","426":"here we only work","427":"I did very nice server clients with firemonkey","428":"","429":"We can make a youtube channel","430":"Imagine Lazarus people working with Delphi people, that's would be Lazphi product... OpenSource + MultiPlatform + Free","431":"Well, if I do: dotnet core calls lazarus directly through the shell ...","432":"when you say \"pointer is 32 bit on one platform and 64 on another\" then you are talking abt pointer","433":"I'll find the link, one moment","434":"Thank you","435":"use sockets to stablish a connection with a SMTP server and send commands to it basically","436":"Thanks for your replay...I will try to cross compile to  Linux from Windows","437":"to enclose the selection with (), lazarus needs a editor macro...","438":"also, this bug happens for me in Mate, but not in Unity","439":"usually a developer provides full package","440":"And even with English can be done so\nFor example:\n```resourcestrings\n   s_trees2=trees2;\n   s_trees3=trees3;\n...```","441":"No need. Your actions is putting inside GET and POST procedure in the Brook Action. Or You can use Reqeust procedure (Get and Post is embeds in the request procedure). So all errors is catched in one place... **But it is bad practice**","442":"No i havent, i will check that also !!","443":"+1","444":"not design time...","445":"yup","446":"acknowledge","447":"For CRUD DB operations for non-visual is best to use ORM libs","448":"I won't distract you any further then :)","449":"There are some vectorized functions that you can skip, so its under ~ 1500loc. I don't have the pascal code at hand, but i think it was twice as much or more","450":"Bale hermano, lo tienes !!\nAnd you even got some kind of image edit, KEWL !!!","451":"awesome, would you be willing to provide me with (I guess you must have it ready on your computer) minimal example of that?","452":"😂😂","453":"today I was showing my students how pascal is able to resolve module dependencies, and C cannot, thus it needs makefiles: https:\/\/github.com\/operating-systems-2018\/notes\/tree\/master\/12\/make","454":"for example, I have an ERP coded in Delphi 7","455":"but if it is not completely rewritten, then I would assume so","456":"mov %sp, %fp","457":"C++ and C# aren't much different...","458":"also is possible to add autogeneration to the field, it depends on conditions","459":"","460":"ah, found it at another place too...","461":"I've seen that wiki page is a bit outdated. To download you should go to SourceForge:\nhttps:\/\/sourceforge.net\/projects\/synalist\/","462":"calling int 0x80","463":"Thank you","464":"what do you mean?","465":"Hi laz team ... My problem is how i can make the rows data as column in fastreport or qr?","466":"this I don't know. Maybe the some bug got fixed ;)","467":"I don't use LCL","468":"Or I must install GTK 2 in Debian web server? :)","469":"Win10","470":"awesome project","471":"it's a PlainPascal+","472":"anyways, we can summarize all points of view like this:\nthere are considerations against putting more then absolute minimum of code inside an except section. However if you must do it, it's supported.","473":"I don't need to use gui at all","474":"🥳","475":"This will launch a new X server on \"socket\" :10 that emulates a 1024x768 screen","476":"that the problem what we don't have enough documentation\/examples for these things :(","477":"Maybe it has a fixed version","478":"Yes, but i can’t create an app that work without lazarus","479":"with more ads and groups like this to make this awesome language more popular","480":"pt-br👆","481":"👍","482":"and how do I enable a scroll box to download while editing?","483":"I used this technique to do binary things (using my custom game map editor)","484":"Yes, for example, I use svn for working with github service... But nonetheless","485":"i'd like to watch this","486":"success om","487":"Or here","488":"maybe you can follow mORMot implementation","489":"ARM compiler code is quite fast with FASTMATH enabled","490":"What drop down?","491":"Not on bare tcp, that is","492":"Delphi High Performance","493":"Despite my nick 😀","494":"feel free to do it, but take care about education","495":"pretty-much ok","496":"then you don't need sudo at all","497":"No I'm making the design for Nextion LCD display but it accepts png as background, I wanted to make it look like an application, I could add click areas and stuff, but looks is the main thing.","498":"im trying to replace sdl2 code for opengl + openal","499":"Why do I need IDE \"fpc + lazarus\" ?? Why not fpc only?","500":"no idea, if you share a code with me I can test it for you","501":"I'm receiving from Google translator a string with non utf8 characters","502":"Does'nt lazarus have package manager which resolves dependencies?","503":"Can You add me as contributor?","504":"works awesome","505":"wine just recently released stable version 3.0, pretty amazing","506":"Yes","507":"think that interfaces means C header while implementation means like a C source, but both at the same file.","508":"is possible use ttrayicon without lazarus ? , i need use with fcl-web aplication , to call my aplication only","509":"and back:\n```procedure TForm2.SetSearchLostStatus(const Params: string);\nvar\n s: string;\n X: ISuperObject;\nbegin\n X := TSuperObject.ParseString(PChar(Params), True);\n FNowSearchForFile := not X.B['NowSearchForFile'];\n FLastLostFile := X.S['LastLostFile'];\n FNowSearchForRec := X.B['NowSearchForRec'];\n FLostRecProgress := X.I['LostRecProgress'];\nend;```","510":"up","511":"Try TQueue\nhttps:\/\/docwiki.embarcadero.com\/Libraries\/Sydney\/en\/System.Generics.Collections","512":"Websocket will make the daemon life easier.","513":"'Exit' is an antipattern to make pascal look like C 😁","514":"this example 2 years to reject patch https:\/\/bugs.freepascal.org\/view.php?id=30735","515":"Is there any component to display iOS like buttons?","516":"Also it depends on the needs","517":"i love fpc, i think it is an amazing compiler. i use it since early versions, since 2001.","518":"Imho, the advantage of Delphi vs Lazarus is the creation of components","519":"Via binding.\n\nhttps:\/\/wiki.lazarus.freepascal.org\/H2Pas\n\nhttps:\/\/wiki.lazarus.freepascal.org\/Creating_bindings_for_C_libraries","520":"LazReport seems to run on Raspberry Pi. I just installed it last night. Will play with it at some stage to see what I can build using it.","521":"","522":"i use FAR manager and it's editor usually","523":"it's not mine actually, no idea how I stumbled upon it. It's a delphi translation of some old c code for mp3 decoder","524":"The main disadvantage in the lazarus is debugging","525":"you want icons?","526":"I'm still looking but at least my project was a success.","527":"Debug is possible","528":"I was looking at nehe's tutorials","529":"Look frankly speaking, compilers for Delphi and Lazarus are very robust and compile code really fast, they also make code highly optimized that it runs much faster than C# or any garbage microsoft throws out.\n\nDelphi and Lazarus are better than other \"free\" tools like NodeJS, Kotlin and surely faster and better than Java.","530":"Hy guys...\nRESTRequest4Delphi it's now compatible with Lazarus!!!","531":"","532":"because are on the root files","533":"","534":"But this is not our way. The best is use OOP or frame or datamodule or any other programming template. Write one use anywhere )","535":"Have no clue why it doesn't work, sorry","536":"so apk mostly are not native, even though they are official, supportedm, shipped by vendors","537":"I have trunk working on Windows and Raspbian","538":"i read a news that the most big site of store this roms are close or not share it more","539":"https:\/\/firebirdsql.org\/en\/connectivity\/\nAccording to that section there are also Firebird drivers for Java, .NET, Python, PHP and common ODBC","540":"I don't understand if you are kidding me or are you serious? 😂😂","541":"You stubbornly ignore my requests","542":"no problem! nice clarification","543":"Try using WinCPToUTF8\/UTF8ToWinCP for valid encoding","544":"How to .access and control relay from  delphi use udp protocol ?","545":"I'm not happy but","546":"I do not use 5.0. 4.0 with legacy. I leave a back door without the use of __sagui__","547":"And unfortunately it is NOT like riding bike..","548":"Lol can't the applications I have are only available on Bindows...","549":"thanks👍","550":"I checked in all 3 files I could find on my Pi","551":"Connect it to your raspberry using serial interface (UART)","552":"https:\/\/github.com\/LongDirtyAnimAlf\/fpcupdeluxe\/releases\/download\/1.6.8k\/fpcupdeluxe-x86_64-linux","553":"Thanks a lot","554":"I've been working in Ukraine for 5 years and have some friends from Russia.","555":"Thanks","556":"which never was published.","557":"Hi Alan!","558":"i remember, some ppl asked for this ability in past. maybe something changed","559":"And to work in Git's flow with SVN repos","560":"https:\/\/wiki.freepascal.org\/RXfpc","561":"anyway, I don't know if helpers are planned for objects","562":"indeed","563":"https:\/\/github.com\/risoflora\/libsagui\/releases is not what you search?","564":"ifthem? 😂😂\n\nI don't know how to do that using format functions","565":"https:\/\/pastebin.com\/kYFzD2HP","566":"It’s seems too complicated to me. I remember I got some experience with my bridge Skype - GSM. That time I used stream between threads successfully. I been sending audio data both directions  from Skype to GSM modem and back. But now I probably too tired and become lazy. Finally I don’t have really fast process here. So I wrote everything in main thread. Now it’s easy to continue. All I needed is just send picture from Chart. Rest tasks, such select time range for chart looks not complicated. I will back to multi threads later, when I really need it. Thank you guys for trying to help me!","567":"lots of effort into the technology of the hardware, but the software for it, is bare metal.","568":"What Linux do you use?","569":"Yeah but the language, that isn't much different.","570":"does fpc have a latex report generator?","571":"","572":"Nice, got any conplaints or ideas?","573":"The game I coded in the machine codes of  \"life\" and sokoban","574":"It has been two years, using japanese gont.","575":"@Turrican how did you come to pascal?","576":"You can take a look at fcl-stl source code, pascal is the only language you can read source like reading prose 😊\n\nhttps:\/\/github.com\/graemeg\/freepascal\/tree\/master\/packages\/fcl-stl\/src","577":"@Tazmikar: Look for JEDI components. Most them are Lazarus compatible and includes network components. Also the Synapse library, a bit old (I'm not sure if it's active) but covers a lot of network protocols and it's very easy to expand. (I want to put links but Xperia doesn't allow to paste text here [WTF?] but you'll find them easily in Lazarus wiki)","578":"for example : \n\nPseudoC Style\n\n```function getPayAmount() {\n  let result;\n  if (isDead)\n    result = deadAmount();\n  else {\n    if (isSeparated)\n      result = separatedAmount();\n    else {\n      if (isRetired)\n        result = retiredAmount();\n      else\n        result = normalPayAmount();\n    }\n  }\n  return result;\n}\n\n```into : \n\n```function getPayAmount() {\n  if (isDead) return deadAmount();\n  if (isSeparated) return separatedAmount();\n  if (isRetired) return retiredAmount();\n  return normalPayAmount();\n}```","579":"No internet. Just free or neighbors wifi on phone, too uncomfortable","580":"could you add a fps counter?","581":"buenas José, bienvenido","582":"sailfish sdk","583":"1st - initial download repo\n2-st update\n3- commiting your changes","584":"I have this:\nLearn to Program using Lazarus (Howard Page-Clark)","585":"Ok. So... OpenDocument is key string for YOu )","586":"we doesn't use fmx, sorry, but I don't like it too","587":"Yes. variant integer phisically not all integer","588":"only english one. I doubt that turkish \"i\" is in ascii table","589":"lol","590":"and I have lastest Delphi version. FPC is very outdated compared but it's improving","591":"yep, in our company, when you close the program which is written in c++, it frees memory and instances of objects for long time, before shutting down. with garbage collector in separate thread it would not be a problem.","592":"is not really hard to install see the tutorial in the website","593":"You saw the Linux port of Firemonkey that a 3rd party company did? They sell it, and it shows, that actually, with enough work, Firemonkey could land in Lazarus as well","594":"We need to unify","595":"I'm rewriting the API; the way it works now is that you create a descendant of TOBuffer class, pass that to the decoder and the decoder pushes decoded samples through Append; I don't like that at all","596":"Se","597":"Happy digging","598":"Its what i expected, Inc generating a single faster instruction than add instruction","599":"Oh no,  I made the group stats worse","600":"of course","601":"BTW the last fpc revision that worked for me is r42041","602":"just tell her that is IMGUI :D","603":"Could be","604":"But as long as it works - it's good enough","605":"Hi guys, why idea why if I use no right or left  anchors on some displays me control on form shifts or moves more left than it needs to be?\nI mean if I place Tpanel on form center and disable anchors left and right. It will start there no matter what.\nBut on some displays its moves right.","606":"Hi! You are clearly not ready for such a development of such functionality. Start by developing HelloWorld apps. Read at least a couple of books on Pascal syntax and go to development in Lazarus IDE","607":"Does GitLab have a SVN wrapper too?","608":"gaming is bloat","609":"You can use `Ctrl+Shift+M` for the code in telegram","610":"I won't talk to you anymore! :D","611":"the people don't know that you can't published crypto things on programmer groups 🤦🏻‍♂️","612":"I don't know how optimize your code. I don't know your requirements.","613":"Observer pattern","614":"","615":"Indeed... Last delphi versions improved a lot...","616":"today windows is safer than the past","617":"Until recently I wrote apps for production \/ testing of electrical components. For the future it will be an app for commercial communications","618":"5ghz","619":"Yes","620":"That's the same thing on Delphi, you can use Indy 10 HttpClient with SSL\/TLS support using OpenSSL libraries (libeay and ssleay). But lastest versions include native WinHttp client (THttpClient) doesn't need external libs to work with SSL and is 10x faster.","621":"user subscribes to our bot","622":"i can understand that.","623":"Gof patterns","624":"https:\/\/english.corchado.net\/2023\/04\/05\/salamanca-to-host-the-first-international-congress-on-pascal-programming-languages\/","625":"I use Greenshot...","626":"In my company 200 servers ... 80% Windows Server - 20% Linux Servers","627":"So I declare it as a Global. Do a init on it and then push and pull","628":"[Off PT-BR]","629":"another thing I want to share, you seem to spawn thread every time you click a button. Once you have more threads running than you have cores on your system, you don't gain anything in terms of parallel processing any more. You may even be trhottling and loosing performance. That is why a thread pool would be better, to limit number of threads to the number of cores (including the main thread), and processing jobs in FIFO queue","630":"Is this written with Lazarus IDE?","631":"CMem is not mandatory","632":"have you been working that way as well?","633":"no problem, here is a C to Pascal converter https:\/\/github.com\/WouterVanNifterick\/C-To-Delphi","634":"(target -> 8086) (OS -> DOS)","635":"Yeah! Now explained!!!","636":"let me guess... is a DBWare combo?","637":"If I want to use this native dynamic libraries from another languaje","638":"Absolutely, I have the same opinion. It's as if there's a case of turning object names into uppercase, then lowercase ...","639":"Largest but not the best )","640":"#1 = https:\/\/gitlab.com\/freepascal.org\/lazarus\/fresnel","641":"Who else can help me with this? https:\/\/forum.lazarus.freepascal.org\/index.php\/topic,52507.0.html","642":"","643":"au files","644":"maybe it is not dollar or euro  :)","645":"Android Tablet SUCKS","646":":)","647":"and something from embarcadero","648":"REST","649":"\/results@PollBot","650":"and i am interested in design.","651":"??? ) How?","652":"I am from Astrakah, Russia. And so in this chat people from different countries: Latin America, Europe, Russia, Сentral Asia, Southeast Asia and others","653":"I am from brazil","654":"Delphi now have community version. If your annual salary is below 5k USD then you can download delphi community for free. And its full featured delphi. I think its a good initiative. but I'll stick with freepascal because it can run natively on many platforms. Delphi can compile to linux, osx, windows and android, but Delphi itself is windows only.","655":"Yes. mORMot is in the OPM","656":"Yes...","657":"Is there any way to convert Lazarus project to Delphi?","658":"I like material design but I don't disagree with another designs at all","659":"basically to keep partial views outside of the main forms","660":"btw, if you didn't see:\nDatabase Explorer plugin for Lazarus\nhttps:\/\/forum.lazarus.freepascal.org\/index.php\/topic,52595.0.html","661":"Because I can use AI Bot called \"Co-Pilot\" it really helps code much faster.","662":"also https:\/\/en.wikipedia.org\/wiki\/Comparison_of_Pascal_and_Delphi","663":"The same thing can say about DI and why FP\/Delphi don't have that funtionality implemented natively","664":"What serivice type of module? `Simple` or `forking`?","665":"why lazarus don't has a similar thread lock and unlock function?just like:\n```","666":"Why I like Delphi for serious Windows work ...\n\n1. Awesome Windows API implementation\n2. Vcl and fmx\n3. RTTI makes possible things like Spring4D (GoF patterns)\n4. Generics\n5. Syntax\n6. Everyday closer to C# (code)\n7. Tooling\n\nThings I like about FPC.\n1. Work great on Linux\n2. Platforms and cpu targets\n3. Is compatible with average delphi.\n\nThings i don't like about Delphi\n1. Not free\n2. Bad community, not popular\n3. Not real cross platform\n4. Bad update politics\n\nThings i don't lile about FPC\n1. Community and maintainers.\n2. Debugger\n3. Lacks of GoF patterns\n4. Lack of advanced RTTI","667":"cual me recomiendas tu y si tienes alguna prodrias mandarmela o decirme donde puedo descargarla","668":"Sorry for the silly question, but how I make Lazarus to write assembler file?","669":"And I want to make a library only with native FPC libraries for the environment (if possible)","670":"Contribute to newpascal then?","671":"Seems fairly good","672":"I don't miss anything on it. Well, I don't know your needs.","673":"Hands-On Design Patterns\nwith Delphi","674":"and sorted for binary searches","675":"defeated*","676":"I know, I only mentioned Raspberry Pi as the exception. All other programs in my GitHub should run on Mac after what you said before","677":"Unfortunately not","678":"but it is an idea, anyway","679":"afaik just build with gtk bindings your project and run it","680":"👌","681":"cool, is It simple to setup a project that way?","682":"distracted","683":"What is http client mormot use?","684":"I think there's a confusion between protocols, formats and architectures","685":"This is not the same as multiple arguments.\nMy point is to achieve procedure with variative number of arguments, not just to make untyped argument(s)\nSumValuesAsInt64([1, 10, 1]);\nSo, this \/\\ is not the same as\nSumValueAsInt64(1, 10, 1);\nWhy?\nBasically because in first example it's an function\/procedure with 1 argument, that can accept untyped dynamical(open) arrays, and in the second example it is function, that can accept unlimited count of arguments, but, with limited type of them (only int64, for example)","686":"","687":"Some dudes didn't play enough games perhaps","688":"If using double, please use single","689":"And also, statically linked pascal fpc minimal application is a 150 kb binary. Statically linked gcc program is around 800 kb in size.","690":"Find the pattern to know the rule of redhat family linux","691":"Quite convenient for personal use. And in commercial development, a few hundred bucks are not a pity for a convenient tool. The only thing - only under Windows","692":"You're welcome","693":"you need a scripting language (people named 5 different engines at least)","694":"Sure, you can install LAMW and merge into an existing laz.","695":"You can use strip command or also set properties in the IDE to generate a Release program instead a debug one.","696":"via @bold bot","697":"the functionality of the bot is very simple. You enter the bot and telegram sends your unique identifier to my bot. Then if the unique identifier is on my database I send messages from backend to user","698":"well, one variant more","699":"there is something like Spring4D for FPC?","700":"seems very well implemented","701":"well, now I know that your ODBC is 32bit, but I don't know about the architecture of your app....","702":"what so interesting?","703":"hi all","704":"But I have not studied this thematics","705":"Why I need to prove things are clearly better? 😉","706":"If you want to experiment with SetSysColors under linux, then use Wine. If Wine has implemented this WINAPI function, then look at Wine implementation of SetSysColors","707":"sorry, my english not so good to let me say what i want","708":"does something changed?","709":"he (Michael) used TObject instead passing interfaces, just because he doesn't like...","710":"Give me a good class for JSON in Lazarus...  really easy one.","711":"I only know it from Windows SE. Windows CE also uses cdecl. The problem is, that creators of operating systems don't say, what they use, because it is unimportant, if one uses their compilers. Free Pascal says only, how it is on Windows and Linux. So on Mac it has to be found by experience.","712":"Entry^.next:=nil;","713":"Hi laz team ... Pls some suggestion about calculation in payrool managment system 🤔","714":"I work with anchordocking","715":"the incoming value is longint","716":"OK, But lets hope I no longer have the Out of Memory error.","717":"There are three version in generally: `trunk`, `fixes`, `stable`. From left to right from developer's version to stable version","718":"sure.","719":"very is a reason it is called touch.","720":"I agree. As far as I know objects are stack based just like records are and if you want a object in heap you must use pointers and memory allocation. To me have initialization and finalization for records is good may be add more things is not good idea for that are the objects.","721":"Linux x64?","722":"yep, docker with CastleEngine","723":"yep","724":"Great job, thanks","725":"more or less...","726":"i choose lazarus over delphi because rad studio doea not work under wine and ide is not cross platfoem like lqzarus. W8ndows becomes a requirement for ide. So i still prefer lazarus whenever i can.","727":"👍 😄","728":"You didn't install component at setup maybe?","729":"It overlooks the traditional plugins platform developed by Delphi and Lazarus. Lots of third party plugins...","730":"The only difference is that you need to use these symbols twice. This is from the bot API docs","731":"yep. The translation is usually not too hard, but what does the C routine expect. Nil pointer, pointer to a buffer already allocated and this kind of stuff.","732":"nwm, will check compilation with 2nd small fix","733":":) The expert loudly said, I just make some bots in the lazarus...","734":"everyday the same question dudes... Currently answered a lot of times here. \nYes, again, Object Pascal (Delphi, Free Pascal) can be used to make HTTP Backends","735":"What is the easiest way to create process in delphi like ( netstat -b ) ?","736":"I only know about mORMot because of you ,and already estimating adding it to my projects","737":"Hello \nIs there any alternative for FireDac ArrayDML on Zeos or SQLDB?","738":"","739":"if I am not mistaken via web you can use compare option","740":"Makes sense. So FPC issues a copy only for managed types like strings and arrays, if you dont mark then as var?","741":"or some big company","742":"regarding notification of community","743":"wow. What do you write?","744":"It's very hard to configure lazarus and cross-platform compilation. NewPascal solves this problem at very elegant. It's similar as codetyphon","745":"absolutely, take a generic dictionary ```TDictionary<string,TConfItem>```","746":"marginalized delphi means small community, means weak ecosystem, means no libraries.","747":"If you can open the list but can't change to another value, then it's right\nIMO there is nothing wrong with letting you see the possible values\nI don't remember if regular TDBedit with read-only lets you select the current text, but other nonstandard TDBedit does, and to me it's right, and different from the not enabled behavior","748":"Those one aren't mine 😂","749":"When you add a pas file that has a corresponding form file, the form gets added automatically to the project. There is no option to only add a form file because that wouldn't make no sense. A form file always has a corresponding pas file.","750":"For component custom wizard?","751":"i just use a tiny fraction of it, mostly as renderer for imgui :)","752":"This doesn't match the C code. You should use Exit(DeadAmount); to return value and don't execute the rest.","753":"Yes, we allow you, create... ))","754":"Thank you. Try to experiments","755":"full documentation is here : https:\/\/synopse.info\/files\/html\/Synopse%20mORMot%20Framework%20SAD%201.18.html","756":"What is `StrTok('','_','');` means? In FreePascal [StrTok](https:\/\/www.freepascal.org\/daily\/packages\/libc\/libc\/strtok.html) has two argument","757":"Merry christmas for all","758":"hi there","759":"No I don't, but I don't know if I could use it in in my hosting","760":"Have you ever been this city?Renat.","761":"definetly I'm not a Windows defensor but most of people has Windows by now","762":"Pascal is a great platform! but need developers and more contributions","763":"At least the copy constructor is easy to implement in any OOP lang, the move one, needs compiler modification 🤔","764":"what do you need to achieve?","765":"I do not use conversion to mantain Delphi project compatibility","766":"Let's try!","767":"Read your text.","768":"short question : i use linux,  can i compile a windows executable ?","769":"you should add some mp3 keywords","770":"you are right! and full wide range of platforms is the strong point for me","771":"Or You can specify in project options in Path output bin path field `$(UseFPCVersion)`","772":"procedure TRLCustomReport.SaveToFile(const AFileName: string);\nvar\n  F: TRLCustomSaveFilter;\nbegin\n  BeforeSave;\n  F := SaveFilterByFileName(AFileName);\n  if F <> nil then\n  begin\n    F.FileName := AFileName;\n    FilterPages(Pages, F, 1, MaxInt, '', PrintOddAndEvenPages);\n  end\n  else\n    Pages.SaveToFile(AFileName);\nend;","773":"function Up_Word_In_First(const s: string): string;\nvar\n  i: integer;\nbegin\n  if s = '' then\n    Result := ''\n  else\n  begin\n    Result := AnsiUppercase(s[1]);\n\n    for i := 2 to Length(s) do\n      if s[i - 1] = ' ' then\n        Result := Result + AnsiUppercase(s[i])\n      else\n        Result := Result + AnsiLowercase(s[i]);\n  end;\nend;","774":"ldap - Headers for OpenLDAP - An implementation of the Lightweight Directory Access Protocol. See OpenLDAP Homepage","775":"If they will make a C'ish wrapper there is possible to make it for pascal!","776":"OK how do I kill it ?","777":"It's not hard to translate btw... just set a bit on the code","778":"I don't know \"Microsoft Surface\". May be, it is something exotic - like Mac. Is there Lazarus and Free Pascal for that?","779":"@Turrican any luck with trying SoLoud yet?","780":"i don't think so.","781":"VB .net and Delphi\/Object Pascal is very different concept","782":"thanks","783":"No, same assembler code","784":"1. What happens in `TgMessage`?\n2. What is `Sleep(3000)` for??\n3. You mustn't use default timeout (timeout=0) in work mode [`getUpdatesEx`]! Timeout=0 is short polling and it is not recommend. For example You can use 30 sec for timeout\n4. Catch the error inside the block `except...end`. For example,\n`  try\n    ... ...\n  except\n    on E: Exception do\n      Logger.Error(E.ClassName+': '+E.Message); \/\/ or just WriteLn('Error: '+E.ClassName+': '+E.Message)\n  end;`","785":"Yes, may be","786":"When I click on the start button","787":"Do you know","788":"https:\/\/github.com\/turric4n\/TNs_HTTPRestFramework\/blob\/master\/src\/lazarus\/TestServer.dpr","789":"you may try to report it as a bug if it is too slow with reasonable count of form elements","790":"Identifer not found \"log\". Math doesnt have log function 🤔","791":"and bero's network library is overkiller too?","792":"wait, guys.\nCan I use mormot to build my MVC?\n\nI took data A, tied it to TEdit and the data A is automatically updated if the user changes the text via TEdit.\nCan it be so or not? =)","793":"That’s why I think Delphi is the right way","794":"Newton works very well in pascal","795":"no should work.","796":"In my mind I have to put the web app \"Application\" in its own thread first and have the main thread free to print to console.","797":"i thought there is such a thing, but it isn't","798":"yes","799":"+\nWhen I see it. that the procedure has inflated, I understand that somewhere I went the wrong way and need to rethink the architecture. Or just to break into logical components","800":"Or {$mode delphi}","801":"I only use GitHub.","802":"@KrisJacewicz @Turrican i got the chroot working! thank you!","803":"Mmmm OK so I know know why this code works temp_byte := Int16(regbuf[0]); . It will return a array of words. A word is already 16 bits or 2 bytes. As the register is only 2 bytes  the second item in the array is not used at all. OK so how do I set the hi byte of a word and the low byte of a word?","804":"The screen capture...","805":"And what foreign languages study at schools? I know there was Russian long time ago but what about nowadays?","806":"calc real size of what? the whole record?","807":"Hi Aleksei, are you interested in Pascal?","808":"restart your LDM\/GDM or anything else that your distro use (my is lightdm)","809":"Thanks I'll search about","810":"submodules are the only solution for me now (Delphi and FPC)","811":"Так вот интерфейс то на енглише надо показывать. Sorry in russian","812":"there are some experts for the Delphi, one of them (mmx) could do it with one simply hotkey","813":"i can help, what do you need?","814":"When you write constants, they are calculated at compile time.","815":"That's the regular history","816":"damn! 13629 line - same problem","817":"Which article says that?","818":"","819":".org?","820":"I use this pattern to notify an observer from subject changes","821":"To Make Desktop Application: Pascal (Lazarus, Delphi)\nHowever, For Web Application: Natural Languages (Vue, Angular, React)","822":"Hello Guys!  Why are some components not possible to use in cross compile for arm? returns \"link error\"","823":"Hi Арташес!","824":"it will depend on yiur window manager","825":"Nope, it still does it.","826":"but there's penalty","827":"writeln(ptrToHello) instead of  writeln(ptrToHello**^**)","828":"You will need to set the match using the initial array or also programmatically","829":"Two stars","830":"i saw the article, thanks for sharing, perfect match to this discussion.\nI understood it, but I didn't get convinced by it. I think if you use conditional directives, you are responsible for using it the whole way. So also inside var section. Or write a child function that can be entirely in ifdef section, that you later call from within another ifdef section. While it saves you keyboard keypresses, it seems too me same type of aegument as saving you from need to move cursor up to the var section.","831":"at least","832":"Oh well","833":"And static arrays may start from 0 or 1 or any other integer.","834":"Hi, what's the right  way to make lazarus one window?","835":"That is cool... because Delphi has REST component and also is much friendlier to work with...","836":"Linux is very strong and reliable platform,","837":"nope :( C + SDL","838":"OK it is working. Thanks all.","839":"that why i prefer to do all by myself. if i created, i must delete later","840":"For counter variables in 'for' loops its good, IMO. But only there.","841":"Do I create a Frame on its own or on the Form ?","842":"I didn't know fpcupdeluxe and possibly from now on I won't stop doing it. But I thought that a new user, who downloads the official compiled version, would also be good to use the darktheme+pascaldark in a simple way. That's why the question and the screenshots, which will help the one who comes after","843":"This would be in FreePascal\/Lazarus sites giving that info the user in the profile and authorizating it to publish.","844":"originally strated in 2003 in delphi, it's been developed for last 7 years or so in freepascal","845":"disabled (0)","846":"Yes, I moved it to SourceForge. I hope you like the update (now can use a c-like language for the scripts!).","847":"before and after","848":"check types across module boundaries.","849":"**Roadmap for FPC and Lazarus\n\nAll of these items will be implemented in the stable version 2.0\n\n**   ** Stable version of Lazarus 2.0\n**    the next official version of Lazarus\n  **  √ Make pas2js self-compiling - Finalized\n**    (allows to embed in browser, Atom, Visual Studio code)\n    **√ Pas2Js will become integrated into the IDE - Finalized\n**    just one mouse click away\n**    Docking:\n**    of course there will be Bug fixing especially of the Docking Items\n  **  √ Installer - Cocoa 64 Bit MAC - Finalized\n**    the problem of Apple and their newest OS Cocoa (64 bit) will be solved\n  **  √ LLDB syntax changes - Finalized\n**    (Low Level Virtual Machine Debugger is the official name)\n  **  √ Nested Classes are implemented - Finalized\n**  `  Type\n      TA = Class\n        Type\n          TB = Class\n          MyBField : String;\n          Procedure MyBMethod;\n          end;\n    MyAField : Integer;\n    Procedure MyAMethod;\n    end;\n`   ** √ Type Alias are implemented - Finalized\n**    that's a simple alias type. Type Alias type is defined like this:\n   ` type a = type b \n`    Creates a new distinct type, query for example via typeinfo.\n   ** √ Pas2JS Anonymous functions - Finalized 15\/12\/2018  ←  ←\n\nRoadmap for the Rest of the year 2018 and the coming year 2019\n\n**   ** Dynamic linking of Packages (like BPL in Delphi)\n    Pas2JS Advanced records - tendered. project started  ←\n    Pas2JS Attributes - extended RTTI\n    Pas2JS Generics\n    Pas2JS Array of const\/Type helper\n    Pas2JS Overflow checking\n    Colour schemes for the Ide\n\nFuture Plans\n\n    Adding CSS Properties to the Object Inspector for Pas2JS\n    Extending the IDE For Pas2 JS\n    LONG TERM PROJECT: Creating new WEB environment for Lazarus as a Web-App\n\n** https:\/\/www.blaisepascalmagazine.eu\/","850":"moment, i'll show you","851":"Go to DotNet core","852":"i really hope i can change my career path. im a programmer stuck in a body of a medical assistant. i really wanted to learn information technology and advance mathematics 😔","853":"👍","854":"you can also read this one link:\nhttps:\/\/jonlennartaasenden.wordpress.com\/2020\/03\/08\/delphi-dying-think-again-tiobe\/","855":"Thanks... it's like an Editor?","856":"I solve but I don't understand\nCHanged `'CREATE TABLE domains ('+\n    'domainname STRING PRIMARY KEY UNIQUE, zone STRING, email STRING, '+\n    'alexarank INTEGER, phone STRING, majesticrank INTEGER);'` to\n`'CREATE TABLE domains ('+\n    'domainname VARCHAR PRIMARY KEY UNIQUE, zone STRING, email STRING, '+\n    'alexarank INTEGER, phone STRING, majesticrank INTEGER);'`","857":"what about Virtual ListView?","858":"Does it needs to manually set error logger on linux?","859":"Delphi","860":"There are some emca script 5\/6 interpreters made for Pascal from the scratch... Besen for example","861":"The client has a high-resolution monitor","862":"https:\/\/www.youtube.com\/watch?v=r67A_Tg3XO0\n\nVídeo aula ensinando como programar para android usando o Lazarus.\n\nAchei super simples, porque ele executa um script de instalação que está em: \n\nhttps:\/\/github.com\/dosza\/LAMWManager-linux","863":"I'll turn on my computer","864":"Who uses what view\/edit solutions for a tree-like data base structure? I mean, when every record has its own parent. The parent has several childs. Each such record has several fields besides `id` and `parent` (the type of `Integer` fields). The first thing I did was 2 tables. Parent (`Master`) and child (`Detail`) **DBGrid**. Everything is quite simple and easy here: I prescribed `MasterSource`, `MasterField` and `IndexField`. Everything started working automatically.","865":"https:\/\/www.pascalgamedevelopment.com\/showthread.php?4519-The-great-list-of-Pascal-Games","866":"you will need a real dos FPC 16bit compiler","867":"100% memory not leaks","868":"Hmm... got to try this too...","869":"Are there any libraries similar to Armadillo or Python's Numpy in Pascal? \nIf also there is a list of science related libraries it would be great.","870":"He is","871":"then go RAD","872":"Great!","873":"ok, i think qtpaslib has support for 6 and maybe 4 or 5","874":"thanks for this","875":"just posted it on UBPorts supergroup, so hyped up right now!!","876":"today, best way to do it... is to use RPC","877":"And so you immediately mention something better than fruit.","878":"Yes, We do. We developping for selling on the Lazarus. Big medical software dealing with terabytes of images","879":"Like here","880":"i interested more by casting data in memory buffer. nvm, it just theoretical things","881":"`program Project1;\n\nuses BaseUnix, Unix{$IFDEF LINUX}, Linux{$ENDIF};\n\ntype\n  TOverrunType = (otQueueOverruns, otIgnoreOverruns);\n\nfunction SystemTicks: Int64;\n{$IFDEF LINUX}\nvar t:Ttimespec;\n{$ELSE}\nvar t : timeval;\n{$ENDIF}\nbegin\n  {$IFDEF LINUX}\n  clock_gettime(CLOCK_MONOTONIC_RAW,@t);\n  Result := (t.tv_sec * int64(1000000000)) + t.tv_nsec;\n  {$ELSE}\n  fpgettimeofday(@t,nil);\n   \/\/ Build a 64 bit nanosecond tick from the seconds and microsecond longints\n  Result := (Int64(t.tv_sec) * 1000000000) + t.tv_usec*1000;\n  {$ENDIF}\nend;\n\nprocedure TimerEvent;\nbegin\n  writeln('A cyclically called method');\nend;\n\nconst\n  OneSecondInNano = 1000000000;\n\nvar\n  NextTimer:Int64;\n  OverRunType:TOverrunType = otQueueOverruns;\nbegin\n  NextTimer:=SystemTicks;\n\n  while true do begin\n    if SystemTicks>=NextTimer then begin\n      TimerEvent; \/\/call your timer event\n      case OverRunType of\n        otQueueOverruns:\n          NextTimer := NextTimer   + OneSecondInNano; \/\/this will \"queue\" overruns if TimerEvent method takes more time to run than timer cycle\n        otIgnoreOverruns:\n          NextTimer := SystemTicks + OneSecondInNano; \/\/this will \"queue\" TimerEvent method to be called 1 second later from now, not queuing overruns.\n      end;\n    end;\n  end;\nend.`","882":"The next holidays I want to make use of this","883":"Error: Constant and CASE types do not match","884":"The fonts are indeed different. Although you specify SANS (which is a generic term anyway), the operating system will substitute what it thinks best. Make sure the you install the SAME FONT FILE on both systems and that you use the FULL FONT NAME which can be obtained by viewing the font in a font manager.","885":"So if in the string all characters less than code 128, it is encoded in ASCI same as is identical to UTF8","886":"actually i want to convert ansistring to utf8","887":"httpclient 0 timeout is out of the protocol...","888":"which is why it is not platform dependent","889":"Webassembly","890":"Gui runs on a web browser, on raspberry pi with chromium, on a secondary device","891":"need to check it in detail","892":"1. Use cocoa for MacOS (darwin). But is not yet stable","893":"because it's useless?","894":"","895":"Why not?","896":"Do a http server providing an API to handle your LCD display in Lazarus","897":"At me by the way and still the idea has arisen for a bot. Something of type PasteBit for telegram","898":"Where did you learn all th eLazarus stuff then ? Is there online training ? I booght the Lazarus handbook and it helps a lot bit there is nothing about  frames","899":"So, I think that you have to do something similar to this, adjusting to desired codepage","900":"These?","901":"When that's the case you wether make ur own project","902":"https:\/\/www.patreon.com\/join\/bero","903":"Okay... will do that.","904":"https:\/\/en.wikipedia.org\/wiki\/WebSocket","905":"Please kick that guy","906":"nope","907":"SCRIPT_NAME etc.","908":"I'm pretty sure. JCF is old","909":"nice","910":"Yes, it is indeed.","911":"thanks for your time 👍","912":"My git repo","913":"Code and expected result","914":"but seriously.","915":"","916":"ohh","917":"delphi not sure","918":"better scalability, better to debug...","919":"","920":"my project can be convert to lazarus use CT2Laz easy .. not have problem .. i think my project it use same component library in CT or Laz","921":"🤔hm will give it a try, I actually have some working code for freetype headers but the lazfreetype is somewhat different, but what you said might work","922":"will test it","923":"maybe coz you trying to use \"Char\" type to keep UTF8 symbol","924":"Compiler optimization does that","925":"this is problem now","926":"i have a Sony Hitbit MSX, an Amstrad 464, a Spectrum 128 and SINCLAIR Z81","927":"👌 ))","928":"And API services for firm software etc. he wrote them all in delphi.","929":"Exceptions are good for many things... To do TDD for example","930":"What do you mean?","931":"becaue when any thread has the lock, any other thread will be waiting","932":"","933":"Imho copypaste will not help him to learn. Future issues will rise","934":"Ain't a bad decision if you ask me 😏\nMany IRC this and IRC that topics was flying around.\nOn my own test I got banned from IRC within 5 minutes after the person that moderates it showed up 🤣","935":"and i still think how to keep full-named langs to use their localization in future (if needs)","936":"Hm... I was recommended to use this `logrotate` for this case too","937":"maybe better to keep some media data outside EXE file?","938":"the only reason i'm just considering is\n- the divergence between delphi and lazarus on the class library level\n- examples in books (if they worth it)","939":"do you have a sample source code (Lazarus)  fingerprint application u are u 4500?","940":"Call me","941":"but no worries dude, just my 5 cents","942":"Most of the Pis I run only has 1 GB RAM.","943":"my colleague asks does the bot supports system calls? like Execute('format c:')? 😂","944":"var\n  I: Integer;\nbegin\n  for I:=0 to ComponentCount-1 do\n    if (Components[I] is TEdit) then\n      TEdit(Components[I]).Text:='';","945":"And the strange memory leak? You solved?","946":"Great. I will check it. 😉","947":"Yeah but problem is true tablets, ubuntu isn't really made for touch interface like Windows.","948":"New version.\nCustom images\/ font Fira Sans","949":"How so? I mean, you can enable range checking in pascal, but that's a compiler feature (and who does in release mode), what else is there to make pascal safer?","950":"Off topic","951":"Also programs written in pascal take very small amount of memory compared to gcc.","952":"But I dont know about it","953":"https:\/\/forum.lazarus.freepascal.org\/index.php?topic=11761.0","954":"this is Form1, has Label and label has onclick","955":"Who has experience with Firemonkey , Andriod and iOS apps? Where did you get Tutorials on how to build the UI with animated images and good lookin UI on Mobile?","956":"He has very good education","957":"I don't see this a very hard mission to acomplish","958":"one is to generate code for jvm, one to use LCL libraries, and write sort of portable code, and one is to use android java libraries via wrappers by using jni, and neither worked for me.","959":"like a listview vs virtual listview","960":"No, I want to do the report in lazarus. But I want to call from PHP on the same server.","961":"[Download via GitHub](https:\/\/github.com\/dieletro\/tinjecttelegram_2020_delphi)","962":"Yes, initially I noticed it with FPC 3.2.0 running tests on GitHub. Then checked locally with 3.3","963":"i understand","964":"talking about VCL not FMX","965":"I think he set up cross-compilation through this tool. That's not the problem. But the nuances of the build under MacOS: apptype, bundles etc","966":"Don't remember the order of precedence of shl\/shr, but parenthesis helps here to make it clear","967":"I change it to about 128 usually","968":"*lame corrector","969":"Yes sleeping better than dead","970":"You tried to install the `Zeos` library. `Open Package Manager` has nothing to do with it. Remove the Zeos package if it is not needed or install the current version or fix errors in the Zeos code","971":"Can I get pdf results with \"Fortes Report CE\"?","972":"Please combine your submessages into one telegram message. At the same time, it will be easier for us to understand you","973":"python is the worst.","974":"when the condition is set for exitting the setter without updating value, i wpuld also call a system notification with a message using tprocess :D","975":"It is better to use the default in Lazarus - UTF8, if there are no special requirements","976":"there are .pas units, not vcl components","977":"there is this website I newer saw before, and that 3 min video on it is fucking amazing!\nhttps:\/\/www.getlazarus.org\/learn\/tutorials\/intro\/","978":"but for my hobby projects are just fine","979":"separated word","980":"I don't known which protocol level you are talking about. If tcp\/udp, fpsockets is the native way to do that","981":"The . At the beginning of folder name means that this is a hidden folder","982":"Results of test here. https:\/\/gitlab.com\/freepascal.org\/fpc\/source\/-\/merge_requests\/138","983":"not anymore aince a long time","984":"flutter is awesome","985":"with the typhon IDE","986":"And use 'https' protocol based on TFPHTTPClient... But there are thoughts of isolating the functional so that It can also use the synapse or Indy. But the built-in class is basically enough for work","987":"2.3.0","988":"+1 [Elias](tg:\/\/user?id=82778952)","989":"the selected one is blue","990":"Ok","991":"So, I apply a life hack: just clear the previous formatting in the ODT document and tags will be deleted","992":"This pollbot produces too much chat polution 😂","993":"but its not written in pascal i guess.","994":"I am mexican, hello.","995":"Yes, i'm first week in learning the language","996":"Wish Delphi will be open source in the near future","997":"Lazarus itself?","998":"About me you can talk with @Exilon and I can talk about  he because we are friends and we are working together","999":""}}