{"text":{"0":"я бегло смотрел, но, по моему, вуй — это такой по сути шаблонизатор на клиенте, который предназначен для простых вещей, поскольку сложные там легко в лапшу превратить","1":"А если по европейской части прикинуть?","2":"Неужели везде лепить try ... catch?","3":"в общем, я понял, что ничего, кроме проксирования или сомнительной схемы передачи открытого сокета между процессами на ум никому не пришло","4":"Ребята из дискорда думают иначе","5":"если серьезно, есть в данном случае четкий case, пишем unit test для него и забываем, как оно passed","6":"ну внеси","7":"подсветка есть даже в вскоде","8":"ну это чуть изменённый хидер от либпкью же","9":"да он и не нужен был, кроме given\/when","10":"Тесты пиши и сильно умный линтер не нужен","11":"Но это было очень давно...","12":"тогда distcc  на все!","13":"Ты просто никогда не видел нормального перлового кода","14":"и в 20 нельзя было","15":"Хотя я не уверен, что именно перловики его должны предпочитать.","16":"Я подумал было \"а не поехать ли мне...\", когда увидел, а потом - рраз, и 4 ноября.","17":"обожаю очереди)\nпопадалась недавно красивая преза от bioperl'истов\nно чтоб преподавать, нужен кто-то, кто этим занимается","18":"нет. это дата-дампер так выдаёт","19":"ага, сенкс","20":"Как бы грепу объяснить, что слеш в $name - это просто символ?","21":"Это я просто по слову «Чехия» поискал и на дату сообщения сначала не посмотрел","22":"Unicode names completion","23":"Очень может такое быть, что и перл не нужен","24":"https:\/\/metacpan.org\/pod\/release\/ASOLOVEY\/Kafka-1.07\/lib\/Kafka\/Consumer.pm\nОффсеты... Да, идея очень похожая","25":"про скорость смешно. а про +{} — дело привычки и только.","26":"ну скажи мне что у тебя придёт на жсон тип в мыскле и пг, приведёт ли инспектор их одному виду?","27":"я уже не помню точно как там ). Даже если он в памяти весь буффер собирает, а потом на диск сбрасывает, всё равно это быстро для твоих аватарок должно быть )","28":"а при чём тут он? архитектура не оговаривалась. я вот щас на си для xl6 в основном на си пишу и там рам одно, а флэш с кодом другое","29":"Это очевидно","30":"Когда вся база один сплошной wtf - наворотить проще","31":"Нихуя себе","32":"А букинг что всё? Не на перле?","33":"Как и перл, не?","34":"Да я збокоен.","35":"впрочем, с их воркфлоу другое и правда не подойдет","36":"я тоже :) просто по логике так, ибо ничего не бывает забесплатно","37":"вобщем то составление тз — это тоже работа. она так и пишется в смете","38":"Вроде он в группе, но молчит","39":"тогда имеем и возможность дубликатов ключей, и упорядоченность","40":"То есть, простую вещь можно написать хоть на расте, хоть на кложе, хоть, не приведи Г-дь, на хаскеле","41":"да это вообще implementation details. пока в пределах одной среды, не мешает","42":"Ну так 3д неудобно писать из-за этого.","43":"Ну тогда опять таки моё утверждение по хорошему должно быть верным, жаль что они дизлайкали скорее всего из-за слушка об адском перле","44":"с питоном косяк","45":"Кроме этого все ок :) ну размер ещё великоват","46":"да хер с ними, с разрабами","47":"нормально. как у нас было: баг -> таска -> бранч, где отлаживаешься -> мёрж -> финальный тест. через неделю админы выкатят в прод...","48":"Rocket science епта","49":"так это не то, выходит","50":"https:\/\/slogi.su\/%D0%B8%D1%81%D0%BA%D1%83%D1%81%D1%81%D1%82%D0%B2%D0%BE","51":"перебори лень :)","52":"логотип классный","53":"А знаете, где находится тот барбершоп, куда ездят вейперы на гироскутерах пить смузи?","54":"Часто ли у нас бывает 100 одновременных запросов?","55":"Впрочем - это я и без них знаю тоже","56":"После С понятно как что работает и сколько это стоит. А то вырастет очередное поколение которое про сложность алгоритма не знают","57":"пхахахаха, не говори только никому","58":"ты аргументов не приводишь, а троллишь","59":"вооот","60":"и что? Для коорперативнй многозадачности юзают другие термины, а не треды: fibres, ивенты, ивент-луп, короутины и т.п. То что они \"похожи\" на треды, это ещё не повод тот же термин юзать )","61":"ну так shared же по идее должен взять мутекс и сделать это, разве нет?","62":"что за джойн?","63":"тк вполне гуй","64":"Атом хоть и написан на Электроне (собственно, это ранее часть Атома), но само строение редактора другое. Больше кушает и менее развивается (нет за спиной Microsoft c её опытом).","65":"ну что поделать. сообщество у денсер2 заметно больше, чем у пеф-фронт :)","66":"Спасибо, просто раньше это легко задавалось $#, и я мозг сломал почему оно перестало работать (думал что где-то что-то накосячил, пока не стал рыть варнинги)","67":"в таком варианте все таски запускаются под юзером который указан последним. А мне надо чтобы первый был от рута, второй от юзера","68":"можно запарсить все что однозначны, а остальные отложить и подумать что с ними дальше делать)","69":"Ну да... Это я попутал с понедельника.","70":"Так что приходилось извращаться","71":"кажется вчера тут было на 30 тел больше","72":"всего навсего!","73":"Может для перла пример админ-старовер писал :)","74":"ща в лидле крафтовое ничо так. уже год как продаётся.","75":"всё сказано","76":"вероятно будут различия в рендере шрифтов","77":"а то ишь, `auto&`","78":"ну nytprof умеет мод_перл. Но сделать это из идеи нельзя. можно будет загрузить потом дамп который тебе записали.","79":"А всё, понял, там у меня вместе с bower, grunt, нодой и прочим калом пошло...","80":"Дансер, каталист, амон2. Но моджо просто самый популярный","81":"точно нет","82":"ураниевые. из леса","83":"в яндексе тоже перлиста ищут?","84":"use Getopt::Long;\nuse strict;\nuse POSIX qw(setsid setuid strftime);","85":"и куда-то срать гитом.","86":"+1","87":"А теперь давайте поглядим на их распространенность","88":"nginx все переварит","89":"В чем прикольность?","90":"А чем убунта на сервере лучше\/хуже дебиана, кто-нибудь может на пальцах рассказать?","91":"криво написал - Core M это пятое поколение Core i5, во","92":"теоретически, если модуль после себя не оставляет всяких интересных ресурсов, то можно выгружать модуль","93":"чего сразу гошечки, может это вообще влияние функциональщины","94":"Для начала в чистую пропарсить","95":"Если две системы имплементировали одну и ту же спецификацию по разному, значит ли это что только одна имплементация верная?","96":"Ладно - попробую еще собрать весь этот компот :)))","97":"Можно видеть, что @INC отличаются","98":"а ещё аутлук с календарём","99":"Я с трудом представляю, как такое может быть нужно для частого использования, если честно.","100":"В современном перле совсем не обычный мержсорт. Они его подпилили. Там в исходниках даже в комментах это написано","101":"такс. теперь завелись про возраст :)","102":"На чем угодно, что может генерировать swagger UI автоматически","103":"ну, чисто теоретически, бывает надо сделать какому-то хендлеру, например `local $c->{a}{handler} = ...`","104":"кому-то не зашло, я говорю язык - говно, слишком специфичный, шатал я эти goroutines и main loop","105":"я не о том, что код на перле \"в принципе плох\", вовсе нет, всё сильно зависит от конкретного писателя, как всегда. я о том, что порой надо хорошо разбираться именно в перле, чтобы правильно переписать алгоритм на другом языке.","106":"хм...","107":"на браузере клиента?","108":"да, с немецкой вроде нельзя. сам не вникал, но во франции лови сколько хочешь, только какой то налог заплати, а в германии надо права на рыбалку получать","109":"я встречал баги в либах, их использующих, но это другое дело","110":"поддерживаю, проблема когда приходишь в проект, в котором уже сделано не в копейках","111":"арифметака как делается -- очевидно?","112":":D","113":"мне такж","114":"urllib3 не подходит?","115":"чей бот, измените real на realtime :)","116":"но и тут я не буду настаивать","117":"String a;  String? b; a = b; — как ?","118":"Так может проведем","119":"Это мы не нужны","120":"Я оттуда их и взял, да :)","121":"да","122":"Ты - и против холивара?)","123":"eat your perl -p -i -e","124":"Да никто не продвигает ничего. В этом и проблема. Я в школе учил basic, потом pascal, а до этого у меня был бекграунд в виде электроники мк-61.","125":"асинхронщина там чистая","126":"типа `Test::Fixme`","127":"на сколько я помню раст при исталляции прописывается куда-то в `~\/.profie` или в `~\/.bash_rc` и тп","128":"а можно как-то имя субы получить?\n`AE::log debug => __FILE__:__LINE__ . \"text...\" ` как-то многословно каждый раз повторять","129":"к твоему мнению у меня нет никаких вопросов. но, просто подумай: речь про джейсон, который, по определению, пришёл из жс. там `{}` значит объект, а `[]` — массив. но это такое, тебе в твоём языке виднее.","130":"это фича","131":"а то комп лень разбирать :)","132":"Да, 34 метра съедает.","133":"Загадками заговорил))","134":"Или...","135":"у нас тут собеседования - полчаса с айчаром, потом час-полтора со мной","136":"Это правильно - надоел тут лить треш )","137":"то есть если функция вызвавется миллиард раз и внутри нее написать иф то иф не будет выполняться миллиард раз?","138":"не надо пиздеть про любых, нормальные хуево смотрят, и тут  обсуждалось уже","139":"А подскажите, есть ли что-то типа Getopt::Long, только чтобы ему не надо было список опций готовить? Чтобы дал ему хэш и он туда положил разобранные аргументы","140":"> The special value 00 will cause Perl to slurp files in paragraph mode.\n\nа эт что? когда разделены пустыми строками?","141":"пролетает yaml ,когда конфига нету","142":"Однако, объем воды больше. Значит h1>h2.\nMgh1-Mgh2>0","143":"А потом таки надо переходить.","144":"Переходишь по параграфам, выбираешь развитие сюжета","145":"А чего ты меня спрашиваешь, меня все устраивает :)","146":"то игоры","147":"бенчмарк вроде как и есть цикл )","148":"тьху )))","149":"Смотри Perl Data Language.","150":"годы были такие, щас-то бы его без особых проблема заимплементили","151":"И внезапно $var->method_from_packet() будет работать","152":"Т.е. нужно сначала запустить bin\/dclient.pl ?","153":"https:\/\/gist.github.com\/jef-sure\/4472dd2ec1252107b389464f62dee77e","154":"Я предпочитаю `my ($self, @args) = @_; `, shift если один аргумент или форварднуть","155":"пу... пшшшшш!","156":"Прямо очень похожая на правду штука:\n https:\/\/metacpan.org\/pod\/Params::Util\nБыла б ещё XS-кой\n\nВ идеале бы так:\n```check_arg('UInt', 'argument ' . $arg_name . ' must be positive number');\ncheck_arg('LikeRegex', qr\/holy shit\/, 'argument ' . $arg_name . ' does not looks like holy shit!';```","157":"вот","158":"👍","159":"а есть же типа \"таблицы в хмл\" у кого то","160":"файликом, но можно и книгой :)","161":"https:\/\/github.com\/carbon-language\/carbon-lang\/issues\/1549","162":"Едь один, я так катался когда жены не было :)","163":"это надо сразу на выходе из универа брать чела, пока не забыл математику :)","164":"я не умею пользоваться этой хуетой. я только гуи дебагом умею","165":"это должен быть аналог `die(\"unimplemented\")`","166":"вариант сглаживания сигнала: https:\/\/habrahabr.ru\/post\/184728\/","167":"Не закрывая конекты можно легко упереться в лимит конектов","168":"я такого говнокода даже у студентов не видел","169":"1. ну - я про него ничего не знаю. но что-то мне подсказывает, что это не совсем перл, и что перформанс этого дела надо мерять внимательнейшим образом. есть проект, в котором оно применяется?\n3. для ускорения\n4. спецификация на поведение виртуальной машины.","170":"Можно хранить результат выборки, например в тарантуле или в киото","171":"Коллеги, а не подскажете как указать для IO::Socket::SSL (или напрямую для Net::SSLeay) кастомный конфиг для openssl (который к примеру можно задать через export OPENSSL_CONF = …? )\nЧто-то не могу найти опцию такую (и есть ли она)?","172":"И с диска тоже - привет фризу всего при работе с усб флешкой","173":"втащить какую-то \"ручку\" в хранимки - нормально. основную логику в хранимки- тоже норм. А вот половина в хранимках, половина  основной логики где-то ещё - большая проблема","174":"Спасибо","175":"только для лютой легаси что переписывать некому и на на что","176":"Эм... Хайлоад челледж страница которого грузится 10 секунд... Думаю - это успех.","177":"Там такое... там... там...","178":"за 95й не скажу, я в инете с 97, тогде уже нетскейп был, типа 4.01","179":"Возможно, гм, псевдокод","180":"так, я правильно понимаю что condvar -- хрень одноразовая и после использования её следует undef и создать заново?","181":"да, кстати, нахера тебе `no strict 'refs';` на топ-левеле?","182":"и очень хорошо","183":"Антон, продай им свое время, пока делать нечего ) вообще говоря, диагностика точная","184":"ну если на каждый cgi запрос будет форк например, то что там стоять будет-то","185":"Ну это нас-же.","186":"Не буду","187":"докажи это аудиторам","188":"чтобы консистентность была","189":"Ща дичь скажу, держитесь.\nА у кого-нибудь в команде практикуется \"заказ\" сниппетов? Это когда участник команды говорит \"мне нужна функция\/класс\/однострочник\" , делающая что-то простое,  Сниппет изолирован от логики приклада, он самодостаточен. На разработку сниппета отводится ограниченное количество времени. Предоставляется заказчику на страх и риск заказчика, ответственность за тестирование и отладку в рамках всего программного комплекса лежит на заказчике, либо в крайнем случае в запросе на разработку сниппета содержится просьба предоставить тесты. \nЦели: разгрузить одних, занять других, сделать возможной  разработку с прямой доставкой, без оверхеда пайплайнов CI\/CD. То есть это просто способ делегирования, а не методология разработки как таковая","190":"ну так и мы не на столько молоды)","191":"Внутри кавычек все пробелы имеют значение. Если они(пробелы) не нужны, их надо просто убрать в коде программы","192":"Ппц, ставить unievent и libuv только для того чтобы достать интерфейсы","193":"","194":"А хуки - это что такое?","195":"нет, ближайшего","196":"Да, выиграли seedstars Украина","197":"а, понял. Этож локальная переменная.","198":"Тебе нужно найти одинаковые элементы или одинаковые поддеревья? Если второе я не очень уверен, что это стоит реализовывать на уровне бд.\nЕсли первое то будет что-то типа \n```SELECT * FROM table t1 JOIN table t2 ON t1.hash = t2.hash AND t1.name = t2.name WHERE t1.left BETWEEN ? AND ? AND t2.left BETWEEN ? AND ?```\nЗнаки вопроса это плейсхолдеры для того, чтобы выбрать элементы из поддерева, а после ON сравнение элементов.\nЕсли все же нужны одинаковые поддеревья я бы вычислял при каждом изменении что-то типа хеша, который бы его характеризовал и сравнивал бы не все поддерево, а тоже поля с хешами.","199":"Хз, не вижу проблем такого написания. Сделай как хочешь","200":"error() подмени","201":"душу не вкладываешь","202":"В остальной России - фиг знает, в какой пропорции считать","203":"по-моему, оно не красиво, а фубля","204":"Куками","205":"И вообще странно конкатенировать вначале","206":"onion omega2 хочу повертеть","207":"Я локализовывал, но вряд ли быстро найду.","208":"я работал и с тем и с другим и не скажу, что Dancer проще и понятнее","209":"Мувеблтайп провославный, на перле.","210":"говорю же, зависит от требований.","211":"При этом в профиле вообще левые данные","212":"походу остались самые стойкие )","213":"в кавычках жи","214":"А теперь приджойнь туда ещё 5 таблиц.","215":"спасибо.","216":"Так у нас работает практический весь XS код проектный. У нас нету времени писать на Си\/Плюсах. Более того - половина перловиков у нас его не знает или не хочет туда соваться. Весь такой код сначала пишется на перле, потом пишется на XS, если это надо и есть тут \"болит\".","217":"А uwsgi?","218":"ну нихуя он не поймал","219":"Sorry, I'll express it better!","220":"это ведь и взлома касается аналогично","221":"на го, там говорят быстро все и дженериков нет","222":"кстати, если ты доизобрёл `findBy` как он сделан в спринге (я давал линк), то я бы посмотрел. я именно этим сейчас занимаюсь.","223":"ну я верю что странно. но вот не работает :)","224":"article[tags][]","225":"Это всё потом. Не хочу сейчас холиворить.","226":"что за хуйня на канале?","227":"у меня есть голый ардуино :)","228":"targetVersion 5.10? Привет из далёкого будущего. )","229":"По м1, затем свернул на м2 в слободе","230":"да, sax парсер называется","231":"В урле содержится кириллица. Кодировка url utf8. Не могу понять почему http_get не хочет работать с урлом в utf8","232":"В целом,  psgi аппликуху я могу запустить на любом сервере который предоставляет интерфейс. Как и cgi  когда-то:)","233":"но точно не","234":"Асинхронный - нетактируемый","235":"`\/usr\/bin\/ld: cannot find -lperl`","236":"и посмотреть, работает ли","237":"Потому что Си решает свою основную задачу отлично и потому что Си - это только на половину \"тупо язык\", а вторая половина - это его инфраструктура, компиляторы. И вот компиляторы вполне себе меняются и соответствуют требованиям 2018-го года, чего нельзя сказать об интерпреаторе perl5 ни разу","238":"да запросто, любой мигающий пак","239":"230 км вроде","240":"(8","241":"Yet another markup language","242":"какое слово непонятно?","243":"О, аналогия с ядерным реактором уже интереснее. Ну да, вообще как бы неплохо, когда приложение работает \n- Надёжно\n- Предсказуемо","244":"ниже \"compile Perl 5 to Perl 5\" - выглядит многообещающе","245":"памяти 48к максимум, своп не сделаешь","246":"надо чето менять","247":"а зачем?)","248":"Как это проверить как раз понятно.","249":"Там модули просятся в XS. Но это реально исключение, и в XS идет приложение, а не веб-обвязка","250":"изнчально там было\n\nreturn watnarray ...\n\nа ты сделал\n\nmy $is_want_array = wantarray:\n\nreturn $is_want_array ? ...\n\n?","251":"5.30?","252":"flock($fh, LOCK_UN);","253":"Хороший отчёт - это такой, при прочтении которого создаётся впечатление, что сам там был.","254":"Хотя 26го уже на новую","255":"С военным проектом не срослось? Я вроде тебе кидал его?","256":"Почему бы мне тогда не делать так:\n```ПакетТакой->ПакетВообщеДругой::Метод```","257":"Ну, это случай рокстара)","258":"ну, есть перечень блокирующихся сисколлов","259":"Ну ип белый даёт?","260":"Тут единица измерения была годы, а не часы ;)","261":"`use warnings FATAL => 'all';`","262":"хм, какой сам написал","263":"а вот это не надо\nи python и ruby медленнее","264":"ну, вдруг человек не знает специфику постгреса, например","265":"или откатить тот патч в либмайсклклиент, который решил поломать совместимость","266":"Порог вхождения в русский язык тоже высокий","267":"Нет","268":"да","269":"Оу оу!!! Биг сенькс, давно искал","270":"Нашёл, вижу, key и iv один и тот же, я был невнимательным","271":"Хотелось бы у себя генерить по конфигу то, что тут по ссылке\nhttps:\/\/swagger.io\/tools\/swagger-ui\/","272":"я бы ещё был непротив чтобы тут добавили персональные блоги, галереи... :)","273":"вот как раз сейчас читаю как это","274":"👍","275":"а вообще можно вот так поискать примеры https:\/\/grep.metacpan.org\/search?q=File%3A%3AShareDir&qd=%5EApp&qft=","276":"просто кардинально проще, чем дбиц, однако ж","277":"И в расчётах кросс-курсов возможны ошибки округления. Если считать через прямой курс получается одно, через обратный - другое. И тоже зависит от задачи и соглашений в проекте. Но не 1.21 и 1.18, конечно.","278":"```$_ = 0 for $a, $b, $c;```","279":"а, вот ипа я что-то пропустил, я что-то не особо их :)","280":"Выкидывать нельзя, глицин бесценнен","281":"Ну, мы для руби-господ эликсир держим","282":"Да, немного. Кстати, опиши теперь чуть подробнее задачу с perlbrew.","283":"Только фраза \"развесистый json\", кмк, подразумевает уровни вложенности более одного.","284":"Если это текстовый файл, то надо его содержимое decode_utf8 сделать","285":"спасибо","286":"а если не слушает никто?","287":"В скаляре?","288":"Да, там наверняка оно на чем-то элементарном падает при установке","289":"Там по ссылке ответ есть","290":"не теоретизирую","291":"уже на 5.20 было емнип","292":"красивее так","293":"это понятно, что андф освобождают память. Вопрос бы зачем человеку в devel-mat ловить\/смотреть андефы, если, по опредлению, они освободили память (или как минимум сделали dec)","294":"а рецв?","295":"@Medvedych как дела ? Интересно же","296":"спалился, тебе же 3 года! теперь ты буджешь always twenty one, бгага!","297":"коллеги, треды тредами , но тот же nginx с форками с event живет и очень даже неплохо","298":"ты ж из Панды? спроси, они любят :D","299":"Что дает возможность использовать эту штуку в реалтайме, после решения 2х проблем алгоритма","300":"В перле что-то было","301":"No such file or directory","302":"в Москве гниль и битьё одно с мерсами и бэхами >10 лет","303":"уже","304":"а можем просто пойти флудить в рубёвый флудильный канал","305":"`$user_rs->lessons` возвращает resultset","306":"а тут надо заводить еше один массив и заниматься тавтологией с push @optional, {marker => $marker} if defined $marker;","307":"по-стариковски","308":"Разные ou не дадут завести 1 логин 100%, dc скорее всего тоже (не помню, доеду , гляну скрипт ).","309":"bash прекрасен, если что. Пока что лучше не придумали.","310":"даже основных мобильных платформ целых две!","311":"хай. вопрос по jsonb: \n```update result set result = jsonb_set(result, ?, ?::jsonb, true) where id = ? returning result```\n\nсудя по логам, апдейты у меня идут верно, но некоторые ветки жсона как будто не меняются, подозреваю, что проблема в конкурентных апдейтах. вопрос: может ли так быть, что апдейт жсон-поля не атомарен?","312":"небось еще mod_perl пользуешся?","313":"is_deeply","314":"до первого факапа","315":"Например чтобы POST обрабатывал только image\/gif image\/jpeg image\/png","316":"https:\/\/gist.github.com\/poizon\/f8df819821fbe6a8eeeb3168e1c3059d вот пример layout для angularjs appы. А вот пример того что я отдаю в %content% https:\/\/gist.github.com\/poizon\/ebfd082a1e7011d6f496a9dfb4c77360","317":"это: а) очевидный костыль; б) это позволило немного модифицировать существующий код в изменившихся условиях его использования, чтобы он продолжил работать как раньше; в) позволило избежать возможно дорогого по времени рефакторинга.","318":"вообще структура становится неподдерживаемой, like в любом случае медленнее проверки по равенству поля, например","319":"Если человек в состоянии разобраться в коде чтобы сделать PR, то уж понять табы\/пробелмы он сможет с легкостью.","320":"Думаешь, мне его не лень писать?","321":"Получать события нужно с оффсетом. Не самый качественный код, но как-то так:\n`eval {\n  $updates = $tg->getUpdates ({\n    timeout => 7,\n    $offset ? (offset => $offset) : ()\n  });\n};\n\nnext unless (defined $updates && $updates && (ref $updates eq \"HASH\") && $updates->{ok});`","322":"но, ок","323":"my $hash{1,2,3} = 123;\n\nэто не бред, это очень полезная фича.","324":"кумыскуль","325":"проблема в том, что оно сильно не похоже на то, что есть в других языках","326":"но у нас в проектах гит","327":"сишарп это мс, на юниксах его мало","328":"а джавы 12%","329":"авторы компилятора не всесильны - если синтаксис сложен, то можешь получить не то в другом месте, этим и Perl страдает","330":"в асме бывают уникальные возможности по оптимизации","331":"не согласен. я хочу сосредоточится на решении задач, а не на выебонистости языка. перл хорош для души","332":"ну у меня прикидки есть","333":"Но почему тогда не .000?","334":"в литресе был чувак, который в углу отгородился 5 или 6 вертикально стоящими мониторами, полукругом))","335":"Ну точнее плохое тз 🙂","336":"я даже запапрился бы тк CRC руками еще не ломал","337":"отправь патч","338":"+1 за крон","339":"И опять же. Контекст вызова в перле вполне себе очевиден.","340":"красиво","341":"Да не нужна она в Perl. Я вообще не понимаю зачем пихать типизаюцию во все дыры. В Си она нужна, в perl5 нет.","342":"Эм... ты не всегда можешь пушнуть условия на ремоут","343":"А я думал with просто освободит ресурсы, если что-то пойдет не так. А возврат на диру... это как-то неочевидно что ли. нет?","344":"чем вычтешь?","345":"Биндинги к тензору это просто возможность запускать граф вычислений тензора","346":"(Маловероятно, конечно)","347":"Я могу провести мастер-класс по избавлению от перл","348":"ну из модуля обращение к другому модулю","349":"тоесть при поиске к самим хранимым данным ты не осуществляешь прямых запросов","350":"один хрен все питон 2 юзают, у нас в конторе народ грустно размышляет как бы перейти на 3 чтобы все сразу не сломалось :)","351":"Всегда можно отнаследоваться и перебить в наследнике и наследника положить в свою репу. Половинное решение, но - что делать.","352":"вот этот, лол","353":"Если запрос прочитать с id1, потом переименовать с id2, потом опять прочитать с id1","354":"ну я ж закинул. всего 13 кб","355":"Извините, но у меня в проде 5.8 и 5.10","356":"that name!","357":"Я в более обширном смысле.","358":"Даже если не знаешь все операторы - как-нибудь да запилишь))","359":"```C:\\>chcp\nТекущая кодовая страница: 866```","360":"я что-то описания не понимаю","361":"Да? И как?","362":"А у богатых как?","363":"оно ж процесс моджо затормозит, до его завершения весь сервис стоять будет","364":"вот и я таких не знаю, не видел и не слышал","365":"Ага, то что нужно.","366":"Но у любого обьекта есть уникальный анонимный экземпляр класса, отнаследованный от его видимого класса","367":"они вообще то тоже люди , человеки, правда оставшиеся без образования и работы (","368":"А сюда сколько доходит?","369":"распределение неодинаково.","370":"собственно, я так и делаю. возможно, надо еще сделать аналог Mojo::Base со своими стриктурами, но пока руки не дошли","371":"привет. нет, это ж только варнинги были. ошибка была в ае. я не знаю что с ней делать, поэтому, обошёлся привычной отладочной печатью... :) прямо щас мне уже не актуально","372":"Прив, посоветуйте хорошую книжку на перл","373":"хз, не знаю.","374":"С константами не юзабельно, в рантайме не включишь","375":"хай. ты про приложение что думаешь, один туду на всех клиентов или раздельные?","376":"Хвост распределения я имею в виду","377":"вру, релиз 5 версии в 94","378":"На готове держал?)","379":"Внутри перла массив формируется только тогда, когда нужно.","380":"Горбуха, вобщем","381":"не говорите мне что делать, и я не скажу куда вам пойти","382":"Отсутвующий элемент хеша конечно будет андеф","383":"```% perl6 -e 'my @a; my @b = 1,2,3; my @x = @a || @b; @x.say'\n[1 2 3]\n% perl6 -e 'my @a = 1; my @b = 1,2,3; my @x = @a || @b; @x.say'\n[1]```","384":"Это ты о ком?","385":"Это да","386":"Пфф, не надо","387":"ты говорил про сохранность данных","388":"Context switching is a bitch ;(","389":"в Perl многие используют Validate::Tiny, не знаю правда популярне ли он JSON Schema для Perl","390":"А в питоне 3 нет либ не на асинхронщине для работы с ари","391":"Здесь пользователь не получит свою форму, пока не дождётся у моря погоды?","392":"да ))","393":"))) \n\nP.S.: тогда уж следовать и далее Rails: Person.offset(3).fourth # returns the fourth object from OFFSET 3 (which is OFFSET 6)","394":"Может так как хост один, то ему и не нужен префлайт...","395":"незачто. я просто помню боролся с глубойной стека, что надо отнимать","396":"Ну в read ты же в нее читаешь? А malloc не сделал)","397":"Кстати, как к этим глобам обращаться ?","398":"ясно вобщем. нельзя указать дб в настройках коннекта. надо в настройках юзера или менять после коннекта.","399":"собственно в этом и был затык : не совсем понятно какой интерфейс, и делать ли al-la Mojo (синхронная запись на диск прилетевших байтов) или асихронно (в другом потоке). Если есть идеи\/предложения - велкам.","400":"ждать тогда долго, а мне не нужна особая точность","401":"Эта недобд вообще дофига чего не умеет, а в худших случаях прикидывается, что умеет, но не делает.","402":"1. рекомендаций нет;\n2. когда всё задолбало на этой работе;\n3. когда ты всех задолбал и тебя уволили;\n4. когда случился форс-мажор и работы больше нет","403":"а за залп там до 8 летело","404":"контекстом https:\/\/t.me\/modernperl\/202771","405":"ключи хешей совпадают или нет","406":"т.е. кроме как продаваться целиком - вариантов хороших нет. И продаваться - не вариант для меня.","407":"Все нормально. Просто Клименко неадекват немного. А клоунов тут и так хватает. Зачем мне конкуренция?","408":"`__SUB__` же","409":"подсказки аргументов","410":"","411":"и вот так.","412":"вы с одной работы штоль?","413":"1) SUPER:: ничем не отличается и даже лучше\n2) может я предметную область такую моделирую и у меня имена про парентов?","414":"сегодня он играет джазз, а завтра родину продаст","415":"это не бага, это фича :-)","416":"интересно, интересно","417":"это современный perl фреймворк?","418":"Какраз ща бьюсь над кластером в котором не будет терять","419":"cucumber очень долгое время продвигали в Ruby-мире, но сейчас он уже не так популярен, imho","420":"","421":"Пхахахах ))))) Точно точно )))) \nНу, хорошо, что от xml потихоньку уходим 😁\nНе везде, но ...","422":"но старый что ли стал...","423":"он удобен в экосистеме можо и умеет асинхронно работать из коробки с пулом коннектов","424":"Треды+event loop","425":"В-общем, к вопросу о токсичном поведении. Думаю, вопрос не стоит оставлять без внимания и нужно как-то его стандартизировать что ли - например, принять некий документ с нормами поведения, как это сейчас модно делать во многих сообществах (например, в Mojo: https:\/\/github.com\/kraih\/mojo\/blob\/master\/lib\/Mojolicious\/Guides\/Contributing.pod#code-of-conduct). И в будущем мониторить подобное поведение и в ответ на него принимать меры - от предупреждения до бана - временного или постоянного.","426":"я бегло сорцы посмотрел. стало понятнее","427":"то что доктор прописал )","428":"я собеседовал как то около 40 человек. выбрал двоих","429":"Гвидо в мс дали команду гиков, с которой он занимается ускорением cpython. Слушал не так давно подкаст с ним, дядька весь при деле. Подозреваю, что микрософт ему ещё мешок денег отсыпал на его эксперименты, т.к. для компании это очень престижно, иметь в штате такого человека","430":"это из-за scope","431":"А кто это?","432":"не ну мне пхп после перла кажется реально настолько простым","433":"А я - санкт-петербургская этуаль","434":"гм. профайлер утверждает что у меня дофига времени сжирается в Time::Local::timelocal","435":"что-то я запаниковал как там наш ubic","436":"кодерефс ты предлагаешь как енкодить?","437":"это было б у меня несколько короче","438":"речь не о том","439":"Один стоит, его ебут в жопу, он стучит ебалом по клавиатуре и получается перфорс","440":"Слишком толсто :))\nЗнаешь, в общем случае, если бы у меня было два _одинаковых_ кандидата, один писал бэкапер файлов, а второй вебню; а мне, скажем, нужно было бы делать эквайринг (да что угодно), я бы скорее первого взял. Выше шанс, что он не тупой.\nИ, кстати, никакая библиотека на пездоне не поможет бэкапить файлы хорошо","441":"Если вы про БД, то у нас программисты этим занимаются. Равно как и созданием всей БД. И индексы на нас и оптимизация залипающих запросов и прочее.","442":"да","443":"Айда сюда из лички, здесь бот есть","444":"То что его посадили, это известная история. Я думал, может были новости после, может вышел уже","445":"Если десериализатора такого нет - ну, сорри, по таймеру выжигаем задачу калёным железом и пишем в лог","446":"Т.е. возникает буквально когда угодно. Есть уже сильное подозрение, что у них жёстко хажат лимит количества подключений.","447":"а потом, когда становится много, появляются мысли сэкономить на масштабе","448":"я просто не выкатывал в heroku, но вроде все примитивно","449":"или там сейчас тоже '\\n'?","450":"но возможны утечки","451":"x{441}\\x{438}\\x{43b}\\x{443}\\x{44d}\\x{442} \\x{441}\\x{432}\\x{43e}\\x{435}\\x{433}\\x{43e} \\x{440}\\x{43e}\\x{434}\\x{43d}\\x{43e}\\x{433}\\x{43e} \\x{433}\\x{43e}\\x{440}\\x{43e}\\x{434}\\x{430} \\x{411}\\x{443}\\x{43a}\\x{432}\\x{43e}\\x{433}\\x{440}\\x{430}\\x{434},<\/span><\/p>\",","452":"у него с отпаршенными структурами медленнее","453":"> хотя светлые темы дорого очень для глаз.\n\nнуну.","454":"как нанимателя","455":"у тебя уникальная профессия. ты можешь при наличии навыков и желания выбрать любое место где ты хочешь жить.","456":"from perlipc:\nNot all platforms automatically reinstall their (native) signal handlers after a signal delivery. This means that the handler works only the first time the signal is sent. The solution to this problem is to use \"POSIX\" signal handlers if available, their behaviour is well-defined.","457":"да, так и не смог покашо","458":"Эх... async await в Перле - где вы?","459":"грепни по модулям print, warn","460":"Ну и телефон","461":"Хотя-бы... Хотя это немного не то все-таки.","462":"эклипс добавьте к срачам","463":"Пример довольно длинный, положил сюда: https:\/\/codeshare.io\/29ezAK\nЛогика задачи: третьи сущности имеют списки имен вперемешку со списками групп, их надо распаковать в имена. Места оптимизации помечены комментариями.","464":"Пишу на C, C++, Perl, PHP, Java, Go, Kotlin, Clojure, Ruby","465":"я не увидел ни слова про jsonrpc, там в некоторых местах протобуф, в некоторых просто json","466":"ахаха, не видел","467":"Дааа, вот настолько всё плохо:)","468":"нельзя говорит что то гавно или то гавно","469":"Ну дело-же не в том чтобы скоуп менять. Очевидно что это синтетика от подхода. Считайте что скоуп менять нельзя, но это должно работать.","470":"Не очень понятно задача, если честно.","471":"Ну можно поискать оригинал, все таки это перевод на русский вот этой книги: \"Programming Perl Fourth Edition Tom Christiansen, brian d foy,  Larry Wall and Jon Orwant\"","472":"ты когда не в push это делаешь, запись `$self->tests->[ ... ]` почему-то не напрягает?","473":"мегафон вполне официально это делает, за бабки можно отключить. МТС тоже ловили на этом","474":"почему это следующий?","475":"с какого провайдера проверяешь-то?","476":"так уже был в смежном чате, которы jobs","477":"Но DKIM - это почтовая штука, вроде никак не связана","478":"будет шифрованный ответ","479":"хотя если нужна только лишь математика, не лучше ли взять YAPP и парсер слепить","480":"ну вот, тролли припёрлись...","481":"ОГО!","482":"for my $num (split ' ', $str) {\n$num\n}","483":"покажет порты","484":"там очень много в ней гигантов с легаси. но в чате сидят люди в небольших конторах которые могут и в их силах изменить это. но продолжают сидеть на mod_perl неизвестно почему","485":"А третья это Dr.Web","486":"`D`","487":"это уже другой разговор","488":"Я знаю. С компа посмотрю","489":"не подскажу к сожалению, надо в доку смотреть. Но как я понял, принцип примерно такой, да","490":"\"Опыт разработки высоконагруженных сервисов;\" в голове сразу всплывает всякое","491":"ты поди ещё и на ноутовской клаве работаешь?","492":"помоему решение идеальное.. и  его можно воплотить в рамках одной машины","493":"не вариант","494":"Этот модуль всплывает в чате раз в полгода. Но как-то неживенько.","495":"А ещё если ты захочешь рассказать о перл на собеседовании, то тебе рассмеются в лицо (личный опыт)","496":"последний аргумент { @ }","497":"откуда тебе знать, что внутреннее представление - это utf8 ?>","498":"магазин поди","499":"А, точно. Сорри, хуйню насчитал.","500":"сам if() от этого не исчезает","501":"@PerlBanjoBot \npackage p1;\nsub p2::func { warn -qwe }\n$p3::var = bless {}, \"p2\";\npackage p3;\nour $var;\n$var->func();","502":"просто считаю это неверным :) я сомневаюсь что даже в режиме рав перл можно разрывать блоки","503":"это же получается как & в плюсах?","504":"Нормально, зато все работает как надо","505":"А есть ли реализованная на XS иерархия классов, позволяющая делать что-то вроде\n```my $x = Int->new(\"abc\"); #  exception \"you are idiot\" will be raised```\n?","506":"Антон, а не ты случаем OpenAPI в своем фреймворке мутил?","507":"обновился на новую версию марии 10.2 и получил ) Field 'xxx' doesn't have a default value","508":"Своим обучением. Надо как-то его корректировать.","509":"в пред. примере было undef , 0","510":"в секции Some basics прям черным по белому... Прочти, плиZzz 😉\nhttps:\/\/www.cpan.org\/modules\/INSTALL.html\n—-\nмогу порекомендовать:\nhttps:\/\/metacpan.org\/pod\/App::cpanminus#DEPENDENCIES\nОпции здесь: https:\/\/metacpan.org\/dist\/App-cpanminus\/view\/bin\/cpanm","511":"права на пид вообще рендома, то от пользователя то от рута","512":"на интелах не больше 5%, но есть где будет падение до 30% .","513":"Я сам бы врядли стал вываливать всю правду на человека) был опыт в собеседованиях, и иногда хочется промолчать.","514":"да ерланг-то норм...","515":"я когда-то хотел такой фильм снять, еще до того, как прочитал танненбаума","516":"Это какой-то хуевый хайлоад","517":"https:\/\/metacpan.org\/pod\/DBIx::SQLEngine\nВроде даже более понятный аналог DBIx::Struct'а.","518":"ужас, какие всё-таки до сих пор дичайшества в JSON, относительно CBOR...","519":"Пардон, если неясно выразился.","520":"попробую ) спсибо )","521":"на хабре мудацкая система, мне совершенно не хочется там регистрироваться","522":"Если-же говорить о 100% проверки на ввод, то она частично делается не на стороне Перла, так как есть ограничение на размер пакета и оно гарантирует что очень больших строк не будет. В связи с этим можно на length положить болт. Его уже проверили до Перла.","523":"так ЯП со статической типизацией не нужны","524":"Эм... Понятно что сначала надо проверить на общую адекватность архитектуры.","525":"Если пишется под спецификацию - наоборот","526":"А вот perljit'а реально не хватает. С другой стороны, если-бы он был, оптимизации типа XLog'а были-бы невозможны.","527":"Но упрется в твой код на перле стопудово даже если там просто стоит 10 строк","528":"земля налетит на небесную ось вокруг таба","529":"А почему только до тех пор?","530":"сколько человек в команде, где ты работаешь? (команда == кодят и коммитят в те же проекты)","531":"ozon\nНо я говорю только за свой отдел. У других может быть иначе.","532":"толку больше чем от оценки по vsz","533":"а это зависит от кучи всего. proxy_pass или proxy_cache, что за заголвки и далее далее далее","534":"`[ \"rm -rf\" == \"rm -rf \/\" ] && echo equal || echo \"not equal\"`\nВниательно читай, что именно сделали.","535":"Ты кому?","536":"мне не надо, чтобы он блочился. Тогда, те данные, что он принимает, начнут теряться. Или мне \"вручную\" их копить в оперативе, то тогда они не влезут.","537":"Рельсам лет семь","538":"Например","539":"Используй given when короче","540":"А то у меня мск+2","541":"Да OTRS. А что за libdir? Это use lib '\/opt\/otrs\/Kernel\/System'; ? И понятно что Perl говорит. Но модуль есть, пути прописаны. Вся система работает (иначе не работала бы). А модули не находит.","542":"А что делать то нужно? Чем православный путь не устраивает","543":":)))","544":"там вроде даже тема была про книгу по моджо, и он обещал не ломать апи в связи с книгой даже","545":"Да там все в сумме было по коду и мест приведения было много, что суммарно давало профит","546":"Было такое, только с договорами, решали так: был мастер договор, а к нему цеплялась измененная копия (точно такая же запись, но с изменениями)","547":"https:\/\/metacpan.org\/pod\/Template::Alloy::VMethod","548":"недавно же (как раз под ms) сделали безлимитные закрытые репы даже для бесплатных аккаунтов","549":"Да всё стандартно вроде\n```find . -name cpanfile -exec grep -i jwt {} + +\nrequires 'Crypt::JWT ';```","550":"sync ; echo 3 > \/proc\/sys\/vm\/drop_caches и хрен с ней)","551":"за что?","552":"я думаю лучше ссылаться на его последние работы ,в каком-нить p6","553":"ты считаешь, что люди с разной кожей — это нормально? да негров задолбаешься нормально фотографировать","554":"Ребята  вообщем всем спасибо кто откликнулся я нашел несоклько вариантво решения  этого   чуда и  с массивами и хешами все   прекрасно работает","555":"Про Perl?","556":"они считают по числу запросов в поиске, так что чем больше нубов в языке - тем выше рейтинг","557":"ну ты поругайся еще, может найдешь :)","558":"Типа на внимательность","559":"11к$ за видуху","560":"у меня вообще 8 - жить можно, если на жабе не писать и атомом не пользоваться :)","561":"простые сайты иногда вырастают, в случае с Mojo::Lite его потом тривиально можно провратить в большой сайт","562":"фидо?..","563":"(отвечая на незаданный вопрос: нет, иным способом за такой срок получить характеристику \"хорошо пишет на языке X\" невозможно)","564":"Найти девушку с последних курсов иняза?)","565":"вот я о том и говорю, что без прототипа будет лично мне не ясно как это поймёт парсер перла. может и так и этак, там эвристика. прототип заставит понимать однозначно.","566":"Вроде это относится ко всем глобальным переменным. Если вы хотите иметь к ним доступ - не лексикализируйте их. Это не значит, что все переменные, хоть раз бывавшие глобальными, нельзя нигде использовать.","567":"Рх вообще плох для перлв","568":"Что говорят то? :)","569":"я честно говоря не лез разбираться, почему так. В зависимостях EV не было","570":"в haproxy показалось более детально можно настроить\nесли в plack\/psgi, то посмотреть Plack::Middleware::Throttle::Lite","571":"HP DL360 G9 1x E5-2630 v4 (10 Core @2.2GHz)  RAM 128GB","572":"Посоветуйте плз решение для RESTful service чтобы заново не изобретать велосипед. Хочется уйти со сваггера json. Разочаровался","573":"фря ставится ничем не дольше прочего","574":"вы не на том акцентируете внимание. речь не о том как просто и быстро. а о том что чем больше специалистов - тем при прочих равных найти проще. любых - хороших, плохих, дешевых, дорогих. и чем вот заебнее язык, тем меньше желающих и умеющих на нем работать. Таким образом выбираем из меньшего количества, и  при тех же пропорциях найти сложнее. Понятно что бывают всякие девиации, типа хуилиард говнокодеров на говнотехнологии с порогом вхождения для умственно-отсталых, но это другая история.","575":"Сейчас не так? Единственный недостаток несовместимости программ убунты (на локальном ПК и лично у меня) - был один: pgadmin был старее самого постгреса.","576":"","577":"как в дельфе тебе .bpl надо таскать для чего-то реально серьезного, как в qt будет пачка dll на винде, да везде","578":"такие вот шаблонные аймейджи у нас","579":"Задача...надо сделать сервер, чтобы слушал порт и отвечал при запросе и закрывал соединение. Что-то в виде небольшого апи. Что лучше использовать? сейчас сделал с использованием IO::Socket::INET .  Для тестов пока цепляюсь телнетом. Но при отключении клиента, соединение закрывается, приканчивая и скрипт. И второй вопрос, это как лучше хранить данные до того, момента, как их запросили? Перед этим они распарсиваются и их них достается необходимое.","580":"ну-ну. Смысл my `$x; $x = $cb->{ ...; undef $x;} ;` в том, чтобы $x удалился после отработки callback'a. Можно, конечно, сделать это же с из глобальным хэшом, но это .... м, херовый подход. Т.к. код с сайд-эффектами (в перле) и надо будет ручками в глобальном хэше чистить. Если у тебя 1-2 места - то ок, а если их 100 по коду, то тебя будут бить :)","581":"настоящие?","582":"$_[0]->can('func') ?","583":"А как сделать, чтобы в Испанию начали звать?","584":"все запросы на внутренний кэш имеет смысл отправлять на один ioloop-процесс с картой в памяти","585":"Причем в вариантах, к примеру рассылки смс ч.з. мтс, все-тоже самое работает, и не ругается ни на какие сертификаты","586":"Так кеширование просто последнего результата уже дает предельное ускорение для меня","587":"Если появляется необходимость делать рекурсивные запросы в бд, то кто-то накосячил с архитектурой кмк","588":"не AE единым\n\nпт 22:16:53 <daemon> yo LeoNerd, you are likely busy fighting server re-birth but a curious aside if you have a moment, is there anyway you could use effective 'sessions' like as is present in POE with async, say I was using three async modules Net::Async::IRC Net::Async::HTTP and err IO::Async::Timer::Periodic, could I somehow make it that each was absolutely isolated from one another and have delays and posted events within their own scope\nпт 22:30:18 <LeoNerd> ??\nпт 22:30:26 <LeoNerd> What do you mean \"events posted\"? That makes no sense\nпт 22:30:48 <daemon> trying best to describe what I am looking for and how to write it\nпт 22:30:52 <LeoNerd> You're doing that thing where you take the complicated and weird invented structure that is very specific to POE, and believing it is a more general concept that applies elsewhere\nпт 22:31:25 <daemon> is it realy that weird\nпт 22:31:54 <daemon> it seems so neatly packaged","589":"3 часа ждать не хотелось, но тут я увидел время и забил :) К утру соберется :)","590":"кстати, про флуд. Можно было бы разделить этот чат на два момента - типа \"Perl программисты\" - ну, где это общение всё, пожалуй, интересное, и, условно, \"Perl Seriosly\" - где именно по теме конкретики языка общение","591":"чем всё. reverse же","592":"даблин. если оставить по дефолту (8бит), то работать будет. но я хотел сократить размер картинки за счёт уменьшенного алфавита","593":"Вчера в чятике погромистов была прохладная история о челе из Румынии, которого наняла контора в Нидерландах по контракту, они ему оплачивали раз в неделю самолёт туда-сюда и 5 ночей в отеле в неделю.","594":"я не зря просил синтаксис, по нему видно что он не может выполняться асинхронно -- у него нет никаких араметров про нотификацию завершения","595":"нам сказали про \"дистры\", значит речь не про фряху и не про макось","596":"Мне удобнее\n```if (my $var=func() and ($var eq \"something\"  or $var ne \"something_else\")) {```\nТут особенность в том, что во многих других языках переменная просто создаётся при первом присваивании, а вот scope её может вывалиться за пределы желаемого - ты просто этого и не \"увидишь\" явным образом.","597":"Проверь с одинаковым блоком","598":"Во времена когда я пытался освоить микроконтроллеры - у пика был совершенно уебанский тулчейн которому нужны были программаторы за тонны нефти. Авр был сильно демократичнее и программатор колхозился из подручной рассыпухи 👍","599":"прикол тут в том, что есть закон против спама, значит оно под него не подпало","600":"price = 123.456","601":"ага, постгрес","602":"https:\/\/catonmat.net\/perl-book","603":"something like this. no \"counter\", no uuid...","604":"чому? надо просто правильный фреймворк выбирать :)","605":"тьфу, в гугплее. заговорился.","606":"Типа","607":"Этот чат самый уютный из тех что у меня есть","608":"но сообщения компилятора об ошибках парсить -- ад. шаблоны шаблонов, завернутые в шаблоны. И это только STL","609":"да при чём тут нагруженность","610":"А я не исключение. Я обычная женщина.","611":"из этого следует остальное","612":"Если вам надо скорость в рантайме оптимизировать, то предварительно рандомизируйте и берите за один rand","613":"ещё зависит от перспектив, что ты себе представляешь","614":"Нас устраивает то что есть.","615":"ООО, эксепшены","616":"а тут тебе на помощь и приходит докер","617":"А если серьёзно, то фреймворк от Антона, который никто так и не может обкатать","618":"Я думаю эти 12 в гугле бигдату ковыряют?","619":"Ни разу этот кусок не выставлял","620":"А чем не нравится https:\/\/perldoc.perl.org\/functions\/flock.html ?","621":"Хеш слайс начинается с зобаки","622":"при профайлере","623":"А, так никто и не хотел. Скорость и компактность в памяти -- это то, чего в перле никогда не анонсировалось","624":"быстро неделя прошла хахаха","625":"рили работает если перенести на другую строку","626":"first, sec, *middle, prelast, last = var # )))","627":"коро допускается?","628":"perldelta для 5.30. ещё даже на cpan не выложили... утром. Сейчас может уже.","629":"это потому что производители не хотят упаковывать и продавать. А ведь не ракетная наука в общих чертах","630":"Ну тут все упирается в твою работу с клиентом, как ты с ним работаетшь","631":"в твоем примере - задача изменилась","632":"Да, пермабан","633":"`Module->method` ваще странное изобретение","634":"привет, отлично, рады видеть )","635":"Теперь попробуйте меня переубедить.","636":"через GD","637":"вот вы тут топите за пг, а вот тогда расскажите про запуск заданий по расписанию, в сравнении с тем же оракуле, в котором это дело встроено в базу","638":"чо ты палишь сразу","639":"и setup.ru - перл","640":"угу, только он и идиосинкразию с null vs undefined унаследовал от JSON","641":":), не у меня без криминала, вполне гражданский сервис, но пока не могу рассказать. DND.","642":"ну хз, баги без тестов не смотрит, точнее говорит, что их нет","643":"оптимизировать аксессоры никогда не рано","644":"Да не факт,  у меня в одном коде было требование к количеству разрядов милисекунд и падал он весьма часто из-за отброса нулей","645":"Зависит от того, что там у тебя за существующий код, точнее, делает ли он I\/O (бд, редис и тп)","646":"вот это вот неправда, метод называется HMAC","647":"да, ```goto &name``` наверное единственная практичная форма goto )","648":"1. не обещать 2. не спать, выбираешь пункт и следуешь :D","649":"Да","650":"telnet, rsync - давно уже не комильфо, \"ssh и только...\"","651":"ну это понятно, но вдруг нативное средство есть","652":"железка рульная. ос на любителя","653":"А что касается присоединения - посмотрим, кто и что там будет обсуждать. Мне пока непонятно, будет ли для меня какая-то ценность в новой группе помимо той ценности, что этот чат станет чище и не будет блистать обсуждениями того, кто какую версию Windows использовал 20 лет назад.","654":"есть что-нибудь ещё кроме DO в зарубежье, где можно vps арендовать?","655":"делается просто monkey patch'ем. См у Риделя https:\/\/github.com\/mojolicious\/mojo\/blob\/master\/lib\/Mojo\/UserAgent.pm#L34","656":"Максимально производительный код","657":"У нас есть такие ракеты...","658":"Хотя нет... COD - это Call Of Duty и понимайте как знаете","659":"Я тоже так сначала подумал, но потом стёр букву :)","660":"самый крутой, ессна, мой :) но я его не релизнул на цпан :)","661":"в июле, и могу хоть завтра зайти, если пароль вспомню","662":"цэ не шутка юмора — цэ медицинский факт\nпо крайней мере, в этом календаре месяцы по всему году не ездят","663":"Это перловые треды. Они копируют память.","664":"Монс?:)","665":"с форками проблем нет\nесли вынести это в отдельный воркер, то все работает как часы\nпо такому принципу сделаны другие задачи\nмне хотелось именно понять, почему AnyEvent при вызове из цикла тупит","666":"my $bool = all { BLOCK } @list;","667":"можно. Сейчас ввод происходит силой мысли!\nhttps:\/\/youtu.be\/5Z5aZK2C3ew?t=589\n\nсамая жара на 11:30","668":"Ну вот видишь, есть же очевидные методы ресета :)","669":"Кто нибудь пользуется Dancer2 и OpenAPI?","670":"там, где в перле решает операция, в жс приходится заботиться о типе перд сравнением и вообще при этом не пользоваться `==`","671":"Это правильная, короткую форму около нулевых отменили","672":"```my $player = new Audio::Play::MPG123;\n$player->load(\"time.mp3\");\n# print $player->artist,\"\\n\";\n# $player->poll(1) until $player->state == 0;\n \n# my $player->load(\"\/home\/good\/perl_learn\/perl_play\/hellotime.mp3\");\n\n\nmy $input_string = <STDIN>;\nif ($input_string == 0) {\n    $player->stop;\n    } else {\n    say \"All ok!\";\n    $player->poll(1) until $player->state == 0; \n    }``` играет минуту и ждёт ввода от пользователя. \nесли делать while, то происходит тоже самое.","673":"очень удобно, а главное, что никому не мешаешь при этом","674":"тогда ждите докера в следующих сериях :)","675":"Да","676":"```cgi-bin\/\n  common\/ - замонтировано\n  index.cgi```","677":"http:\/\/pragmaticperl.com\/issues\/20\/pragmaticperl-20-%D0%BB%D0%BE%D0%BA%D0%B0%D0%BB%D1%8C%D0%BD%D0%B0%D1%8F-%D1%83%D1%81%D1%82%D0%B0%D0%BD%D0%BE%D0%B2%D0%BA%D0%B0-%D0%B8-%D0%B8%D1%81%D0%BF%D0%BE%D0%BB%D1%8C%D0%B7%D0%BE%D0%B2%D0%B0%D0%BD%D0%B8%D0%B5-perl-%D0%BC%D0%BE%D0%B4%D1%83%D0%BB%D0%B5%D0%B9.html","678":"нет! тыыыы","679":"Отвечая на ваш вопрос: while(<HANDLE>) читает по записям. Терминатор записи является то, что вы передаете в $\\ по умолчанию там \\n. Скорее всего у вас строке Username: нету \\n.\n\nЧтобы решить это вопрос вы можете поставить $\\ = undef. И собирать то что пишут самим (в вашем случае новая строка для вас будет или то, что до первого \\n или если прошло больше х времени, допустим)","680":"антон страдал, что у меня никнейма не было, от того ему (вроде бы) приходили нотифаи что для меня должны были быть","681":"А, ну оно искаропки работает же","682":"Ну классические жабные - фабрика фабрик фабрик и полетели на динамической загрузке","683":"Без тредов. Более того у тебя, скорее всего, кастомный перл...","684":"В этом нет проблемы, vbox потянул gcc, собрался и работает, например. И?","685":"Я до сих пор там учаснегом числюсь","686":"А что сейчас рулит из логгеров? Чет log4perl утомил малость","687":"при чем  тут лотерея? речь про рабочие H1B","688":"т е ради незначительной фигни придётся заставить всех поднять версию перла","689":"да они просто завидуют","690":"ктонить тут пользуется линуксом на десктопе? lxle дистрибутив пробовали? мне для дохлого ноута надо","691":"Видимо на линкедине хантят?","692":"не, он прав, есть такой вариант","693":"это профанация. если уже есть wss, то нафиг не нужен ксор, он не добавляет реальной секурности","694":"незнание темы детектед )","695":"timtowtdi же","696":"да, можно по всякому. можно тупо держать в объекте хэндл, а далее как угодно его маппить","697":"во внутренний хэш я паршу","698":"это для jobs тема уже","699":"единое пространство переменных и функций в питоне — повод для веселья. назовите переменную len...","700":"это да ) переписать все на вью с яваскриптом )","701":"Ну кстати, перл на серваках в основном живет, поэтому и приватные репы. Да, мои аргументы спорные","702":"аа, понял","703":"Если тебе действительно нужны фичи оракла, то пг тебе не поможет примерно никак","704":"для картона папка local делается per project","705":"Setting one of the bind_values to \"undef\" is the equivalent of setting       the value to NULL in the database. Setting the bind_value to\n       $DBDPG_DEFAULT is equivalent to sending the literal string 'DEFAULT' to       the backend. Note that using this option will force server-side\n       prepares off until such time as PostgreSQL supports using DEFAULT in       prepared statements.","706":"Please send me up to 10 links and I will update previews for them.","707":"2 3 4 5 6 7 8\nhttps:\/\/PerlBanjo.com\/b9d3a3b760","708":"А зачем нам искать людей которые считают что горутины спасут мир и пересаживаться на не ACID'ную базу? Зачем вы хотите нам плохого?","709":"или магия навешена","710":"Скажи - а зачем ты работаешь в индустрии?","711":"они вроде не требуют чтобы между ними выбирали. урбан не впечатлил меня пока никак","712":"Странно видеть людей с windows на Perl","713":"`> eval { dangerous_effectful_things; } то вариант с \"or do {}\" не сможет ничего сделать.`\n\nс какой радости `or do {}` не сможет ничего сделать?","714":"вот тут ты больше специалист, я на перле текстовый уи не писал ни разу. зачем, когда есть веб, а сильно хочется —`elinks`","715":"в сообщении об ошибке он сам убирает кавычки","716":"там не все","717":"нет, 64","718":"да и щас уже гуй разумнее на жс","719":"и тебя вылечат","720":"телефон в кармане не той стороной","721":"так значит коннект-то есть","722":"Но ведь даже в JS смогли!","723":"Там что-то кроме роутинга и рендеринга шаблонов есть?","724":"Ну мы же говорим о простом сайте","725":"пальцем покажи","726":"http:\/\/search.cpan.org\/~mlehmann\/AnyEvent-7.14\/lib\/AnyEvent.pm#FORK","727":"Сильно сомневаюсь. Для того чтобы такой сервак собирал медленнее на нем должно быть 1000 разрабов","728":"С моей точки зрения, он первый начал :)","729":"*я имел ввиду сишный код :)\nНо да, хотя бы юнит бы прогнали...","730":"или тот же gitlab-ci","731":"Абстрактные классы есть почти во всех ООП языках (кроме Перла)","732":"те же доки по либам в консоли не посмотрижшь, в веб иди","733":"Да ну, этого можно избежать же","734":"факт в том, что удаленщики менее эффективны, но за счет меньших затрат выгоднее (там не только зарплата)","735":"Highload - очень, крайне узкая ниша, которую поминают часто вообще не к месту. У них там проект с сотней юзеров и сотней поисковых ботов, а замашки архитектуры делаются на миллионы. Потому, что в тренде должны быть","736":"Вообще заход \"всем хочется быть на гребне волны\" сам по себе спорный. Типа не пиши на том, что нравится _тебе_, пиши на том, что хайпят _другие_.","737":"до моджо апгрейд не доходит и он не считает реквест вебсокетом","738":"основной вопрос в синхронизации. ты не можешь анализировать ту память, что меняется","739":"полторы секунды примерно","740":"Dancer2:\nopen( my $fin,  '<:encoding(Windows-1251)', $self->datafile )  or die \"Could not open file $!\";\n\nmy $csv = Text::CSV_XS->new( {\n        sep_char    => ';',\n        quote       => '\"',\n        decode_utf8 => 1,\n        auto_diag   => 1,\n    }\n);\n\n$csv->getline( $fin );    # здесь ИНОГДА ошибка \nwhile ( my $row = $csv->getline( $fin ) ) { ... };\nif ( not $csv->eof ) {\n    $csv->error_diag();\n}\n\nИногда возникает ошибка:\nRoute exception: Can`t locate object method \"\" via packeage \"IO::File\" и все следующие операции чтения (вызовы модуля) валятся с такой ошибкой.","741":"В Москве - ну, в три раза больше","742":"Аааа... Понятненько. Пойду отстойное писать дальше :)","743":"Deparse для 1\/0:\n```$ perl -MO=Deparse constant_use.pl\nuse strict;\nuse warnings;\nuse constant ('DO_OPTIONAL_WORK', 1);\npackage another;\ndo {\n    print \"doing!\\n\"\n};\nconstant_use.pl syntax OK\n\n$ perl -MO=Deparse constant_use.pl\nuse strict;\nuse warnings;\nuse constant ('DO_OPTIONAL_WORK', 0);\npackage another;\n'???';\nconstant_use.pl syntax OK```","744":"а то древние перловики до сих пор не знаю о метаспане","745":"так, значит, все решения по 30 были не по той задаче?","746":"усложняем задачу у тебя 100 лярдов записей","747":"и одних и тех же запросах","748":"когда надо, то я","749":"во всех. Компилер хавает и гененерит бинарь","750":"ну да, есть такая авторская особенность )","751":"Чтобы не реализовывать клиенсткую часть API, поскольку уже есть от вендора","752":"отоночо","753":"либо задаю вопросы )","754":"\"эс как доллар\" ©","755":"А так понятно... Ты на каждую строчку на сервере выводишь Hello\\n","756":"если получается настроить проект в пайчарме, то это отличная штука","757":"пузырёк это вообще ровно два фора. я скорее про шелла думал","758":"Носком = глюком","759":"> What Perl 5 version do you use?*\n> Please select no more than 6 options.\nwtf?","760":"если точнее, значение будет идти в списковом контексте сразу после соответствующего ключа, но порядок пар не определен","761":"CGI -- форкается сервер и делается exec приложения с оформленным ENV, stdin\/out в сеть, err в лог, pwd в docroot и uid каким надо","762":"в общем резюируем — tsv к использованию непригоден","763":"https:\/\/t.me\/tarantool","764":"+1","765":"кому страшно, кому не очень","766":"я из того чата свалил. там разговоры только с ним и велись","767":"Продолжай писать на Perl","768":"драг металлы","769":"Он за что-то ответил вообще?","770":"вторая учетка тут висит","771":"ну с точки зрения перла все-таки 2\/3 + 3\/4 != (8+9)\/12","772":"но оно ж просто 0 не словит вроде как","773":"осталось заменить баш перлом","774":"А ты навороти на нем сложную логику так, чтобы глаза на лоб не лезли?)","775":"Я с современных плюсов сам в шоке","776":"Там не любят лемана","777":"хотя, я что то много начитал. в каждой тройке можно третий запрос не делать, если первые два гуд","778":"дай делает","779":"Да","780":"Смысл читать неадекват, его хватает в реальной жизни.. по зомбо ящику, от проходящих людей негатив прет даже не открыв рот","781":"Кажется ошибка","782":"ну тогда да. на текущем месте мне ещё на собеседовании обозначили проекты которые требуется реализовать. и в первый день за них и усадили","783":"Есть, кстати, перегиб этого нежелания костенеть - это хайп в ИТ... То есть бросаться на все новое. Например так было с XML, NoSQL и еще много чем.","784":"а etag смотреть нельзя?","785":"asshole-free workplace - фраза из джоб-оффера. прикольно","786":"в смысле по слову foo умеет вставить $foo?","787":"я не вижу семантической разницы","788":"а ты смешон (:","789":"я понял свою ошибку","790":"Не помню чтобы Льюис патентовал белых кроликов )","791":"Я тоже!!т!","792":"я лично операции над одним исходным списком выравниваю с одинаковым отступом, чтобы по 1му ключевому слову легко было понять последовательность преобразований","793":"`perltidy` умеет подобное","794":"Да :)","795":"с денсером еще большая разница между 1 и 2. И я что-то не помню чтобы кто-то замерял производительность отдельно","796":"это всего лишь вопрос выбора сектора приложения головы","797":"ну т.е. в контексте веба я не могу придумать какую задачу он мог бы решать лучше","798":"там сказано же что нужно один модуль взять с гитхаба, а не с цпана","799":"ну окей, и каким же образом?","800":"Может быть ты ещё и на си программировать умеешь?","801":"Идея со старта жрёт 1 гиг","802":"Ну может данные складывать в бд , а потом по крону их обрабатывать ?)","803":"Я гуглил и у меня сложилось впечатление, что этот паскаль - это какое-то импортозамещение наше, нихрена нигде не известное","804":"http:\/\/modernperl.ru","805":"с периодическим полным перестроением этого индекса","806":"о как","807":"нету","808":"Гуглянул - по описанию, там interpreter threads, как в perl + возможности явно шарить переменные (не знаю, лучше или хуже чем наши threads::shared). Но не похоже, что это \"всё хорошо\".","809":".ну вариант ИП я рассматриваю, а не найм","810":"Ну пусть твоя фс показывает всегда пустой листинг файлов, без ошибок. Пишиешь пишешь, а она пусто","811":"просто парсинг меняет","812":"Зачем вам это ?)","813":"на этом-то кастрате?","814":"Читайте документацию. В обычном случае никто вам email не даст. Это отдельный пермишен.","815":"https:\/\/youtu.be\/74_7LrRe5DI","816":"ну так что там про перл? надо от лемана ставить?","817":"Плюсую, но только на Mojo. На LWP чего-то его плющит иногда.","818":"пример из доки:\n  my $var :shared;\n  {\n      lock($var);\n      # $var is locked from here to the end of the block\n      ...\n  }\n  # $var is now unlocked","819":"Так я же сказал :)\n\nЗаменять на 4 проблема при серелизации в tsv (и это означает что отбрано рассерилизовать таб нельзя)","820":"tl;dr","821":"`for my $e (map {($h{$_}, $_)} keys %h)` — оптимальность этого выражения смущает","822":"40 лет я админю локалност на собственной ос на компе, собранном мной из палок и желудей в возрасте 5 лет, по чертежам из журнала мурзилка))","823":"Я старый колхозник и не знаю слова \"идеология\" :)","824":"классика же","825":"разные... сравнивал","826":"Я просто не стал усложнять, но вы абсолютно правы, это как раз для таких случаев полезно. Только в реале там циклич ссылка не прямая а косвенная (через несколько проксей)\nВ событийном программировании часто встречается","827":"таак, усложним - чтобы можно было регулировать количество слов в результате","828":"В си это ещё и постоянный goto _error","829":"и видимо, react вместо vue, как более распространенное, для болванки важно","830":"```As mentioned in Chapter 2, by default variables are immutable.```\nВот это вот их mute \/ \"выключить звук\" - тоже из серии \"давайте сделаем умный вид, веь это так это дёшево: нужно просто знать побольше тупых баззвордов\". Мутирующие переменные, немутирующие переменные...","831":"Единственный side-effect сейчас, думаю, это вот такой способ вызова: https:\/\/perlbanjo.com\/38be7adf25\nПопробуй закомменить forward declaration","832":"На самом деле, руби позиционируется как язык, на котором легко написать eDSL","833":"Запушить массив в список и взять на него указатель","834":"да щас уже обсуждаем , в kiev,pm skype чате","835":"Не, не помню уже.","836":"абсолютно укуренный рейтинг. посмотрел карлсруе.","837":"there are only two really hard problems in Computer Science - cache invalidation and naming things (c)","838":"Давай не так","839":"это вот единственное что есть щас, наколько я понимаю","840":"если trim ты уже юзаешь по факту, то как ты его не импортируй, всё равно от зависимости не избавишься.","841":"а он отличается от руби? не подойдёт rack?","842":"Потому что я профессионально занимаюсь преподавательской деятельностью, кроме прочего","843":"у меня лежат в базе урлы к реальным релизам","844":"По большей части соглашусь.","845":"а я так понимаю он тебе не нужен совсем","846":"перловый регекспы быстрее","847":"речь про структуры что уже в памяти, какая разница как они внешне представлены?","848":"у нас денди рулил в основном","849":"stew 4ever","850":"Не понял про прибитую схему.","851":"схема для общения С ЛИБОЙ","852":"если найден баг, то значит код не выполняет поставленную задачу, и его определенно надо трогать","853":"Эм... Даже не знаю что вам сказать... Студенты - знают как пример того что иногда надо засунуть книгу про совершенный код в задницу. Да и сам по себе код меметичен как пример того, как можно оптимизировать вычисления.","854":"да на говнокод-то по хуй, лишь бы он читался и понимался","855":"Эм. Что бы \"это сделать в new\" нужно сначала загрузить пакет, где этот new доступен.","856":"И да, и нет. Было бы желание, а причины не апгрейдить окружение найдутся.","857":"загнать миллион компов госструктурам и уже что то","858":"у жс-а нет ручки для этого","859":"my $req = 'A'*2048; * -> x","860":"а как по процессу на соединению, так это уже не особо нормально","861":"какая разница, пива дадут)","862":"Наоборот, сложно бывает допроситься, чтобы передали","863":"ну так баг в архитектуре, нет?","864":"В голове летают мысли, что вот собрал ты его автоматом в CI, и надо его кудато положить, но не в тот же репозиторий, и в приложухе просто разворачивать по версии коммита","865":"А, дык она дольше работает, чем алгоитм Евклида","866":"Кто какую ос использует под проекты. Всю жизнь сижу на freebsd, но под неё selenium не запустишь, нужно перетекать на другое. Что же будет максимально близко к сабжу?","867":"а Джоэль вообще полезное чтиво, вот хоть тот же Law of Leaky Abstractions","868":"триггеры да, немного могут запутать, но с хранимками не пойму в чем проблема","869":"просто скорость будет одинаковой, или даже больше, если прочтете маленький обьект","870":"Ну, не то чтобы это структуры данных из C++, просто структуры данных - hash, map, set","871":"но у нас нет ни одного годного генератора до сих пор","872":"Это было бы непонятное поведение","873":"Щас пойду - спрошу...","874":"После того как тебя не устроит человек. Для этого испытательный","875":"кому не нравится, может пользоваться alma и rocky. не вижу проблем","876":"Интересный доклад по перл6. Так же Пуштаева было хорошо слушать, очень бойко докладывал :)","877":"сколько звёзд?","878":"Я про работу через SSH, без клавы и монитора","879":"https:\/\/github.com\/vickenty\/perl-xs","880":"я не понял ни рубевый пример, ни даже перловый","881":"Хотя про бота вопрос искренний","882":"не - go совсем не простой","883":"ну мне непонятно, зачем юзать шаблонизатор, который в 200 раз медленнее","884":"уж лучше и правда FTS","885":"Нет, там был движок самописный с поддержкой cgi\/mod_perl. Но был запущен на cgi. Переписывать ради переписывать смысла не было, а вот mod_perl включить - быстро и недолго.","886":"Process.wait2","887":"На каком примерно объеме тормоза начинаются?","888":"давайте лучше о Perl, какой он классный и удивительный","889":"Вон посмотри на то, что я выше запостил :) мне для его парсинга придется в доки по перлу лезть","890":"I will just use English next time","891":"Прикол в том что Кнут довольно адекватно пишет, надо только не с начала его читать","892":"http:\/\/stackoverflow.com\/ лежит =)","893":"> perl как-то меняет счётчик ссылок\n\nНикогда не задумывался над тем, что внутри цикла можно изменять размер массива.\nБудет ли это менять количество итераций цикла по 1..$#foos ?\nИли $#foos перед циклом единожды вычислился, как-то хитро \"обконстантился\" и потом размер массива хоть меняй, хоть не меняй, а количество итераций останется неизменным?","894":"ага","895":"И вроде как на питон переписывают перловый код","896":"это вот к вопросу о психологии - такие вещи надо уметь отслеживать","897":"Как кодируются понятно,там просто 3 канала и интенсивность в файле лежит вопрос только в выборе палитры.","898":"Я не понимаю твой вопрос","899":"Надо открыть фирму по сборке компьютеров, лол","900":"Наверное, надо автора спросить","901":"тк подделывая ответ - чтобы пришло чтото вменяемое надо реально сбрутить ключ","902":"Таки может","903":"Привет Вике","904":"Есть общие вещи, а есть частности. Чем больше общих для разных языков вещей - тем лучше. Собственно, я недолюбливаю Rust именно за то, что в нём мир переизобретали заново, придумывая хрень на плетень и нагромождая угловые скобки.","905":"Подскажите, есть тут те, кто работает с Raku или хотя бы pet projects на нём делал?","906":"```$ which perl\n\/home\/anton\/perl5\/perlbrew\/perls\/perl-5.22.3\/bin\/perl```","907":"я хочу к мониторилке прикрутить телеграмм","908":"ну и задача генерации простых чисел — математика, а это не может быть сильной стороной интерпретаторов","909":"правильнее так\n\n`@new_arr = map { (my $v = $_) =~ s\/\"\/\/r } @old_arr;`","910":"`[^.](\\.{2}|\\.{4})(?:[^.]|$)`","911":"только дуракам нужен порядок, гении господствуют над хаосом!","912":"Я так делал, когда мы решили паковаться в rpm.\nВ итоге получился длиннющий однострочник, который оставлял в списке только те модули, для которых не было пакетов в репе центоси. Мы их дособирали и клали в локальную репу. Очень страшная штука.","913":"это ж насколько древний должен быть браузер, что в нём вебсокета нет?","914":"на мой взгляд, это бесмысленный вопрос","915":"а если не работает, то просто перезапуск в cron каждые 10 минут? :D","916":"Нет, ни разу. Есть вектор 1e+6 элементов, нужно заполнить результатами вычислений, каждое вычисление независимо от других. Сделать - и передать дальше (по сети условно). И где здесь позарез нужна синхронизация потоков?","917":"Лол. Вообще я подозреваю, Монс имел в виду именно отстойность C++ в связке с перлом, а не в общем.","918":"почему это у сишника будет больше перловика","919":"а чего не поставишь? :)","920":"94234240059200\nhttps:\/\/PerlBanjo.com\/4956082b6b","921":"Я просто не сильно погружался туда. Я думал, что если хотят апнуть мажорку, то будут координальные перемены.","922":"сделай какой-нить `slow` для таких запросов и рендерь их там","923":"сами версии перла парсят это по-разному?","924":"ну да, щас бы верить этому всепропальчеству","925":"на этой книжке чуть не разорился ibm","926":"самое простое - host only интерфейс поднять.","927":"ну, это уже другой слой, повыше","928":"напомни нахрена он там?","929":"и долго колодовать над анроллингом","930":"т.е. это по сути \"напев по телефону\" вот этой вот задачи, я считаю","931":"хз, мне что производитель стораджа, что факты из их личной жизни глубоко пофиг :)","932":"пусть начинающий поставит нормальный редактор","933":"ты его будешь 5 лет мониторить перед запуском в прод?😱","934":"ну тогда тупо return \\%hash","935":"ну про кэши никто не спорит","936":"День Святого Валентина?","937":"имеет полное право. и если ты не его инвестор, то он не обязан отчитываться даже","938":"delay ни разу не юзал ... надо обратить на него внимание :), спасибо","939":"io::select ))","940":"Потом он стал только на локальном порту слушать по дефолту","941":"++","942":"Там просто нет  формата как такового.","943":"перл\/гтк — ну может быть, не пробовал","944":"или я что-то про него не знаю?","945":"ни что не умирает пока этим пользуются. 🧐","946":"был...","947":"Ладно, я на пузырёк намекал ))","948":"«удобство» -- это субъективное понятие :)\nБольшинству моих знакомых, например, тайлинг не удобен. Им вообще кеды или Винду подавай и мышкой возюкать","949":"Да, точно, раст говно","950":"чоетаващетакое?","951":"Да, не далее как вчера здесь был его автор :_)","952":"но как? :)","953":"useless dancer irc...","954":"@PerlBanjoBot $ whoami","955":"Сори, я возможно не в теме, прочитал пару записей сверху.\nЯ вижу картинку с сертификатом. Как вы узнали, что там ssl v3, а не tls 1.2?\n\nКакие алогритмы поддерживает сервер - знает только сервер, а клиент узнаёт об этом в сообщение, кажется, server hello.","956":"или `model.pm` так?","957":"а теперь разверни контейнер для докера в jail","958":"или локальные эквиваленты","959":"Data::Entropy, Crypt::Random, Math::Random::Secure, and Math::TrulyRandom.","960":"Но даже так, это не меняет того, что сматчит `a.a@b.b@c.c@`","961":"Я такую риторику уже видел на хабре от оберон-долбоебов.","962":"на цпане малая часть их только","963":"До чего он серый и страшный","964":"это что за идея копировать свои ключи на проверку на другой сайт?","965":"нет","966":">* 90% времени отазоустойчивость не нужна \n\nВ мемориз!","967":"смотрю этот отчет","968":"наверное. Я просто использую все что выгодно) невзирая на какие-то такие субъективные моменты в этом вопросе","969":":)","970":"пытаюсь понять, как это тут работает","971":"`\nreturn $self->render( openapi => { success => JSON::false, status => HTTP_NOT_FOUND, errors => [ \"No info\" }, status => HTTP_NOT_FOUND );`","972":"Только за это коллеги побьют 😂😂😂","973":"чёт я думаю у тебя просто база не подгруженна","974":"осталось понять почему exit code 2 😁","975":"Подскажите - никак не запомню - был какой-то проект (точнее есть) - типа ansible - но только на perl… постоянно забываю его название","976":"там надо верстать по-особенному, если хочется пдф и ртф из хтмл\nмаксимально упрощенно и лучше на таблицах всё","977":"++","978":"я начинал учить даже","979":"чего хватит?","980":"с целью отвязки от базы, так что нет","981":"именно. Они должны быть хорошими, а не случайными","982":"или все также wpasupplicant.conf руками править?","983":"а через морбо ок?","984":"Ниже утверждается, что вместе создавали. Подробнее надо искать ;)","985":"Ага, называется Inline::C","986":"я конечно могу на си написать этот кусок, но это уже будет читинг :)","987":"сигналы да... сегодня как раз ликбез проводила по SIGCHLD и waitpid","988":"Последние несколько лет — emacs","989":"в чем идиотизм?","990":"если речь про данные напрямую из дб, то некоторые орм умеют правильный TO_JSON","991":"Рассказать, как мир устроен","992":"В линуксе есть мандатори лок? Я отстал от жизни, похоже","993":"","994":"так себе повод","995":"Кстати, реально, зачем в логи нехорошие буквы писать?","996":"Use feature","997":"https:\/\/corp.mail.ru\/ru\/press\/events\/395\/","998":"Посмотрите, как круто можно писать perl код с помощью голосового ввода — https:\/\/www.youtube.com\/watch?v=Mz3JeYfBTcY#t=21m33s (это ссылка на точный момент в высуплении, тут показывается демка, а в самом высупленинии рассказывается почему приходится вводить голосом (болезнь  Repetitive strain injury), что за софт (https:\/\/talonvoice.com\/) и как все это работает )","999":"Запускаю psgi через twiggy, перед запуском приложения средствами ae::http выкачиваю куски конфига, как правильно притормозить запуск приложение что бы прошёл ае ?"}}