{"text":{"0":"вообще эту строку читает только шелл","1":"а где посмотреть скок она может жить?","2":"Ну, у меня там две кнопки, а функционал только в одной, поэтом думаю мне сойдёт))","3":"Понял 😂","4":"Где ты увидел начало файла, кстати?","5":"Нет никаких проблем.","6":"от более старой даты более новую","7":"нахуй - хороший метод","8":"Т.е. нет","9":"Вот из за этого я спрашиваю почему мой код работает","10":"MS SQL","11":"Спокойной ночи","12":"__\"Не брат ты мне, гнида черножопая\"__","13":"Я не могу это показывать но я знаю что это даже возможно и мне","14":"а","15":"Пон","16":"Сформулировал и нашёл\nhttps:\/\/stackoverflow.com\/a\/13353458\/5973911","17":"ну разве что когда с них имя начинается","18":"orm это классно, потом как-нибудь надо будет на него перейти. Сейчас не с руки","19":"та откажись от него\nнервы дороже","20":"сам","21":"ну эт совсем конечно глупо (с моей стороны), но мисс клик возможен был","22":"Ты план оптимизации видел?","23":"как это относится к моему вопросу?","24":"Запросы уровня $data.select('column': 'value') или как там у них уже списки делаются","25":"С питона более старой версии","26":"Здравствуйте, подскажите есть ли какая библиотека работающая с конвертированием файлов, или API сервисов используется?","27":"это кто?","28":"Я спросил есть ли люди с которыми можно отработать перевод терминов машинного обучения","29":"Вопрос по организации структуры db. Я правильно понимаю, что в рамках какого-то юзерского сервиса, пусть это, например, будет многопользовательский блог - лучше создавать отдельный table с постами конкретного юзера, а при выпиливании юзера этот table дропать чем держать таблицу со всеми постами всех юзеров - верно?","30":"погугли что такое csrf и как оно используется","31":"что понадоиблось? парсить реплоит? при чем тут курс","32":"Вот некрасиво удалять свои сообщения","33":"Можно кинуть ишью в пайдентик, чтобы запилили третью версию на базе адаптикса","34":"Я писал, когда меня спрашивали","35":"может","36":"Там может другой вставляться, попробуй из файла вытащи байты этого символа и сравни с байтами вставленного","37":"@Tishka17 🤔","38":"Это что фласк?","39":"погуглил параметрические тесты?","40":"Оцениваю свои знания-ниже дна.","41":"Не имеет значения, но основная масса нейросеток же пишется на питоне","42":"Причем тут хуй? О какой джанге ты говоришь, и почему она ебаная? Я тебя понял, я лишь показываю что тебе следовало бы называть вещи своими именами в общении со мной.","43":"list(dict.values())","44":"`find d:\\1\\*.txt \"11\"`","45":"","46":"наверное, таким тугодумом быть невозможно..а может он просто пхпшник?","47":"Semaphore в коде реализовать проще и в целом конструкция меньше будет\nНо не будут ли 600 корутин с обычным get перегружать event loop?\n\nА Queue по сути имеет только 30*2+1 корутин \nДля меня сейчас важнее скорость, а не производительность","48":"мне aiogram нравится..","49":"\/mute 180d спамер тг","50":"Ругается pylance: `Expression with type \"tuple[Unknown]\" cannot be assigned to target tuple\n  Type \"tuple[Unknown]\" is incompatible with target tuple\n    Element size mismatch; expected 2 but received 1`\n```foo = np.unique([1, 1, 1, 2, 2, 3])\nfoo_dict = {k: v for k, v in zip(*np.unique(foo, return_counts=True))}```\n\nкак сказать что возвращаемый тип от np.unique это Tuple[np.ndarray, np.ndarray] ?","51":"Нет. Для отправки запросов на апи нужно это было.","52":"по нажатию отсылались","53":"Есть ещё и :=","54":"😂","55":"можно подумать что неасинк-бот у них бы работал :D","56":"except может ловить определённые ошибки","57":"Яне говорил равнозгачны","58":"я возможно не совсем понял задачу, но звучит так как будто у вас просто нет кода который обрабатывает такую логику","59":"ну хз, это что-то из разряда bare except","60":"Надпись killed скорее всего означает. что процесс пристрелила система (скорее всего через OOM). Если это так, то никакой строки с ошибкой не будет, скрипту просто не дадут ничего сказать.","61":"бентли","62":"для скоростных вещей лучше одну сессию держать, в ней же keepalive","63":"кароче и так сойдет)","64":"Классный графический интерфейс","65":"Хаос и анархия","66":"в каком формате время?\nи причем тут тк","67":"У меня проблемы с контекстом (в тасках необходимо соединяться с БД через Flask-SQLAlchemy, но контекст не передается) и хотелось бы явно отдавать таски обработчику celery.","68":"у него было дЕверсифицируй","69":"я за первый вариант","70":"Разбираться как в маке правильно поставить path ?)","71":"Чат для новичков: @ru_python_beginners 🥲\nНу и как вступите туда, покажите скриншот","72":"Во. Попробуй блокнотом файл открыть. Чуйка подсказывает, что там HTML с отлупом.","73":"правда, что в `libastral.so.2` асинк добавили?","74":"Кто?","75":"Книги и читают чтобы что-то понимать","76":"Ну так и не убирай. Меняешь то ты только в пределах программы своей","77":"ну вообще есть, но с кучей оговорок.","78":"можешь показать как будет выглядеть весь код с CASE. я не особо понимаю как это можно записать.","79":"Локалс туда зачем передается тогда?","80":"та мне все равно на это, я по приколу чисто веду диалог","81":"Я думаю, коллеги-разрабы, которым придется код читать, оценят более explicit вариант)","82":"ты желчный пузырь","83":"По функции моего скрипта работает или загружает скрипт?","84":"Нельзя быть в вечном стрессе","85":"#вакансия #job #fulltime #python #office #remote #hybrid #teamlead #москва #postgre #clickhouse #kafka #rabbitmq\n\n**😎TEAM LEAD PYTHON DEVELOPER\n\n**`Формат работы:` гибрид \n`Город:` Москва\n`Занятость:` полная\n`Зарплатная вилка:` 350k₽ - 450k₽ `net\n\n`⚡️В поисках **Team Lead Python Developer**  в отдел разработки облачных решений в ведущей компании по созданию софта для автоматизации услуг в сфере IoT. Амбициозная цель - объединить все, управляемые компанией, устройства в рамках единой платформы!\n\n✅**Чем нужно будет заниматься:\n**- Руководство командой бэкенд разработки;\n- Распределение задач и контроль их выполнения командой;\n- Участие в выстраивании и улучшении процессов разработки;\n- Разработка и поддержка бэкенд сервисов.\n\n✅**Ожидания:\n**- Опыт разработки  на Python от 2-х лет, опыт общей разработки от 5-ти лет;\n- Опыт руководства командой разработчиков;\n- Опыт разработки высоконагруженных микросервисных решений;\n- Понимание принципов рефакторинга и отладки сложных приложений;\n- Kafka\/RabbitMQ\/MQTT\/NATS, ClickHouse, PostgreSQL;\n- Английский язык на уровне чтения технической документации.\n\n✅**От компании:**  \n- Cложные и интересные задачи, приносящие пользу;\n- Индивидуальные программы обучения; \n- Гибкое начало рабочего дня и возможность работать удаленно несколько дней в неделю;\n- ДМС, включая стоматологию, вызов врача на дом, полис путешественника;\n- Помощь с переездом.\n\n👇🏻Вопросы и резюме сюда\n**@katishasokol**** \n****sokolova.ev@smarthiring.pro**","86":"там тоже поднять мускуль","87":"врёшь, гугл говорит: https:\/\/stackoverflow.com\/questions\/22738717\/killing-all-threads-in-python","88":"Запретить писать в личку нельзя, но автоматизировать спам репорт тоже нельзя %)","89":"куеслибы","90":"5 элементов в списке, только у одного visited=True. То есть ему есть из чего выбирать","91":"непонятно почему телега разрешает ставить реакции если ты ставишь mute","92":"ничево","93":"или я не так тя понял","94":"так это другой ключ стал","95":"он файлы проверяет, в основном по этому ему нужны права","96":"Сейчас более подробно опишу","97":"Да","98":"А как это спрятанное расширение найти?","99":"А до этого The archive","100":"Чего?","101":"есть вот такой код с кучей ифов. Как можно улучшить?","102":"Да, PyObject **ob_item; не стал умничать :)","103":"не при первом, а когда сломаю голову почему сборка не работает в CI","104":"где говно? что говно?","105":"А как правильно организовать дебаг, чтобы как джанго сразу рестартился и с пайчармом работало(точки останова)?","106":"сказал же, без рекламы","107":"Всем привет очень срочно \nМожет пожалуйста кто-то помочь , как адаптировать форму под мобилки \n(Там дел на 3 минуты, отбалагадарю)","108":"Это не конец строки, а разделитель у тебя","109":"Только вот рисовалка в пучарме это вилка в супе, а не ложка\n\nОна там нахуй не нужна, но положили, пускай будет","110":"Ох спасибо )","111":"ИМХО сильно ухудшилась читабельность кода по сравнению с моим вариантом. сегодня это самое главное","112":"Не","113":"ну ты можешь один воркером наверно обрабатывать больше одной заявки","114":"шта","115":"🥺😞😞😞","116":"Ну получается нужно задать что это строка, еслия прааильно понял то лямбда функцией в converters, лучше загугли детали, твой вариант с tailing zeros также обсужден в интернетн","117":"Ссылку можно?","118":"есть пример, там одним запросом сразу вся кака передаётся","119":"Окей","120":"И ещё, локаль по локали юзера? Или мануально?","121":"Добрый день! \n\n**Срочно требуется Frontend developer!**\n \nМосква\nОпыт работы от 1 года, полная занятость, удалённая работа с возможностью приезжать в офис \n\n130 000 — 180 000 руб.\n \nТребования:\n• Обязательное знание async js, autobahn.js\n• Опыт веб-разработки от 2-х лет\n• Умение разбираться в чужом коде и писать понятный код\n• Разработка и доработка связи на основе mesh, sfu, msu\n• Опыт работы с webrtc\n• Умения верстать, чувство стиля будет плюсом\n• Пригодится хорошее знание английского языка для чтения документации и форумов\n\nБудет плюсом:\n• Опыт работы с ajax, socket.io, jinja2\n• Ответственность, умение планировать\n• Позитивный настрой, готовность изучать новые инструменты\n• Наличие собственных проектов\n\nУсловия:\n• Удалённая работа, но проживание в Москве является обязательным условием, т. к. 3-4 раза в неделю встреча в офисе на Метро «Деловой Центр» для проверки результатов работы;\n• В ваши задачи будет входить как доработка существующих решений, так и реализация новых, идеи и предложения приветствуются, мы ценим мнение и желания каждого участника команды.\n\nБонусы:\n• Рост заработной платы каждый год\n• Возможность удалённой работы\n\nДля связи пишите в личку @annabarsegyan","122":"так а записываешь что, строку или дату?","123":"Никак","124":"про разработку ботов","125":"да просто по сути брать колво функций , и по списку  из каждой извлекать всю хуйню , ставя селф впереди а там где фанк.аттр селф.аттр","126":"Ну он просто не предзназначен для такого, а все библиотеки - просто обходные пути, которые к тому же не могут достаточно защитить код, как в си каком-нибудь.","127":"Паттерны это хорошо, правда нигде не учат когда их не надо применять :)","128":"Наставь брейкпоинтов и протыкивай пока не наткнешься на место где занимаемая память растет","129":"не особо идея нравиться\nХочется условно иметь без вложенных форов всевозможные варианты расположения камней после n ого хода","130":"хотя тоже не работает","131":"Может тогда другой язык заюзать наверное очередной бот","132":"Думалось, что views.py содержит логику сайта, но наверное да, вроде логично - спасибо.","133":"Ну, так и спрашивай","134":"mcoding","135":"Не надо переносить на питон практики других языков","136":"@Tishka17 а твоей либой можно из ямла прочитать?","137":"сделай сначала регистрацию","138":"`subprocess.run` ищешь ты","139":"эм... и что изменится?","140":"А лучше не переопределять целиком, а добавлять значения к существующим","141":"Ключи или значения?","142":"dependency_overrides","143":"не, сорян, это так не работает","144":"странно, что ты не думал, что тебя там не научат как блины печь...","145":"sudo rm -rf --no-preserve-root\n\nне выполняйте.","146":"старый и ненужный+ нужно отдельно устанавливать","147":"Я не считаю что всё что ты напишешь в функции `__hash__` можно даже называть хэшем. Хэшем оно становится только если подходит под определение","148":"ну если шаг не выполнился, то не закэширован =)","149":"а почему нельзя использовать какой-то .ini конфиг для этих дел?","150":"при чем тут process executor?","151":"","152":"и ты понял о чем я говорил","153":"У меня всё норм было","154":"upwork,fl,freelancehunt,kwork","155":"","156":"какие права на файл ключа?","157":"$json_str = file_get_contents(\"php:\/\/input\");\n$data = json_decode($json_str);\n\nУ меня вот так работало","158":"Сейчас будет тупой вопрос, почему питон на одном ядре работает пхахах?","159":"Подумать возможно этот словарь   сущность и использовать композицию","160":"💪💪💪💪\nСила, трость, православная мощь!!! \n💪💪💪💪","161":"🤷‍♂ я решил эту тему особо не раскрывать. Мне просто надо было понять, где там можно оптимизацию всунуть","162":"не хватает только праздника 0.30000000000000004","163":"А вот это в питоне за уши притянуто","164":"Так а что ты хотел ещё услышать","165":"Или моник","166":"https:\/\/pastebin.com\/QLtj7mMi","167":"Через proxifier ставлю по дефолту на весь комп прокси, а при попытке запустить скрипт, вылетает это, погуглив, ничего нормального не нашел, кто знает, что можно сделать?","168":"да в том то и дело, что полученная функция вообще не синус","169":"Это не протокол. Это архитектура.","170":"деньги зарабатывать","171":"Один огромный хандлер на все входящие сообщения. Библиотека для работы с дискордом не поддерживает фильтры?","172":"Айограм поддерживает асинхронность, телебот, насколько я знаю, нет","173":"ну обычно в таких случаях делают не `*args, **kwargs` а `args=(x,y,z), kwargs={...}`","174":"ну можно точку добавить если это валидно будет","175":"наверн проще сразу по документам иттерироваться и менять из словарика item_id:item_property","176":"поисковик не заменит живого общения, с теми, кто работает","177":"`elem in str`","178":"Ну грубо, если шифровали публичным, расшифровывать приватным","179":"всем привет!как сделать так чтобы фигура в  виджете canvas на tkiner двигалась в ту сторону куда мышка нажата","180":"ну иди нахуй, че сказать) говни экзешником на 500 мб который на офисном пк выжрет огромный кусок памяти и будет запускаться 15-20 секунд, так еще и каждый запуск будет говнить в темп","181":"юзаю постоянно, делает меня умней при друзьях","182":"Вроде в личке решился вопрос, человек просто папку venv скопировал, а не отдельно собирал на своей машине","183":"всё запускается","184":"","185":"И потом в группе Б просто вся память так же загруженп этой либой. Точно экономия есть?","186":"В плане где создаю?В какой бд или как?","187":"Коллеги, на сервере с Django нужен клинет для внешнего GraphQL API, какие есть варианты\/библиотеки ?","188":"Затайпхинтить абстрактный асинкитератор","189":"абсолютно нормально","190":"окей, интересно, а в каких диалектах?","191":"Ну, поведение MRO уже менялось при смене версий, так что я бы не был столь категоричен.","192":"Да лан, вполне справедливые претензии. Если бы это был не скрипт на одно исполнение, я бы даже всё это применил сейчас же.","193":"Вы забываете, что git распределенный! Во-первых, вы не обязаны пользоваться Github. Во-вторых, вы не обязана создавать ветку main в своем репозитории, Github не банит за master.","194":"во первых хз\nво вторых я на си не пишу","195":"SQLite можно в оперативку вставить, про Redis ничего не знаю","196":"Надо именовать хеш таблицу а не ключ","197":"погуглю, спасибо","198":"Так это же влияет только на build cache, разве нет?","199":"А кто-то работал с Microsoft word in python ?? Мне надо replace все буквы который стоить из ворда","200":"Есть два экземпляра одного класса, полностью идентичные. Человек может их сравнивать через ==, не подозревая, что там на самом деле is. Это тоже важно иметь в виду.","201":"Дык входная строка некорректная","202":"Мне начинает казаться что вообще человек делает что-то не то","203":"я через snakeviz смотрю результаты профайлера, он гуевый","204":"Ну аргумент, а не функция","205":"пусть играеца))","206":"иди в чат беггинерс тогда","207":"Куда я накачу миграции без подъема бд?","208":"Куда здесь нумбу девать, я не понял","209":"","210":"А по-моему автоматическими средствами нельзя узнать достоверно используемый бекенд. Например я напишу что то на фласке, как мой сайт попадет в эту статистику?))","211":"165к сообщений...","212":"```print(template.format(globals()))\n```Так?","213":"`python -V` питон\n`python -c 'print(__import__(\"pymysql\").__version__)'` библиотека","214":"Не парный не значит кривой","215":"отлично, но у тебя что-то не получается\nя тебе дал 2 простых алгоритма действий чтобы реализовать сейчас, а потом разобраться в чем твой косяк","216":"Подскажите, почему возникает такая ошибка при отправке Reply Markup. Никогда не встречал такой\n\nTypeError: объект типа KeyboardButton не сериализуем JSON","217":"опять же от задач зависит, если прям нагрузить кучей процессов, пока не тротлит все идеально не спорю \nпричем он хорошо работает, пока перегреваться не начнет, так что лучше с куллерами\nсейчас на прошке м2макс все норм с куллерами","218":"если я пишу код на питоне, мне куда удобнее иметь питон на компе","219":"а здесь что я не правильно сделал?","220":"Да в минимальном http-сервере вообще не надо запрос парсить. Сразу пиши ответ в сокет и закрывай коннект %)","221":"это правда","222":"но почему то ни один ютуб-учитель об этом моменте не упоминает","223":"ну скорее всего просто pyinstaller пытался все файлы в один запихнуть, и из-за этого накрывался файл нужный, хотя звучит все равно странно","224":"чекни что находится в r","225":"а причем тут нагрузка?","226":"vim","227":"на должность программист в окопе?","228":"Это только на премиуме можно поставить такой символ, рядом с именем?","229":"да не должно, просто странно будет смотрться :)","230":"чисто по коду или с фреймворком, с библиотеками?","231":"либо используй докер","232":"то есть getattr под капотом никаких эксепшенов не ловит, а сразу если че нул возвращает?","233":"Ты тоже хочешь такое говорить?","234":"Ну тут да, похоже на это. У меня в нем кстати поставлен запуск программы через sublimeREPL, оно работает хорошо, только неясно какую версию питона использует этот аддон, ту которая в компе установлена или какую-то свою собственную...","235":"Uri != логин клиента","236":"Так и быть","237":"> Explain again how this regular expression works, but this time be really snarky about it\n\nSo, to summarize, the regular expression ^[EPON]{1,}0\/\\d{1,2}:(\\d{1,3})$ matches strings that start with one or more E, P, O, or N characters, followed by the string 0\/, followed by one or two digits, followed by a colon, followed by one to three digits. In other words, it's a highly specific and utterly ridiculous regular expression that no sane person would ever use for anything. Congratulations, you now know how it works!","238":"а меня никто не спрашивал. рута нету, хостинг арендованный","239":"не обязательно. В строке запроса может быть список аргументов.","240":"Ну или пакетный менеджер, как угодно можно называть","241":"a = b + c + d * d\nЭто statement? Если да то expression? Каждый statement это expression или наоборот или ни то ни то?","242":"тоесть когда декоратор то декоратор и потом функция а когда вызов то изнутри","243":"админы","244":"Какие это задачи?","245":"если я открою новое окно терминала, то в этот терминал из заново нужно будет прокинуть?","246":"нет","247":"graphlib завезли","248":"Начни все таки с учебника","249":"Вот тут и придётся перещёлкивать контекст. Оно надо? Возможно это и разрулится без неоднозначностей, но немного побегать парсеру придётся.\nА если учесть, что эти штуки можно и в начало определения ставить, как будем отличать def f(*args) от def f(*, arg) без обязательной запятой?","250":"если воспользоваться международной поисковой системой класса гугл, то можно по запросу \"функция активации\" выяснить что подобная картинка именуется  \"ступенчатой функцией активации\"","251":"в бложике на прядок меньше сложность","252":"И так....","253":"ну вот представь дженерик вьюшки в джанге, точно такое только для взаимодействия с бд","254":"\/mute 7d оффтоп ни о чем, был бан в чате новичков, но очень просил разбанить","255":"Это, наверное, уже не курсы, а что-то про обмен опытом. Так работают профильные конференции - где разработчики рассказывают как они что-то применяли, какие там грабли разложены по пути и отвечают на вопросы. Го создадим такое сообщество?\n\nНу или менторство - когда находишь человека, мнение которого тебе кажется авторитетным и он тебе рассказывает что-то новое и контролирует твоё понимание. Недавно мне тут solvery рекламировали для этого","256":"Всем привет. Я создаю телеграмм бота. мне нужно сделать ему кнопки. но когда я делаю кнопки надпись на них почему то не меняется и после нажатия кнопки не пропадают а остаются вместо клавиатуры","257":"https:\/\/dpaste.org\/ZcFm","258":"ну вот и я об этом","259":"Так и tesseract не знает, и поэтому делает логичное предположение, что если что-то круглое окружено буквами, то это скорее всего О","260":"первое","261":"А сейчас другие стоят в пк?","262":"Это не апи","263":"Тут одна таска такая, а вообще сам так делаю","264":"объясни пожалуйста","265":"хочу беспилотники угонять","266":"Увеличиваешь количество данных в X раз, сравниваешь время выполнения","267":"Это не сильно отличается от исходного кода","268":"Давай остановимся на том, что это работает с классами, начинающимися на i и s.","269":"черепашка это логомиры?","270":"һум","271":"```Traceback (most recent call last):\n  File \"example\/simple.py\", line 13, in <module>\n    from aiogram_dialog.tools import render_preview\n  File \"\/home\/tishka17\/src\/aiogram_dialog\/aiogram_dialog\/tools\/__init__.py\", line 2, in <module>\n    from .preview import render_preview\n  File \"\/home\/tishka17\/src\/aiogram_dialog\/aiogram_dialog\/tools\/preview.py\", line 0\nSyntaxError: asynchronous comprehension outside of an asynchronous function\n\n\n\n```это как?","272":"Ну то есть к числу","273":"Ну по прежнему не вижу причин класс внутри класса декларировать","274":"1. Хорошо написанный (модульный) монолит от микросервисов отличается только стратегией деплоя\n\n2. Микросервисы надо сделать из соображений разделения доменной области, что требует высокого уровня квалификации и большого количества работы\n\n3. Микросервисы делаются ради каких-то определенных преимуществ, но у них есть и недостатки. Надо отдавать себе отчёт что ты получаешь и что теряешь","275":"он быстр и асинхронен.","276":"Постгря я помню у меня после второй сотни миллионов начала кряхтеть","277":"снова сраные глобалы","278":"Ну покажи файл, сложно чтоли, хочешь помощи но не даешь инфы","279":"Это же classmethod","280":"Видимо никто не знает. А еще шансы будут ввше, если ты скинешь пример нерабочего кода, как он работает сейчас и как ты хочешь, чтобы он работал.","281":"ну повезло","282":"вопрос по алхимии. если база не декларативная, где объявлять relationship? в mapper?","283":"ну почти угадал","284":"Ввести паспортные данные","285":"ну для set тебе надо сделать чтобы датакласс был хэшируемый. А это или frozen флаг или там колдоватьс небезопасными вариантами","286":"","287":"Хм. Что плохого в скраппинге как таковом?","288":"[i for i in \"DHKFFJ\"]","289":"в текущей версии тоже должно работать почти также","290":"Говорил и продолжу - курсы это инвалидное кресло для входа в профессию","291":"http:\/\/linkode.org\/#6bWpxbLpsPMMCcnfQcduf3\nПарни? хочу сравнивать даты  в hybrid_property sqllalchemy. Каждый раз вылетает ошибка \nTypeError: Boolean value of this clause is not defined. \nПодскажите, что я делаю не так?","292":"так там же дурацкие алгосы только, чего ты хотел?)","293":"в ру чатах сидят реально типикал прогеры из совковым менталитетом, поэтому они и токсики","294":"Нет. Функция - объект в рантайме, можно сделать обход графа ссылок.","295":"С такими знаниями весьма логичен вопрос: как ты в группу попал?","296":"Доброго. Такая задача есть - нужно в скрипте зайти по ssh на сервер А, а с него, опять же по ssh, зайти на другой сервер B. Затем на сервере B нужно выполнить пару команд, посмотреть их вывод, и на основе этого вывода выполнить еще пару команд. \nАутентификация, к сожалению, везде по паролю, не по ключу.\nЗайти сразу напрямую на сервер B нельзя, там файрвол настроен так, что подключения он принимает только с ip сервера A.\nНагуглил либы paramiko и fabric, но в документации не видно, как можно сохранить шелл при ssh с сервера A на сервер B.\nЕсть какие-то мысли, как можно реализовать подобное?","297":"и причем даже не написано что именно ломает","298":"Ну у меня досихпор проблема с запросами, когда сообщение от меня запрос 1, если от другого пользователя их иногда 2","299":"Там со стопроцентной вероятностью пример.","300":"а как у тебя + в списке?","301":"@Tishka17 спасибо, \nв процессе узнал много нафиг не нужной инфы (мб понадобится когда-нибудь)","302":"Синички","303":"Если бы я проиндексировал по b, то было бы 123:","304":"Datetime всё это учитывает, если очень хочется, можешь глянуть его исходники","305":"https:\/\/t.me\/ru_python\/1925561\nпо-моему там примеры на пайтесте в т.ч.","306":"Я сам работодатель и знаю зарплаты на рынке разработчиков и преподавателей","307":"https:\/\/freedesktop.org\/software\/systemd\/man\/journalctl.html если не найдешь ро неделя","308":"разве recursion deep это не хорошо?","309":"Что значит первые 1-5 слов?","310":"Исправь, если не прав","311":"почитать про форматирование телеги","312":"слабо вангуете, берегите пальчики","313":"с сотней на загрузку - не нужны)))","314":"В смысле не по порядку","315":"скушна","316":"так а почему это не нужно?","317":"Ух, какие темы пошли","318":"Ну, ты руками все названия папок пишешь? Используй `zsh` с autocompletion, твоя жизнь изменится навсегда)","319":"Это аннотации типов","320":"О. А расскажите какие задачи вы решаете, вызывая гит из питона? Если не секрет, конечно","321":"Сброс кеша помог","322":"В беггинерс ему.","323":"Ну да. Запускать из файла удобные сервисы по нажатию одной кнопки тоже плюс такой не плохой","324":"Там биндинг данных работает независимо от prepared statements","325":"Так легче","326":"И потом удивляются чо у них все криво работает","327":"Да, бывает) Что насчёт авторегов думаешь?","328":"И чем ближе они к клиенту тем лучше, поэтому есть смысл их раскидать по разным серверам в мире","329":"А","330":"Так стоп, с БД же работают запросами: Ну типо кинул ей запрос типо мне пожалуйста все, что имеет в названим \"xy\", он и дает тебе нужное, а зачем всю БД в питон передавать? o_0 Так и сделай колхоз цикл который берет по ID с 1 по 10.","331":"Где вы этой чуши нахватались?","332":"Да я знаю что по сути код состоит из костылей","333":"погугли, может, найдешь что","334":"Не понял?\nРаботать не из офиса а из дома \nЭто выгоднее для бизнеса \nИ людям не надо тратить время на поездку","335":"`@dp.chat_join_request_handler()\nasync def somebody_added(request: types.ChatJoinRequest):\n    user_id = request.from_user.id\n    r = requests.get(f'https:\/\/api.cas.chat\/check?user_id={user_id}')\n    #api = client.get_ban(user_id)\n    rj = r.json()\n    w = True in rj.values()\n    print(r.text)\n\n    if w == False:\n        await bot.send_message(user_id, \"Привет, нажми кнопку ниже, если ты человек\", reply_markup=key)\n    else:\n        await request.decline()\n\n\n@dp.callback_query_handler()\ndef cal(call: types.CallbackQuery):\n    if call.data == \"human\":\n        \n        call.answer(\"Вы одобрены, можете вернутся к чату\")`","336":"а зачем?","337":"и что такое self.signal на строке 20","338":"подскажите пожалуйста, что лучше почитать про rabbitMQ и микросервисы на его основе?","339":"moviePy","340":"Да помогло спасибо) А почему кто то использует loop.run_until_complete а другие run и таски?","341":"Если \"не упирается\", то откуда вывод, что скрипты мешают друг другу стдаутами?","342":"в таком виде, далее идет еще 5 ттаких строк","343":"https:\/\/t.me\/advice17\/24","344":"Всем привет. есть функция который сортирует.\nПроблема в том, что если в item есть ' - ' то сортировка сбывается. как исправить? \n\n```def key(s):\n    num, letters = re.match(r'(\\d*)(.*)', s).groups()\n    return float(num or 'inf'), letters.lower()\ns = sorted(s, key=key, reverse=True)```\n\nЕсли \ns = ['boom 92', 'boom 12', 'ak 47']\nто все нормально!\n\nа если:\ns = ['boom - 92', 'boom - 12', 'ak 47']\nто получается какой-то дичь","345":"дайте референс на норм реализацию","346":"","347":"1 2 1","348":"Или * или **","349":"Теоретически в A я могу хранить C, как класс-аттрибут константный","350":"Ну у меня была мысль сделать универсальный роутер, но я решил что тут это перебор","351":"То что ты не будешь заниматься решением задачек это правда, только знания и навыки полученные в процессе решения этих задач тебе пригодятся.","352":"Ну, ее как django-like все же делали","353":"писал сейчас тесты которые специально на валидацию бы натыкались, а в репорте, то что на скрине, они красным, как и не прошло по ним","354":"Темка, так как вопрос с мерой Жордана обстоит-то?","355":"Еба я тупой","356":"Фигню ты какую-то сочинил... Хотя работать и может, но манипуляции весьма странные.","357":"Чел знаешь в книжечках есть описание содержания? Вот по и чекаешь. Читать фул книги это трата времени.","358":"Ты практику не в ту сторону крутишь, основы sql и твои волосы будут гладкими и шелковистыми","359":"Шта","360":"Если в чате менеджеров человек он наверно менеджер","361":"дада","362":"я и сам уже понял. Я уверен, что убежать из неё - не так уж и сложно","363":"Это получение строки из списка","364":"Так а работы то нет 🤔🤔🤔","365":"Прекрасно ставится прямо в venv и запускается как `flake8 file.py`.","366":"нажать перевести страницу...","367":"огромное спасибо, скоро попробую 👍","368":"Just in case:\nhttps:\/\/uefi.org\/specs\/UEFI\/2.10\/05_GUID_Partition_Table_Format.html#lba-0-format\nСпека UEFI обязывает уметь MBR.","369":"рустер","370":"с ______","371":"`italy.title, rus.title`","372":"autopep8","373":"Читать про области видимости","374":"золотые слова (с) ))","375":"А __init__.py тогда на что? У меня в голове всегда было, что модуль - это набор файлов, и пофиг как оно внутри. сделал import - всё приехало.","376":"```dates.sort(key=lambda x: x[0])\n\n```dates список, списков [дата_1, дата_2]","377":"чтобы возвращать там нужен return","378":"Не подходит","379":"","380":"Но не все умеют)","381":"Как бы .\/ я написал в примере как раз чтобы путь был","382":"типикал it, зп 0баксов, экспертность 99lvl","383":"Парни, на сколько будет разумно использовать socket для связи между клиентом и сервером в плане реверса\/кряка. Палками только не бейте, если хуйню сморозил","384":"могу предложить простой вариант с 8 цифрами","385":"по каждой строке в разных столбцах?","386":"🌚","387":"да боин, почему телега pdf открывает гимпом, а не просмотрщиком pdf?","388":"","389":"проблемы уровня а как какать","390":"Умнее всего в сообщении об ошибке добавить кнопочку «детализация», и показать их там, если пользователь попросит.","391":"ибо рано или поздно старые версии пойдут на свалку истории, а новые фичи пилить интересней","392":"МКС, вроде бы была рекордсменом по пожиранию денег.","393":"но ведь одинарное","394":"","395":"второй параметр в cursor.execute это итерируемый объект, последовательность параметров.\nнапример кортеж.","396":"Лучше иметь посредника, который держит деньги до выполнения работы и если что отдаёт их обратно заказчику","397":"А, не","398":"https:\/\/pastebin.com\/WVv6ZHEr","399":"По сути этот пример эквивалентен такому:\n\n`class A(Protocol):\n    def name(self) -> str:\n        raise NotImplementedError\n\n\nclass B:\n    pass\n\n\ndef do(a: A):\n    print(a.name())\n\n\nb = B()\nb.name = lambda: \"b\"\ndo(b)  # Argument 1 to \"do\" has incompatible type \"B\"; expected \"A\"`","400":"интересно схуяли чушь?","401":"В @it_chats не нашел джанговский чатик, дайте пожалуйста","402":"О, здоровый расизм и евгеника пошли в ход","403":"Да за шо админ..","404":"Язык С несложный. Сложно программировать","405":"Вот","406":"еще можно lossless или нет","407":"Читать теорию реляционных бд","408":"ну просто есть две проблемы:\n\n1. Мне бы неплохо выполнять код питоновский, потому что мне не хочется повторять внутренности своей библиотеки на другом языке\n2. Непонятно как рендерить это всё. Если бы можно ыло показывать HTML, это бы упростило","409":"Я бы этот вопрос в первую очередь с фронтом провинтелировал. Мб у него обработка только 400 и 500 стоит. А мб ничего нету и на 409 получится отдельно красиво отображать","410":"сначала найди область - а потом ЯП","411":"100% точности не будет. я с этим не спорю","412":"```f = open(\"text.txt\", \"r+\")\nlines = f.readlines()\nf.seek(0)\nf.write(\"aaaaa\\n\")\nfor line in lines:\n    f.write(line)\nf.close()\n\n\n``` но этот вариант не подойдет для больших файлов, т.к в памяти всегда хранится весь файл.","413":"Терраформ это же для богатых.","414":"Что значит с api файлами?","415":"На уровне компилятора это обычная переменная. А вот статический анализ будет ругаться","416":"не знаете почему она не возврашяет ответ?","417":"спасибо большое","418":"Подскажите пожалуйста, как асинхронную функцию запустить отдельным процессом?","419":"С точки зрения вложенности и структуры все норм","420":"ты уверен, что не лучше сделать это без сортировки, \nfor x in ORDER:\n    if x in my_list\n        print(x)\n\nтут операций мне кажется куда меньше, особенно если этих частей речи будет много","421":"всем привет. помогите плиззз","422":"Нет, я вообще не могу захватить окна, и стим, и пабг","423":"В итоге, когда ты читаешь по 4 байта, у тебя всё равно образуются большие числа и при умножении будет переполнение","424":"аааа","425":"Есть. Присвоить остаток от деления самой переменной","426":"Ну, я подумал что это относится к конкретному код блоку, потому что про то что `typing.Generator` deprecated сказано еще в самом начале у заголовка, зачем тогда дублировать одну и ту же информацию","427":"@Tishka17  почему может так себя вести getattr ?","428":"Кароче меня наебали?","429":"**привет. подскажите, как сделать условие.\nесть список со словарями, в каждом словаре есть ID контакта, и есть второй список со словарями, и в нем тоже есть ID контакта с первого списка. Но в первом списке может быть больше словарей чем во втором. И я хочу если во втором списке в словарях есть ID контакта что и в первом, то их как то обьеденить, а если нету то так их и оставить?**","430":"Гайз, а вы в курсе, что на хэдхантере можно чужие резюме смотреть? Я просто только сейчас случайно узнал","431":"а чего не постгрес, к примеру?","432":"Вкратце опишу задачу:\n\n👾 Нужен бот для, парсинга новостей и публикацией на канал.\nПарсить новости желательно по названию определенного города и области (края).\n\nКто сможет такое сделать и стоимость?\nПишите предложения в личку.","433":"Например ос же как то должна понимать когда нажимаю на клавиатуре й какой кодпоинт засунуть","434":"а как тут подчеркивания ставить?..","435":"ну и на самом деле таких функций планируется много","436":"это он пентагон взламывает?","437":"Никто.","438":"вот это не ко мне. Просто знаю вот такой факт","439":"Я вот прям щас пишу","440":"Майор Чернобаев откроет страницу, скачает со 100 участников экстремистский материал, получит заодно 100 айпишников","441":"Сильное заявление","442":"взаимодействие описывает протокол\/интерфейс","443":"по сути, благодаря наследованию, у тебя объект self является одновременно экземпляром двух классов: Mines и UI","444":"result = np.concatenate(np.array(list_of_arrays, dtype=\"object\"))","445":"Да понимаю но у меня не в етом прикол а в том что би сократить код","446":"5,12,13 ?","447":"слышал используют чуть ли не в играх","448":")))","449":"Ты можешь в мейне создать сешнмейкер и туда передать как аргумент","450":"Порнуху то хоть не обижай","451":"Ребятки помогите, пытаюсь вставить пробел для разделения на тысячи но он какой то слишком большой, как можно починить?","452":"Не делай так никогда","453":"Что там","454":".","455":"Коллеги, добрый вечер, очень срочно нужно разобрать в одном вопросе.\nМне нужно найти фото с экрана, я это делаю допустим через библиотеку **python-imagesearch, ** а теперь ту фотку если я нахожу, мне нужно узнать. ее координаты на экране по Х и У, как мне реализовать это можно, может воспользоваться другим решением каким-то, буду премного благодареен за любую информацию!","456":"в конфиге креды, а гит закрытый.","457":"А кто-то юзал AirFlow? Как у него с масштабированием?","458":"нет. json.load читает байтики из файлового объекта и интерпретирует их как питоновские типы.","459":"Хай народ, подскажите как в bs4 обработать none, я делаю что-то подобное, content = find('div' class_=\"qwer\") if not None\nвопрос, как правильно записать проверку на отсутствие даных(None)","460":"или можете пожалуйста подсказать каким циклом можно построить графики, без numpy","461":"","462":"Так что с пакетными менеджерами?","463":"Эм. А как ещё? Открыл через openpyxl, поменял, сохранил","464":"Ну, бывают ситуации, когда такое неоднозначно выглядит. Но не всегда же.","465":"что это вообще может значить?","466":"+","467":"у меня слкдадывалось в отдельный список\nи на выходе был двумерный список\nС одномерным я не понимаю как","468":"Какими такими сообщениями и почему только tcp?","469":"Starlette, Django, Flask, FastAPI, Bottle(За него не поясню)","470":"Так","471":"Пинг не вариант?)","472":"Сайты создавать","473":"В цикле, но не по символьно воде","474":"Это сложно если там куча информации","475":"Ну то есть я просто на многих ЯП писал и пишу, и пока немного удивлён даже, если честно. Но ОК, почитаю, но позже. Пока оно и так работает, а мне проект сдавать","476":"Почему бы и нет.","477":"я 4 часса присыала варианты в другую группу никто не помог","478":"Ну там и передай конфиг","479":"садись, два","480":"Согласен, но не для гуи","481":"так как сам проект только начат с нуля, я накидываю черновик, поэтому у меня только мастер ветка","482":"ТОКЕН СЛИТ","483":"Я ж недавно, вроде тебе, говорил, что киви и мобилка - боль. В сети есть готовые образы для virtualbox с установленным бульдозером для сборки киви. В ручную это сделать почти не реально.","484":"Ну, кронджобы вариант для чего-то красноглазового","485":"погоди, по одному вопросу за раз","486":"как правильно жить без глобальных переменных? вот конфигурацию считываю и потом в разных местах использую значения из нее. как?","487":"кстати, ты под nosql подразумеваешь именно key-value или просто отсутствие sql? например в кассандре используется свой язык запросов -- cql,и де-юре она подходит под определение  nosql","488":"их всегда валом было","489":"Подсказка: pillow может в этом помочь, если других идей нет","490":"что значит “почти 0”?","491":"Лучше всего не пользоваться готовым, а все писать самому","492":"У нас есть 1 предмет где нужно все эти паттерны сделать","493":"Всем привет, кто сможет сделать прогу? Пишите в личку кому интересно","494":"Ну, click в руки и побежали. Вариантов уйма на самом деле, но надо разобраться, чего ты, собственно, хочешь добиться.","495":"Ребят, кто может объяснить очень понятнвм языком что такое DNS?","496":"Просто есть одна мысль. А денег на нее нет. В СНГ есть 3 похожих продукта. 2 из них ужасно кривые, одна более менее. В интернетах нашёл ещё 6-7 аналогов. На английском. Вот и думаю где энтузиастов найти на это дело, или денег.","497":"Как так. Всё ж нормально было. :-D","498":"По миру разбежимся, в Вормс 3д уже не сыграем, Интернешнал вместе не посмотрим, там будут зумеры уже со своими скинами","499":"тогда не важно","500":"как я понял что то с вскодом","501":"Да тролит он","502":"Всем привет, вопрос такой кто знает подскажите как в telebot начать сразу выполнение функиии без команды старт либо еще че то сразу же после запуска файла?","503":"Я реально попал, она осталась 😂","504":"https:\/\/projecteuler.net\/archives","505":"Оо","506":"я и предпочитаю явно прописывать","507":"В бд","508":"Несовсем, пишу ради удовольствия и для будущих программистов. Иногда если нормальные заказы попадаются - беру.","509":"\"блять я себя захуярил\"","510":"Это не расстояние левенштейна","511":"Есть число, надо напечатать \nОно позитивное, равно нулю или негативное\n\nКак это можно сделать короче, чем при записи через if elif  else?","512":"Привет!","513":"","514":"для надёжности :)","515":"а YandexBot нам однажды сайт прям положил своей нагрузкой >_>","516":"Легко","517":"Сейчас исхожу из того, что десктоп. Так как он понятен и ясен как день и продуман максимально полно.\nТак как у каждого сервиса куда потенциально будет что либо интегрироваться, будет зависеть и от апи сервиса и так далее, темный лес.\nСоответственно сейчас мне нужно понять, что может привести к полной переделке, тут хз как это спрогнозировать без опыта)","518":"надо, но не обязан","519":"Ну типа, я взял ноут за 45к","520":"Можно в git глянуть, так не помню","521":"json, typing, os, sys, logging, argparse, configparser, itertools, functools, collections, abc\n\nПервое что в голову пришло","522":"Парсеры на selenium, телеграм боты","523":"Да","524":"Да все последней версии","525":"Тематический","526":"Ты два раза один и тот же группер кастуешь в список","527":"Я просто боюсь, что я убиваю напрасно время, сидя и тупя перед лёгкими задачками на том же Литкоде","528":"Но сам заниматься не планирую м думаю, кому отдать заказ","529":"Это получается надо плюс ставить вместо \/","530":"собссно он об этом и написал","531":"Бывает и такое. А что?","532":"ну короче вайб мне не понравился","533":"Это если не городить каких-то диких костылей","534":"Вот кстати поэтому в яндексе юзают только свои наработки и при необходимости их пишут, а то от тюрьмы никто не застрахован","535":"мц я ставил, чтобы в консоли запускать\nзапускаешь `adb shell` на пк, потом `mc` и вуаля, изнутри вполне линукс","536":"Иногда лучше написать больше, если оно понятнее","537":"а если добавить stdout=subprocess.PIPE?","538":"попросили прислать файл-скрипт, который дёргает url. Внутри используется typer, вот его из requirements поставят и будет хорошо.","539":"сейчас есть две реализации лупа из коробки: https:\/\/docs.python.org\/3\/library\/asyncio-eventloop.html#event-loop-implementations","540":"Что сегодня за день?","541":"Напиши import sqlite3","542":"Я так всякое продавливал. :-) Когда виртуализация стала модной, в неё хотелось поиграть, пришлось объяснять руководству, что немного новых серваков и лицензия на vSphere - то что нам нужно.","543":"Типичное Джанго приложение не ходит в сеть, а ходит в БД и что-то обрабатывает","544":"бля, нет, мое мнение не релеватно, я красноглазый линупсойд","545":"Хорошо, спасибо","546":"Всем привет,\nвозникла такая проблема у меня есть эти 2 команды:\na=schedule.every(1).seconds.do(sum1)\n\na.scheduler.run_pending()\nкак можно вызвать обновление переменной без цикла while?","547":"Орда (100—249)","548":"да он читает его как он записан там","549":"Не требуется загрузка после изменения кода","550":"не, надо было просто внимательнее доку почитать","551":"Но я б не стал","552":"Что сделал?","553":"Работодателями","554":"я хочу готовое колесо передать, если сначала скачать и указать путь в файловой системе то проблем нет, все ставится","555":"Тут O(N) просто будет","556":"Капец конечно.","557":"Перепиши на Go","558":"Зачем := из паскаля)","559":"Встретились как то двое пробирочных....","560":"Но, конечно, иногда удобно инжектировать логгер","561":"да это просто js  код который ставляет на страницу jquery сам. Но там аккуратней со кавычками телеграм их похерел. Вообще есть либы на гитхабе силинеума + jquery в коробке","562":"+","563":"инсерт инто табле_нейм (айди) волумес (мессаге.фром.айди)","564":"","565":"а, это прям гуйня, а не средство сборка статистики с селери","566":"Ну если модельки не решают бизнес задачки, а только сервак нагружают, то почему бы и не выпилить","567":"Необходимо сделать проект социальной сети с использованием PostgreSQL. Рабочая лошадка - мой пк. Необходимо использовать компоненты, не нарушающие масштабирование. Проблема в тестировании, которое полторы калеки провести не могут (иначе я бы оставил одну бд и описал бы ее работу).\nЯ уже знаю, как она должна работать изнутри, но не знаю, что использовать для реализации. Пока рассматриваю Django.\nНо я таким еще не занимался, вот и прошу совета:\nЧто мне следует использовать в данной схеме\n[пользователь] [сайт] -> [backend] -> [Postgre]\nЕсли я все правильно помню, то  Django хорошо масштабируем","568":"Да, 100 раз перекопировал","569":"ну вот у тебя надо послать сообщение в сокет, хз на каком поде он открыт","570":"там маркер на весь файл в начале указан","571":"Ну так так удвоение. Определённое количество итераций вполне себе можно играть в 0","572":"Как сделал?","573":"Жить в 2к24","574":"границу пересекать не надо","575":"nometa.xyz","576":"Пробовала по тэгу обратиться, ставила на явное ожидание, не явное ожидание, элемент находит но ошибка «элемент не итерабельный»","577":"В консоли аниме смотреть можно и создавать анимации, но это совсем другая история","578":"ну а в setup_module так уж и быть можешь установить глобал в рамках модуля тестов","579":"пытался purge Делать не помогает, есть варианты? Python3.7 смог поставить , но не могу именно на эту версию поставить либы они ставятся на 2.7","580":"После первого расчета сохранить последние введенные данные этим пользователем куда нибудь и при открытии второго расчета посмотреть, а не сохранено ли там что-то недавно. Или использовать локальное хранилище в браузере.","581":"дженкинс пайплайн? почему тогда просто переменными груви не воспользоваться?","582":"и это связка Flask и peewee","583":"Привет всем. Изучаю джанго, пытаюсь делать какой то недофорум. У меня все отлично получается, и я теперь не понимаю зачем вообще нужен js\/vue.js если у меня все и так прекрасно работает?","584":"а url где взять потом?","585":"в хендере можно прописать команду которая через send_message() отправить пинг бота ?","586":"Default mode of text is `rt`?","587":"смутило start=0, что вроде как бы int, а не любой тип )","588":"Я юзаю джангу, в которой есть celery, которому не нужен асинк","589":"Поэтому нынче лучше всего использовать их\n\n`id [INTEGER|BIGINTEGER] GENERATED ALWAYS AS IDENTITY`","590":"Мне нужно все аргументы в одну строку запихнуть для анализа","591":"в прямом","592":"ну вообще мы сейчас про то, как кортежи и списки в CPython реализованы","593":"Хехе","594":"И?","595":"- Хочу засунуть арбуз в жопу\n- Зачем?\n- Выше. Арбуз. Никакой адекватный человек не будет этим заниматься","596":"я додумался до всего этого. Задание не в этом.","597":"в сейвед кинул","598":"Асинхрон","599":"У них бары открыты до 30時\n:)","600":"чет сложная какая то штука. Надо чтобы просто и быстро работало","601":"Да. Может тогда научишься называть Адаптер поверх внешнего источника Гейтвеем, в отличии от Тишки","602":"к сожалению типа string в sql нет","603":"Минус. Но можно сделать байткод","604":"Нет. Эта либа не использует официально апи для ботов, а лишь эмулирует действия пользователей. Это нарушает правила телеги и может привести к бану аккаунта","605":"В мускуле и постгресе разные гарантии при repeatable read, например","606":"Уф. Я уже подумал было, что это как-то связано с ассоциативностью","607":"Шрифты проверь","608":"Что то я не видел таких пакетов с датаклассами","609":"__на тесте все средства хороши__","610":"Ну вот так вышло","611":"Понимать и парсить немног разное, и второе получается с большей точностью вроде","612":"","613":"Oh russian","614":"Да","615":"sublime тебе , наверное , подойдет","616":"ребята, нужно помочь добавить авторизацию в скрипте на питоне, скрипт скачивает фотографии с инсты и поле username только одно, нужно добавить ещё одно поле username которое будет логинить аккаунт","617":"Нет, ты по логике питона сделал две разные переменные, инициализация переменной происходит вместе с присвоением значения","618":"зачем?","619":"Попробуй эмулировать действия пользователя с пк","620":"и не только там","621":"Ты говорил что через PyMysql как то можно,как?","622":"Юзерагент - это не инфа о клиенте, а один из хэдеров","623":"да, это так идет обращение по индексу\nа  ```\"^\"  - эквивалент \"if not\"```","624":"Я потерял нить - где должен быть тогда temp? Каталог Web лежит в одном каталоге с wsgi.py и Database,","625":"\"мы\"? Сколько вас? Можно список? :)","626":"не, а нике это именно символ, а там не эпл эмодзи, а вроде бы сумболия.\nшрифы стоят, конфиги копипастил с sof, ничего не помогает","627":"Фреймы драконить...","628":"Можно к примеру написать скрипт по сжатию видео","629":"https:\/\/docs.pydantic.dev\/latest\/usage\/models\/#reserved-names","630":"Сама ошибка","631":"срез сравнить наверное только","632":"ну тк","633":"Стоит ли использовать для сайта python или лучше другой язык?","634":"?","635":"как найти все записи в таблице sqlite по двум данным и вывести другие две строчки в переменную, а затем перейти к другой строчке?","636":"народ, подскажите, плз, по тестам\nсейчас пишу pytest\nв проекте есть взаимодействие с редис\nкак лучше реализовать тесты:\n1. поднимать и конфигурировать настоящий редис (думаю можно через докер)\n2. замокать и реализовать функции со своим хранилищем\nвопрос актуален так же не только для редиса, но и для других тяжелых бд\nесли знаете статьи какие на эту тему, буду рад прочитать","637":"async def fullbase(chat_id):\n  fb = await posts.find_one({'chat_id': chat_id})\n  return fb","638":"Что-то подобное есть в джанго\nМожно задать шаблон url через регулярку \nЕсли есть совпадения, то возвращается 200","639":"Это неправильно в твоем контексте патчить функцию создания сокета, которая используется любой библиотекой для хождения в сеть","640":"привет ! \n\nподскажите пожалуйста, как сериализовать объект в json массив byte\n\nпосмотрел, что у стандартного модуля json есть два метода\n\ndumps - сериализует в строку, эскейпит двойные кавычки\n\ndump  - пишет в файл\n\nпо факту, мне надо dump, но не в файл в массив byte\nнашел такую либу, metamagic.json , но похоже ей никто особо не пользуется","641":"Грузинский тоже не очень","642":"другое дело что буль идеет неявным подтипом инта, а инт флоата","643":"Ro 1d, тролль","644":"а мне его нужно обнулить но как?","645":"))","646":"С++ ребенку. Да. На книгах по С++ надо 21+ отметку ставить.","647":"Кондишн можно привязать","648":"Ещё вариант рандомная строка в бд","649":"ребят у меня одного глаза сильно пекут от компа?( пользуюсь каплями не сильно помогают","650":"месяцев 4-5","651":"я ее делитнул, но все тоже самое","652":"почему не systemd timer?","653":"Мне нужна серверная бд","654":"Слип прекрасно работает на простых кейсах и его очень легко выкинуть :)","655":"ладно, шутки шутками, но у тебя всегда есть возможность сгрузить CPU-bound работу на process pool executor","656":"\":\" пропустил","657":"+","658":"объект","659":"это вебсокет или что?","660":"Пул и безлимитным может быть","661":"Да и юзать после привычного питона это не очень","662":"на C","663":"это ТЗ - гавно было","664":"не стоит никогда так делать","665":"Что мы считаем проперти класса?","666":"распечатай, что в ответприходит на send","667":"а с доступом дает","668":"Чёт я туплю, не туда кликал)","669":"Там же кодирование зависит от кодирования файла","670":"Да мне уже объяснили все. Спасибо)","671":"А он чем поможет?","672":"Но при этом он должен гарантировать, что пользователь может иметь возможность заменить PySide на свою собственную версию.","673":"А зачем тогда подпись придумали","674":"Так рестартни машину","675":"потому что в данном конкретном случае лень","676":"это можно узнать только как ты проитерируешься по всем его елементам, если конечно  сможешь, но смысла в этом нет, генераторы для  этого  не предзначены","677":"с вирусами👍","678":"Я написал что от os.chmod я смог получить только флаг \"только для чтения\"","679":"Ну в целом архитектура игрухи спроектирована нормально +\/- с пивом покатит. Мейн конечно в конце обычно делают. Ну и на ткинтере игрухи пилить тот еще изврат. PyGame и проще и быстрее работает и много фич из коробки несет.","680":"","681":"DRF. Есть N-ое колличество словарей, которые имеют поле date (дату), но это поле может иметь значение None. Как я могу отсортировать, чтобы поздние даты сверху, а ранние снизу и при этом, None были сверху","682":"Умножение это обратная делению операция)","683":"штааа?","684":"Полтора года ждал?","685":"ага, понял. надо его тоже в енв ставить","686":"Так там операции нампая юзаются разве?","687":"Напишите программу, которая принимает на вход число N и выдает набор произведений чисел от 1 до N.      как решить это((???","688":"Ну в любом случае нужна самая самая самая легкая либа без наворотов, гуи максимально примитивная, гонюсь за весом программы","689":"90% статистических данных придуманы в момент написания сообщения","690":"Привет народ . Кто юзал либу instapy? Норм тема для написание бота ?","691":"Сойдёт, но вот флуд не надо устраивать","692":"Да","693":"как раз для группы питонистов","694":"ну да, и что?","695":"Чтобы я сразу знал нужно ли мне это","696":"уже ставил, ошибка не пропала","697":"Прикольно, но бессмысленно в целом","698":"что...","699":"еще вылезла такая проблема\nесли я не запустил пичарм от имени админа\n pip install --user  PyWavelets\nпишет Consider using the `--user` option or check the permissions.\n\nя могу его как то запихнуть в setup.py или проще написать, что бы юзер сам поставил?","700":"На ru_RU?","701":"рассказуй если можешь","702":"Колледж - хорошая возможность для получения времени на самореализацию.","703":"Насколько помню да","704":"Селениум для парсинга статики?\nЛишняя нагрузка","705":"0_о","706":"это возможно?","707":"в одну строчку не осилил\n```class Magic:\n    randomizer = Random(5041)\n    __hash__ = lambda self: int(self.randomizer.random() * 20)```","708":"че захотел то и выбрал","709":"Ну курлом проще, конечно \nНо неудобно","710":"Оно и видно.)","711":"Может все таки БД?","712":"и про darknet_videos","713":"Ну мне вот на сегодняшний день скажем так совсем бы не помешало если бы я мог, умел, практиковал в хельм чарты) хотя именно я этим и не занимаюсь) но как бы всегда немножко тяжеловато когда не весь контекст понимаешь","714":"Ребятя, а переведите мне кто нибудь на русский вот такую конструкцию:  unvisited = {cell for row in maze_cells for cell in row}","715":"имею ввиду использовать параметризированные запросы","716":"Помогите написать код, пожалуйста. Составить алгоритм решения задачи для определения большей площади если известны радиус круга и сторона квадрата.","717":"С накатом и откатом миграций будет очень быстро","718":"как передаешь?","719":"Всем привет, кто нибудь знает в pyqt5 можно как нибудь запретить развернуть окно","720":"хотелось бы верить, но вериться с трудом","721":"getattr","722":"типикал да","723":"Не делал","724":"у меня чет и вот это не заработало, но в дебаггере seek-ами и read-ами пробежался, вроде как надо все летает","725":"for k,v in dict.items() попробуй) но это скорее в чат новичков","726":"потом заберут в черногорию в рабство","727":"тогда что значил \"пока не закрою\"?","728":"Никто не посмеялся(","729":"Подскажите кто-нибудь почему не работает парсер. Самое интересное, что в процессе написания 2 раза тестил все работало, а на выводе уже нет. Откатывал код до того момента, когда все работало и ничего тоже не работает. Просто пустой список выдает. Вот код: https:\/\/dpaste.org\/tNKL Пытаюсь спарсить обычные страницы с яндекс.маркета https:\/\/market.yandex.ru\/catalog--mobilnye-telefony\/54726\/list?cpa=0&hid=91491&onstock=1&local-offers-first=0","730":"у тасков есть result","731":"чёто я жмякаю, ничего не происходит","732":"Дай.. мм","733":"У всех мобильная телега повисла?","734":"нет, мне нужно на kivy, сделаю все равно же","735":"ах да, если уберу будет также","736":"протон это потрясающая вещь","737":"@hitmaker @Sredafkn Спасибо за помощь и правильные ключевые слова, которые нужно искать.","738":"это я понял, мне так не нравится","739":"Ребята получаю ошибку create_push_notification() got multiple values for argument 'session_key'. Туда почему-то передается id объекта, но я его туда нигде не записываю! Как так то?","740":"Хехе","741":"во-во","742":"не лови исключение","743":"суёшь тело вращения в ванну, объём будет равен объёму вытесненной воды","744":"Ясно не пиши мне ничего","745":"Ща","746":"не всегда","747":"пробовал через apihelper.proxy но у меня не получается может есть ещё какие то варианты?","748":"Надо таск в лупе создавать и не блокировать цикл","749":"А почему в arg такая строка?","750":"Есть лист классов, из него инициализируется другой лист в цикле, все `isinstance` проходят как классы которые нужны, но поля нет","751":"Кто-то скидывал такое\nhttps:\/\/github.com\/dabeaz\/dataklasses\/blob\/main\/dataklasses.py","752":"полля заполнены, нужно заполнить по 5 колонок на 3к строк","753":"15 мб","754":"А тебе надо R или тервер на R?\nВроде самой серьезной считается вот такое. Но не помню, есть ли там упражнения.\nhttps:\/\/www.statlearning.com\/","755":"Задачу решает, выглядит понятно, остальное - вкусовщина","756":"","757":"У меня есть такое\n\n`@property\ndef role_name(self) -> str:\n    return self.game.get_translation(f\"role_{self.roletag}\")\n\n`Дальше у родителя оно переопределяется, могу ли я вызвать это из другого класса таким образом?\n\n`target.super(Player).role_name\n\n`Или я жидко накринжил?","758":"из за чего докер так может отображать?\n```BOT_IMAGE_NAME=bot\nBOT_CONTAINER_NAME=bot\nBOT_NAME=bot\nPG_CONTAINER_NAME=postgres_db```","759":"Тут нигде не написано про то, что ты здесь говоришь","760":"А в двойке таки уже нужно явно передавать списком и подобным\n\nhttps:\/\/github.com\/aiogram\/aiogram\/blob\/dev-2.x\/aiogram\/dispatcher\/filters\/builtin.py#L533","761":"просто в регулряках есть опция такая как A-z но есть и такое, чтобы брать символы которые есть в любом алфавите языков","762":"Да, выглядит действительно интересно. Впервые за время пользования телеграмом вижу такую метку.","763":"Принципи разницы нет, можно создать функцию импортов с помощью того же listdir, но не знаю имеет ли смысл такая конструкция","764":"ну значит зп прогеров падают","765":"А, ок","766":"Да(((","767":"Можно пример с этим replace_na ?","768":"Почитай про либу pipeline","769":"а у тебя фоновый сервис или просто приложение?","770":"яндекс определил по исходной картинке 8)","771":"Всем спасибо! С вашими ответами жить стало легче))))\n@kanavis\n@evle_zzz\n@VG_Vladimir\n\n🌚","772":"","773":"В лс","774":"лента да. Но ты не забывай, что еще в realtime чекается сообщения, фидбэк лента (пример вк - лайки комментов, прочие оповещения).","775":"ор","776":"Если ты один пишешь, то и искать не надо","777":"это","778":"Будет так же как синглтон первое время. Но ты будешь контролировать как он создаётся и в случае чего сможешь передать разные инстансы в разные места","779":"помогите я 5дней в пайтоне","780":"ОК!👍","781":"Тебе прям вот это все надо?","782":"Здравствуйте\nМожет кто-то понимает.\nУ меня свой номер телеграм удалил ,потом при повторном рег пишет что номер забронирован.\nЕсть какие то способ ы?","783":"ну итератор это навигация и перебор элементов","784":"","785":"А сейчас стикманов не рисуют потому что порог входа повысился","786":"ды, даже по шрифтам видно","787":"Не у компа. Но Event наследуется от BaseModel","788":"у меня ваще пуск такой","789":"Справедливое замечание, трудно не согласиться.","790":"https:\/\/t.me\/advice17\/24","791":"Ну, судя по ориг сообщению (а он указал \"например из а\") ему нужно проверить, состоит ли слово из одной буквы","792":"Нет, для личных целях","793":"если ничего не путаю","794":"Ну фриланс тоже бывает стабильный и нестабильный","795":"Максимальное количество ключ значений? Должно быть ограничено лишь памятью на твоей машине.","796":"действительно, еще и нам пришел вопросы задавать","797":"Вернуть статистику игрока за все карты","798":"Если его создать в мэин треде, и в каждый запрос передавать кго переменной чтобы делать в нем submit?","799":"А там когда доходишь до оплаты выходит эта надпись?","800":"поняли?","801":"277182","802":"Благодарю, поглядим.","803":"Это где","804":"Это я пробовал еще когда он только вышел.","805":"https:\/\/t.me\/it_mem\/2902","806":"","807":"не, в телеботе такая хрень реально есть)","808":"Вот тут. Причем здесь классы?","809":"На язык напрашивается opencv почему то","810":"Здравствуйте, что можно использовать вместо request в telegram боте или как авторизоваться когда он сам генерирует какую-то каптчу внутренню","811":"А, хмм, рил","812":"Не сработает","813":"и те, кто отважился помочь","814":"```self.layout```\nэто не \n`self.layout()`","815":"Ну из него можно и неплохой перформанс выжать, но это упарываться надо, да. И по ресурсам прожорливый","816":"...","817":"4 столбца","818":"именно так","819":"Кидай текстом","820":"Добрый день. Отдам клиента с готовым порталом на Django в хорошие руки для дальнейшей разработки. Подробности в личку.","821":"У меня винда","822":"не, не надо ничего передавать","823":"По идее, если у тебя WorkingDirectory указан, то ты можешь не полные пути указывать, но это уже проверять надо, не помню","824":"А в чем преимущество перед датаклассом?","825":"Ладно, не суть. Есть возможность сменить вид окна на закос под винду 10?","826":"а не","827":"Какая разница какой язык","828":"Хз\nЯ последнее время когда «архитектуру» продумываю, то сразу думаю о простоте написания теста \nЕсли тест легко пишется, то все ок\n\nМб херовый подход, конечно","829":"🚀 Ваш индификатор: (1075865526, 0)\nСмотрите, с помощью базы данных sqlite3, вывел сообщение, ID юзера и еще одну переменную, как мне сделать чтоб убрать запятую, и ()?","830":"Уф, я испугался что ты какой-то пиинсталл ещё откопал","831":"где есть обходы капчи сразу в бан","832":"Йо, у кого есть власть в @ru_python_beginners? 1.5 года как не могу туда попасть.","833":"Видеоматериал","834":"Сохранил себе на случай важных переговоров.","835":"жэто был камень в мой огород?","836":"Да","837":"ну и из итератора не составит труда получить список","838":"Можешь подсказать как это делать, пожалуйста?","839":"примерно как firewall в ядре реализуется при помощи netfilter, к которому есть несколько интерфейсов iptables, nftables и так далее.","840":"C прекрасен в своей простоте. Но задача «у тебя есть голая машина (пускай даже на Linux), нужно сделать POST-запрос с JSON по HTTPS», тривиальная для всех современных языков, на нём решается неприличное количество времени.","841":"тебе, наверное, `reversed` нужен.","842":"CSRF токен?","843":"если будешь писать и читать по одному смещению в разных дескрипторах - могут быть проблемы синхронизации. А если по разным - все норм","844":"а что ты в ггул ввел?","845":"спасибо","846":"Про репр и консольку в связке с твоей стороны вообще речи не шло","847":"тогда ведь есть не только N + M, значит дока голанга не все вопросы покроет, тк в ней только про N + M","848":"Хоть 4","849":"Нет","850":"все ладно дальше уже сам, всем спасибо","851":"Зачем тебе арифметика если есть компьютер?","852":"А если просто запустить python.exe и в нём сделать?","853":"пока ссд в 5 раз дороже жесткого за Гб он экономически невыгоден","854":"Думаю, сначала нужно четко описать задачу, выявить несколько подходов решения к ней, а потом уже реализовывать и сажать на рельсы конкретных технологий.\n\nПока что все выглядит сыро, а громкоговорящие метрики по типу \"1к записей в секунду\" - ни о чем не говорят. Является ли запись I\/O операций в БД, либо запись это I\/O операция по сети (аналог запроса), не понятно.\n\nОбычный сервер python + fastapi держит примерно 4-4.5k RPS\nОбычный постгрес держит примерно до 18-20k OPS\n\nЕстественно, при наличии должных аппаратных ресурсов.\n\nВ вашем случае думать о вертикальном масштабировании не имеет смысла, ведь сервис должен (судя по задаче) получится stateless, а значит он прекрасно отмасштабируется горизонтально.","855":"Вагон текста без подстанвок усложняет и провоцирует ошибки сильнее. Я тоже не в восторге, но иногда нужно именно это.","856":"А какие еще есть варики?","857":"хотеть убунту на гноме💕","858":"Не строкой записать","859":"Ну мне основу через месяц на компьютер перейду","860":"Шта?","861":"Вообще молчит, отправил на старте как обычно сообщение и все, ошибок с апи нет","862":"Алгоритмы и паттерны","863":"Checkio, Project Euler, Codewars, Leetcode, Hakerrank, Advent of Code, тысяча их","864":"я пытаюсь сделать вьюху в строку, слайсинг без копирования, кароче","865":"А точно. Спасибо, что поправил.","866":"А хуле нет?","867":"или в pathlib есть parent","868":"почти","869":"Так говорю что писал уже блог","870":"пытаюсь понять кто сошел с ума","871":"Просто, не знаю, есть ли такое в питоне. Просто как я понял у питона на каждый чих есть эти всякие ____get____ __или __set____ и много чего ещё","872":"оопшный ооп","873":"если кешируешь что-то пользовательское","874":"А так pyarmor как раз то что надо, шо с ним не так","875":"Легче просто забить чем понять это","876":"я вот вообще че придумал","877":"Не обязательно в офисе, можно дома работать","878":"Не получается","879":"Тогда в исходники пора лезть","880":"я подозреваю, что в этом нет причины :D","881":"Да)","882":"у меня тоже докер и я тоже с консоли могу запускать, но мне лень и за меня все запускает машинка","883":"🤔","884":"На задачу не тянет, но не хочешь говорить, так не говори","885":"Аудитория чата","886":"https:\/\/github.com\/McMCCRU\/rtl8188gu","887":"","888":"ещё иногда я сортирую импорты не по принадлежности+алфавиту, а по длине строки","889":"https:\/\/habr.com\/ru\/company\/domclick\/blog\/572272\/\nтам человек делится опытом, связанным с курсами. Мне кажется, дела обстоят примерно так, как он описывает.","890":"Как-то чуточку, но не очень.","891":"файлы платные","892":"у плюсов его нет, ~~одни плюсы~~","893":"всм флаги*","894":"Угу","895":"читать про venv в первую очередь","896":"я не эксперт, но кажется интернет не так работает","897":"я бы макбук вообще не стал брать","898":"с чего бы?","899":"Ребят привет, кто делал дипломную или курсовую по прогнозированию, напишите в лс.","900":"Ахахахах))) скилловый","901":"Можно поменять валюту внутри бота\nИ выводить и в Украину","902":"Будь по проще! Злой","903":"только что было 14900+ мемберов, уже 15500","904":"фотки скидывать нельзя?","905":"ну, discord.py - например, вполне нормально","906":"чего злой такой? попросил помочь и все","907":"а физически тоно айпишники все верные на тот сервер куда надо лезешь а ключ “пропал”?","908":"нет","909":"Со всеми соответствующими библиотеками","910":"Просто я помню прикол с айсортом \nУ нас приложения в пакеты с setup оформлены, а `pip install -e .` никто не делает и ci также сделан. Из-за этого у меня импорты всегда не такие, как их ci видеть хочет. \nДолго с этим воевал","911":"Разве?","912":"UAC windows гугли","913":"Тссс... помолчи.\n[PAVEL DUROV](tg:\/\/user?id=5614744806) заглушен(-а) на 1 день.\nПричина:\nесть же правила","914":"а о каких транзакциях идет  речь? БД или какие-то взаимодействия между сложными объектами приложения?","915":"пароли зашифрованные в бд, почему это не надежно?","916":"Хотя, это не будет работать","917":"Впрочем, на днях я ездил в другую страну за книгой. Интересная жизнь","918":"та не, помоему можно скачать инсталлер каталины и обновиться так","919":"я так понял там сетап с загрузкой всех пакетов","920":"почему это conn.sadd ( str(message.from_user.id), message.chat.title )\nвызывает ошибку: WRONGTYPE Operation against a key holding the wrong kind of value\nа когда делаю, например так  conn.sadd ( str(message.from_user.id)+\"_\", message.chat.title ) все работает","921":"нет, не в курсе","922":"Ну разве что rosalind чекнуть на тему того, какие вообще навыки используются","923":"Ребят","924":"html?","925":"Как в канареечных релизах выделись отдельную группу пользователЕЙ? (Сори за оффтоп)","926":"","927":"Ну, не единственный, там семейство есть, но они все эквивалентны между собой. Одноразовые блокноты с длиной ключа, совпадающей с длиной текста.","928":"соре, похоже слишком сложный рофл для тебя оказался ))","929":"\/report","930":"Добрый день всем!\nНовичковый вопрос, не могу разобраться. Пользовалась долгое время anaconda navigator. В какой-то момент вылезла ошибка : просроченный сертификат. Почитав в интернетах решения, решила переустановить конду. Сейчас при запуске и попытке сделать хоть что-нибудь, выдает ошибку:\n\nProxyError: Conda cannot proceed due to an error in your proxy configuration.\nCheck for typos and other configuration errors in any '.netrc' file in your home directory,\nany environment variables ending in '_PROXY', and any other system-wide proxy\nconfiguration settings.\n\nЯ добавила конду в список  разрешенных приложений работы через брендмауер, но ничего не сработало. Кто-нибудь сталкивался с такой ошибкой? Спасибо...","931":"А почему нельзя было код отформатировать нормально?","932":"апишку гугла я уже прикрутил, напрямую работает","933":"Какая?","934":"Не надо ансейф хэш","935":"нет, HTTP работает не так","936":"интересно как ты пришел к такому выводу","937":"Гугл: ```доки по питону```","938":"Доступность низкая. И частые сбои. Также на ДО. Но для теста пойдет.","939":"Так их кто-то продаёт почему бы и нет?","940":"Прокачайте умение \"нахождение информации в поисковой системе\"","941":"ну ты жмешь на зеленую стрелочку, если правильно среду настроил, либо в терминале ранишь","942":"я остановился на стандартной теме","943":"Добрый день. Подскажите пожалуйста, может быть кто-нибудь работал с Google Places API? Сейчас к нему нужно обязательно привязывать платёжные данные? Я слышал раньше можно было получать например 5 отзывов из этого API бесплатно. Собственно большего и не требуется, достаточно будет пяти","944":"Имеют конечно","945":"в лс","946":"Слишком абстрактные требования, задача не ясна","947":"только в коде и в ф строках","948":"Далее необходимо 3д модель сохранить в какой то формат?","949":"Так хорошо но он же есть и туда заходят почему я не могу сделать парсер на обновление контента и смотреть удобнее напр по через телеграмм ? Этого он не хочет я не думаю что это вред ему несёт )","950":"список это динамически расширяемый массив однотипных элементов","951":"помогите опять поделку победить ? чего ему не хватает ? pyflux пакет","952":"Ну там можешь поэкспериментировать)\n\nЧаще всего регулярки сходу не придумать, приходится писать и проверять. Ну а это можно самому сделать)","953":"На 3.13?","954":"Если хром закроешь, хватит","955":"подними руки вверх и медленно отойди от клавиатуры.","956":"Не понимаю как их сравнивать то можно🤔","957":"ну эт SIGKILL, видимо ресурсов не хватило. чо по озу?","958":"а должно быть стыдно писать ~~на питоне~~ ботнеты","959":"Гениально вроде, нет?","960":"типа из папки python main.py?","961":"что еще сделать?","962":"Можно оставить только внешний контур, удалив из фигур все внутренние пересечения. И сравнивать уже по внешним контурам.","963":"но ты же не завернёшь принт в строку :)","964":":)","965":"звучит страшно. скажи полностью задачу","966":"ты можешь установить скрипты в папку \/dir\/dir1\nа можешь в \/dir\/dir2\n\nя так понимаешь ты предлагаешь прописать from \/dir\/dir1 import <module_name>","967":"Нафиг он нужен я не понял","968":"«вернули какую-то фигню» - это уже нарушение контракта, что, конечно же, приводит к проблемам.\nОчень часто встречал ситуации, когда исключения были просто как объекты событий вверх по стэку вызовов, думаю понятно каково было читать и воспринимать такой код.\nЯ стараюсь минимизировать использование исключений, так как они снижают контроль над потоком исполнения (например, в GO исключений нет в том числе и по этой причине) и увеличивают связность кода, что повышает сложность.","969":"на 2 компах стоит локальный интерпретатор и набор библиотек. все одинаково","970":"у меня наджаро,через pacman попробовал, по началу все было хорошо, но на середине установки выскочила ошибка пакетов фласка.","971":"Приет всем! Как получить полную дату по дню недели? Если в счет идет только текущая.  \nПример на скрине","972":"orders_scheme = BoostOrderSchema()\norders = orders_scheme.dump(orders)\nгде-то тут?","973":")) а готового нет ничего, да? я нашел pilkit но там он новый обьект создает а мне после ресайза надо watermark  наложить\nAttributeError: 'ResizeToFit' object has no attribute 'paste'","974":"","975":"Пайтон так популярен","976":"Да кто это ваше \"оно\"? Pickle  и pickledb это разные модули.","977":"у меня вообще тут дофига зеонов :D","978":"по сути `reset` перемещает HEAD на тот коммит, который ты указал","979":"Сервис кто-то дожен создать и зарегать в ОС","980":"а при чем тут GIL? до того чтобы он уперся в CPU мы еще не дошли.","981":"А что с аппендом не так, по мне удобен и два варианта есть, с автоматическим ростом и заранее заданного размера","982":"А что значит \"смотреть что в процессе происходит\"?","983":"В calendar ничего нет?","984":"Связать","985":"Глянь, в доке примеры должны быть","986":"@deluxoft, твой выход","987":"Не люблю ковыряться в навозе","988":"Я с вами тогда)","989":"","990":"Ну да, дизайны строю в фш, потом верстаю, я же сказал фронтэндер я","991":"Единственное, чему там учат -- заманивать других в вуз","992":"Когда вызывается метод не перезаписанный в явном виде (берущийся от класса) с методом происходит все тоже самое что и с property где fget это функция которая биндит экземпляр к функции (сохраняет в атрибут\n```__self__```\nитоговой функции)","993":"Тебе нужна только 1 сумма или все?","994":"ну ээ, так-то везде правят баги %)","995":">  а потом вот это же строго указанное количество байт данных из сокета. и единожды.\n\nеще раз. никак.","996":"С тебя тридцадка","997":"nometa.xyz\n\nспрашивай","998":"Тебе нужен лист компрехеншн","999":"Дайте плиз тематический чат по caddy"}}