{"text":{"0":"Версия это не битики местами поменяли или обозвали по другому это а прям алгоритм работы другой","1":"Тут ноль объяснения","2":"Вопрос, у кого-то такое бывало? Ставлю чистый вс код, ставлю плагины (ну там для дебага, поддержки языка), потом после нескольких рестартов\/через пару дней всё умирает - дохнет реформат, а иногда и проверка синтаксиса, перестаёт билдиться, при дебаге может начать регулярно крашить. Причём это не только с растом такое.\nЯ что-то делаю не так? Винда что-то творит? Разрабы плагинов и вскода мудаки?","3":"это типо тот, который не должен быть прерва?","4":"Hi Igor!","5":"[korpse](tg:\/\/user?id=636787316) какой чип взять для простого клавиатурного USB-деваса, чтобы дешево и все работало? F1?","6":"stlink напрямую в комп воткнут или через кабель?","7":"минут через 5 перепроверю","8":"До офиса доеду тоже закладки посмотрю","9":"за минус декодирование как я и писал выше","10":"@k00rpse я тут нарыл прикол из-за которого 216 МГц может на ф7 и не работать по умолчанию","11":"Продают жопу терре и компэлу","12":"*пожимает плечами*","13":"Это не баг, а фича!","14":"Atten st-862d","15":"белый экран выведу без проблем )\nмогу даже синий )","16":"они просто ее НЕ ПРЕРЫВАЮТ","17":"Так это относительно новые чипы и цена за 10к штук)","18":"А что должно происходить?","19":"а что если гнать раст в llvm IR а потом уже нативным llvm в трикор?","20":"а то что-то третий день читаю","21":"ХЗ)))","22":"идея в том что не сломается, раст это должен абстрагировать теперь","23":"коротче, я так понял, все таймеры инкрементятся самостоятельно контроллером. Каждый со своей периодичностью. И посчитав частоту осцилятора на периодичность  - можно вывести человеческое время","24":"Что прям показательно","25":"@k00rpse кстати вот тебе прикол - светодиоды настолько упоротые что горят от X стейта ног","26":"Не знаю ни одной реализации, но выше в целом ответили куда больше","27":"Хмм","28":"не, это здесь вообще ни при чем","29":"","30":"https:\/\/gist.github.com\/mexus\/7285f197a16ce6d46400fab04a439b1f\n\nвот я примерно так делаю","31":"Хочу на расте железячить, есть куча компонентов ардуинки, че взять?","32":"Вечер добрый! Есть кто-нибудь знакомый с протоколом powerlink?","33":"И сколько он ещё будет лежать в пнстейбле","34":"эррата и отечественная документация лежат в разных вселенных и их надо как камни бесконечности собирать","35":"но зачем? я тут пишу в конкретный регист","36":"а там даже core никакого нету? по идее надо ж таргет определить и интринсики какие-то чтобы оно собиралось","37":"вон @dotcypress его гоняет)","38":"Ладно, в личку написал","39":"что-то прям жирно","40":"f# выглядит как хуйня","41":"ну вот, и проблемы нет :)","42":"Главное чтобы регион RAM определял непрерывный кусок памяти, а не просто \"в этом чипе 80к памяти, так что регион будет размером 80к\". При этом какие-то регионы памяти могут оказаться бесполезными, если их несколько в разных местах","43":"HAL должен позволять делать код максимально портабельным, а не гадать на APB1\/APB2 для каждого нового чипа","44":"Да уж...пожалуй пора выкидывать в мусорку f103\n```","45":"[korpse](tg:\/\/user?id=636787316) а ты не смотрел - можно ли в ф10x перетирать id?","46":"На assert!(sysclk <= 216_000_000)","47":"надо им показать прелести работы в консоли, а то они без UI пугаются ))","48":"Ну да, все пашет: https:\/\/play.rust-lang.org\/?version=stable&mode=debug&edition=2021&gist=407e2f23fb144fc12d7e4befe4b6e6e6","49":"внезапно","50":"что-то не то","51":"","52":"Не","53":"Ну вместо крудов ещё можно ныне модные кокчейны либо фронтэнд","54":"приятно удивлен","55":"FTDI","56":"отлично","57":"Пока что две платы воткнуто, но потенциально там 8 слотов","58":"Какие 4ггц осциллом?","59":"я про v100","60":"Это в каком институте новосиба такое преподают?\nИль из академгородка?","61":"Там немношко печально","62":"И офигенно дёшево как для флексов","63":"спасибо, буду думать","64":"был на его воркшопе на растфест, кстати","65":"Ну я скорее про драйверы)","66":"команды вима и емакса смогли и ты сможешь, мы в тебя верим","67":"никто не понимает, даже они сами не поняли","68":"Но они же сюда не пришли :)","69":"Кстати, а этот ресурс тут проскакивал уже? Случайно наткнулся","70":"Есть минимальный пример не работающего варианта? Как узнаёте, что не работает?","71":"касательно PWR, OD и прочего?","72":"также как и искать общие блоки","73":"Все остальные извраты это другие классы устройств","74":"Так и говори методом подбора","75":"ну вот смотри - после перепрошивки он вполне юзабелен для баловста до примерно 20 МГц (но там уже нифига толком не видно)","76":"Удалось воспроизвести уязвимость в F0, которая без глитча работает","77":"О, даже не знал про такую вещь, удобное","78":"так может это товарищ майор на таможне играется с твоими платками","79":"Да, он там для управления всем этим добром","80":"про регистры никто не ноет потому что та версия что сейчас в мейстриме просто говно","81":"похоже не винбонд память, но сфоткай чип поближе","82":"а не запилить ли мне на Расте и элементах пельтье холодильник?\n\nА то вот жене нужен на 18 градусов для шоколада 😁","83":"Да блин, для F4 нужен совершенно другой драйвер, я просто не вижу смысла мешать два драйвера в один","84":"бери. выучишь один стм32 считай все остальные выучил )","85":"им это не нужно","86":"О великие костыли\nhttps:\/\/twitter.com\/widoraIO\/status\/1259493940127916032?s=19","87":"лол так тебе можно наверное и так ссылку кинтуь","88":"не только, ещё дма","89":"ты видишь на карте два изернет разъёма это для кольца так делают","90":"У меня пока что даже нет хостовых девайсов с Type-C, даже зарядки нет)","91":"Или я ошибаюсь?","92":"я его только на картинках видел","93":"В probe-run немного лучше сделан вывод rtt, например","94":"Разве что с регистра вычитать","95":"SafeRTOS, AGL, QNX","96":"на местном радиорынке мне пытались продать мосфеты irlz44n по 100 рублей за штуку\nв итоге психанул и взял на алике 100 штук за 500р","97":"ldm тоже хорошие платы делает для миландров, а главное сопоставимо с дискавери по цене","98":"ну это как раз называется точка - точка","99":"короче в ф7 озу разбито на две части - основное + 16 КБ","100":"а уже потом делать что-то своё","101":"А ещё в std версии там не *10, а checked_mul","102":"Не, с микростеппингом точно какая-то хрень","103":"точно видел где-то такое в build.rs","104":"скажу что там много ядер risc-v 64","105":"а это оплата по pay pass","106":"битовый сдвиг вправо на три))","107":"иначе будет как на одном из моих проектов где я убрал вывод флагов типа фрейма и стало на 30% быстрей","108":"Но сделать его не сложно","109":"да никто не будет в secure boot переписывать загрузчики на раст — он должен быть собран заапрувленным тулчейном и в той же самсе там тула которая подписывает не умеет ни во что кроме С","110":"Вот как то даже не знаю что ответить. С одной стороны логично и не поспоришь. Вроде и я не дурак, тоже пытаюсь проектировать систему. Этот проект в который раз переделываю, что бы использовать опыт из предыдущих итераций разработки. Если есть какие то гуру техники как заранее сделать хорошо, было бы очень интересно почитать :)","111":"Видел скару на шаговиках, она таки очень быстрая была","112":"async в no_std уже давненько используется","113":"бодрейт то один и тот же","114":"'DUP POP' :)","115":"да и в целом - я четыре байта посылаю (может будет больше). Чтобы разом их разбирать","116":"Получил лучевую болезнь значит есть утечка памяти","117":"потому что я не уверен","118":"Но так вообще можно зайти в чят rust-embedded и попинать thejpster, он вроде адекватный","119":"это когда ты будешь работать с кодом который старше тебя и твоих предков и твой тимлид не даст его менять потому что он работает везде","120":":)","121":"потому что там списанные стм32ф101 прокачанные до ф103","122":"та не, слишком просто. вот доделаю текущий проект - его добавлю :)","123":"вот только не дергает похоже","124":"Кстати нет, не должно примерно вровень, даже ниже по идее. Но тебе виднее по месту","125":"`dev@state ssd1320z2 % rustup target add thumbv8m.main-none-eabihf\ninfo: downloading component 'rust-std' for 'thumbv8m.main-none-eabihf'\ninfo: installing component 'rust-std' for 'thumbv8m.main-none-eabihf'`","126":"@k00rpse а ваш dfu он с двумя банками флешки умеет работать?","127":"та они пишутся какими то невероятными орками","128":"ну у меня были свои наброски но я пока забил на это","129":"Нет, хотя я видел у одно из немцем намёк на это","130":"Мой пришел пару дней назад, поигрался со SpinalHDL, на выходных попробую риск с растом туда пихнуть","131":"Да у меня две борды на махе третьем лежат","132":"https:\/\/m.aliexpress.ru\/item\/32958158995.html","133":"велкам","134":"оно генерит verilog\/vhdl","135":"без сообщества, готового тулинга, раст действительно игрушечный язык)","136":"ну это все знания полученные каким то жизненным путем","137":"Так не будут делать, это тупо не выгодно","138":"В 4.0 тоже","139":"почему бы просто не оставить старый хал как есть и просто в новом сделать бридж на старые трейты, причём бридж обратимый и без всяких этих версий","140":"Контур","141":"Там два канала цифровых и два аналоговых","142":"Побайтово?","143":"Вот да.","144":"просто его надо классифицировать, а то я вчера сидел и просматривал глазами все его 160+ репозиториев. Там что-то годное, что-то заброшенное, что-то местячковое","145":"кстати в Good practics у меня там не будет безграничного вектора или ссылки на array а будет вполне конкретных размеров объект","146":"👍🏿","147":"есть мнение что пытаясь реализовать gas gauge на контроллере ты больше энергии потратишь чем хотелось бы","148":"Нет, он просто активируется другой последовательностью","149":"крутяк!","150":"а, пнятн. парни держат .a в бинарях и рекомпилят по мере изменения .s файлов","151":"Очень много и про Миллера написано","152":"НО НЕТ","153":"того самого которым заливают эту флешку","154":"в смысле?","155":"потому что это не детерминированно и опасно","156":"по крайней мере в финке","157":"Зачем причем почему тут gcc не ясно","158":"Ты устанавливаешь одни параметры pll, а я потом читаю совсем другие","159":"ладно, с вами смешно, но мне пора.","160":"завтра все посмотрю","161":"Что ж, придётся компилировать с opt-level=\"s\")","162":"я просто понял, простил и отпустил — пускай кто-то другой мучает это говно, с меня хватит","163":"Это да.","164":"азул выглядит недоделанным","165":"ща вкачусь, потом работу сменю","166":"ну вот надо читать","167":"да","168":"и f1xx скоро перестанут выпускать","169":"Т.е. у ардуино дефолт 5В, а у нуклео 3.3В, верно?","170":"но можно обертку конечно сделать, типа unsplit :))","171":"Сделайте биндинг к либе которую хотите юзать и будем вам счастье, а комьюнити полезно","172":"пока я не увидел на это PR","173":"0 целых и один жапарик","174":"Пытался разобраться как использовать env в cfg. В итоге, никак!! (\nНо оказалось есть решение попроще","175":"надо заднюю включать на момент ))","176":"Если ты пин посадишь на землю, то ток может и не через vcc потечь, а через сам пин","177":"вроде все верно. а кнопка самодельная? дребезг фильтруешь?","178":"донатов накидают и можно будет подумать","179":"Схема лежит в этом архиве)","180":"у тебя два раза линкерскрипт задаётся","181":"Разберись как в целых числах работать с ядром","182":"см. выше - я хочу избежать создания здоровенного массива в коде.","183":"А что мешает тебе ещё один раз её заюзать для другого пина?","184":"SoftDevice от нордика крайне не советую использовать если есть такая возможность.. ужасная архитектура, ужасная документация, тонны подводных камней, жесть просто. Чем во всём этом копаться, вполне может быть быстрее выучить Rust и написать с нуля.\nЕдинственная положительная сторона - после всех мучений работает довольно надёжно, хотя доверия - 0 всё равно.","185":"Я тут смотрю на crates.io и как будто бы там нет примерно ничего","186":"Ну там сложно уследить за мыслью, да","187":"let t = serial.read_exact(buf);\n\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/ buf[0] = 1…\n\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/ buf[1] = 5…\nbuf.reverse(); \/\/ buf[0].swap(buf[N}) … \n\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/ buf[N] = 111… oops\nlet (buf, serial) = t.wait();","188":"вроде riscv32-unknown-elf-gcc и есть корректное название","189":"Или один, смотря как считать","190":"Имеешь в виду те, когда линкер связывает?","191":"соответсвенно duty = chX \/ arr","192":"У меня пока все чипы для камер были с nda, ужасными доками и бинарными блобами","193":"дело скорее в том что вы не понимаете как что работает","194":"А ты не бойся, сходи на интервью)","195":"> тиклесс поверх систика","196":"а они есть в продаже?","197":"что-то находил, про доказательства самого языка","198":"а где ты его обнулил?","199":"а надо правильно делать загрузчик и тогда не надо будет ничего нажимать)","200":"У меня просто нет оснований покупать железку, которая нужна лишь чтобы что-то работало у небольшого процента пользователей","201":"я просто работал когда-то на одно нии где очень любили продукцию этой фирмы и там разных умудрился пощупать","202":"может с клона слить проще? :)","203":"Радикально","204":"да, фридом который","205":"потому что в раст экосистеме нет нормального кросс денсити для хала","206":"если не представляешь то тебе это и не нужно","207":"Sdio можно в одну линию сделать, все равно занято?","208":"тем более что билд бота я починил и теперь можно реально его использовать","209":"from_be_bytes же не входит в типаж From )","210":"Смотрится угол отклонения под воздействием нагрузки?","211":"Это не значит что он не лишён багов в том числе в компиляторе","212":"да, верно понял","213":"Она и в хост умеет","214":"фигасе а такое даже возможно?","215":"@no111u3 нашел тут такую статью http:\/\/engineering-science.ru\/doc\/134544.html","216":"Тут загвоздка вот в чем. Например, есть амплитудный фильтр, он считает среднее за 1000 отчётов и если больше порога, то значит впереди потенциально есть данные, но тут у нас курсор текущей позиции подошёл к курсору конца. Теперь нам ни чего не остаётся кроме как ждать нового куска. Если бы мы обрабатывали в несколько потоков, то следующий кусок был бы в другом потоке.\nХороший вариант мне понравился с unsafe записью в тот же вектор где и обработка. Поскольку вектор аллоцируется только один раз в начале и его размер мы точно знаем, а курсор конца может двигаться только в момент получения данных, то самый большой проблемой мне пока видится это \"подготовка\" вектора перед началом всей работы. Ну и ещё dma можно палочкой потыкать, но не уверен сработает ли","217":"ну вон выше по линке немного инфы про fir и half band filter","218":"https:\/\/twitter.com\/ferroussystems\/status\/1225814480308887555?s=21","219":"Да","220":"то ли у жапарика, то ли в rust-embedded был крейт с структурами данных которые примерно это дают","221":"что я ещё могу сказать","222":"Google says bare metal solutions","223":"давай ТИТ","224":"У меня как видишь на фотке наоборот","225":"нет, единственный ближайший Robigalia - но они используют стоковый seL4 и лепят поверх него прослойку на расте","226":"ога","227":"вот как вы пушите что у вас клиппи ругается","228":"сделать pure rust simulator","229":"Ну да","230":"Сейчас нельзя, да. Сейчас там нихуя практически нельзя.","231":"Ну так проектирование железа это всегда так, это там физика в школе игрушечная, а вот радиоэлектроника всегда настоящая","232":"Когда я в европейских карах участвовал там куникс только на древнем мерсе остался","233":"гоняют байткод","234":"Вместо мисры надо чтобы на расте писали","235":"у вас будут кошкодевтчки, у нас мемасы с профунктора","236":"Доброй ночи. Уже весь мозг сломал. Как этот Rc опознает Weak и почему после удаления объекта в Rc происходит ссылка на удаленный объект или это и есть та самая утечка памяти?\nhttps:\/\/replit.com\/@122334444\/MemLeak0#src\/main.rs","237":"с чего такое заключение  ?","238":"а у атмела это есть уже начиная с 40 ногих)","239":"Но ностд мне на самом деле не нужно )","240":"примера с прерываниями правда не смог найти","241":"А вот обойти это ограничение это прям нужно хорошо постараться","242":"из-за всяких лайфтаймов и лямбд","243":"в принципе ничего, rustup add target сделать с нужным таргетом, поставить cargo-xbuild и вперед, посмотреть у жапарика примеры под cortex-m","244":"кто-нибудь тыкал, спрашивай конкретнее","245":"сорри, перекусить нужно было, несколько часов пробовал заставить работать)","246":"новой зависимости нужной версии?","247":"Типа чтобы настроить сетевой интерфейс ты сначала заходишь в него, после чего тебе становятся доступны команды для интерфейса","248":"ну то есть прикрутить к этому DMA нельзя примерно никак, а прикрутить прерывания можно только вместе с операционкой, которая будет nb нормально реализовывать","249":"\"заработал на расте\"","250":"И если ты почитаешь новости от мозиллы то узнаешь что она больше не дом для раста","251":"хал свой написать можно - помогает разобраться с железом","252":"ты главное не нервничай, мы токсичные как настоящие разработчики","253":"Rust на fpga 🦀","254":"Ну хакинтоши гоняют всякие извращенцы, и ничего.","255":"Определённо лучше, чем было!","256":"@k00rpse ^^^","257":"у меня это и хобби и лайфстайл","258":"Какой-то очередной китайский нонейм","259":"у жапарика подглядел","260":"","261":"У меня глупый вопрос: как отправить по rtt сырые байты?","262":"нет","263":")))","264":"ну да","265":"кэп?","266":"","267":"Раст)","268":"да, в сишке гораздо круче - ты всегда всё сам. и UB","269":"Не. Тут бобрам вживляют чипы, и они строят элитные коттеджи","270":"Есть","271":"та ладно, risc-v как раз простой в доску","272":"а я могу их где-то получить чтобы ориентироваться по мере необходимости?","273":"https:\/\/doc.rust-lang.org\/cargo\/reference\/source-replacement.html + --frozen в карго","274":"ну кстати да","275":"зато легко!","276":"нет, компилятор не дает им никаких гарантий","277":"Nordic предлагали выслать девкиты желающим, но DWM1001 -- явно не их девкит","278":"мне на нём светодиодиком мигать плавно, точность вопрос третий. включил осцил - на ноге тишина","279":"кстати насчёт sdr нашёл 80 mbps по цене грязи на али, думаю заказать по приколу","280":"Шекспировский диалог","281":"Доккеру в любом случае нужен бэк","282":"[Никита](tg:\/\/user?id=258524137) лучше посмотри что такое потоковая обработка и пакетная, и что задачи можно менять не только по принудительному вытеснению","283":"Еще две пиздюлины малиновые пришли","284":"Ну я железом обзавёлся, как проверю что оно рабочее так продолжу. Я же тестовую либу сменил","285":"🤷🏻‍♂️ для домашнего использования сойдёт.","286":"ну в случае со ртосом создаем контексты и переключаемся по таймеру между ними","287":"ога, поизучаю, спасип!","288":"во вторых рал этот ваш он собрал кучу девайсов в один","289":"Вариант с FIFO работает отлично","290":"Кажется я знаю этот проект","291":"чёй то нет","292":"1. Он почти как 3, но не создаёт иллюзию уникальности ключей","293":"https:\/\/en.wikipedia.org\/wiki\/Asynchronous_circuit","294":"Я изначально из-за другого вопроса пришел как бы","295":"на расте написал","296":"ну поэтому использование монорепы в гугле может быть оправдано, а в $companyname это боль будет эпических размеров","297":"та ну уже хер с ним с нуклео, эта платка даже лучше, меньше места на бредборде занимает )","298":"для меня итак оба варианта выглядят как-то трешово","299":"ну ни один OoO тебе тайминги строгие не даст","300":"И она есть","301":"Так-то я давно уже жду появления async для embedded","302":"вот сфотал, на защелке видна волна от перехлеста проводников, каждый в свое ложе садится","303":"Там вроде как есть ADC, но либо нерабочий, либо мы не умеем им пользоваться.","304":"а не подскажите чатики по эмбеддед тематике в целом?","305":"Dual-Ethernet для китайской платы под Colorlight i5","306":"ну то есть ты понял где у тебя логическая ошибка в выводах?","307":"прибил скрипт, стало спокойней на душе","308":"давайте жить дружно","309":"нет. в этом чяте успешно выполняют раст на голом железе.","310":"там ничего сложного","311":"Вопрос в том что хал генерит их неверно","312":"привык к си стабильности","313":"Ок, он там MPU называется, но не суть. Главное, что есть те фичи, что нужны для Tock","314":"Так это другой вроде","315":"А кто их поддерживает?","316":"отдельно io-hal","317":"я про чипы, а не про свд","318":"чтобы сманить их на светлую сторону))","319":"я за железками ходил на заброшенный элеватор, воровал если по простому )))","320":"оно пока сырое, и вангую поменяется еще","321":"я так понимаю, ты должен на частоте 800 кГц передать 4 бита","322":"что такое типовый даташит?","323":"Но много траблов, особенно с контекстами","324":"Ага, до нуля)","325":"нельзя так","326":"rtic это unsafe завёрнутый в unsafe поверх unsafe pal","327":"не делать код открытым","328":"там есть неоднозначность решения ;)","329":"не, много мусора будет","330":"она не расчитана под частичное использование","331":"Полностью согласен. К этому и иду","332":"а, дополню еще, что на stm32 и планируется взаимодействие с UART, SPI, ETH по RMII|MII","333":"та начну с простого, проект сложный, на долго хватит","334":"для сравнения нативщина","335":"скорее чтобы прям cargo собирать максимально без головоёбства с тулчейнами","336":"```\/* cortex core ids *\/\n#define STM32VL_CORE_ID 0x1ba01477\n#define CORE_M3_R1 0x1BA00477\n\n#define STM32L_CORE_ID 0x2ba01477\n#define STM32F3_CORE_ID 0x2ba01477\n#define STM32F4_CORE_ID 0x2ba01477\n#define CORE_M4_R0 0x2BA01477\n\n#define CORE_M3_R2 0x4BA00477\n#define STM32F0_CORE_ID 0xbb11477```","337":"Значит что-то с большим градусом серьёзности?\nPlanetes, Rainbow (упомянутый), One Outs, Hyouge Mono например","338":"безблагодатное гадание","339":"Stm32 st-link utility","340":"а его выдает тот у кого роль роутер","341":"какие-то глюки телеги","342":"[SERV (RISC-V) обновился до версии 1.1 - на 20% меньше + добавлена поддерка 16 FPGA плат](https:\/\/github.com\/olofk\/serv\/releases\/tag\/1.1.0)","343":"потоков нет, но есть прерывания","344":"https:\/\/github.com\/rust-embedded\/wg\/issues\/256","345":"потому что это не безопасность","346":"Ну мне написали что","347":"а что мир чёрнобелый и есть две градации софта?","348":"Ну а я что сказал?","349":"на вход им планировку и полную топологию","350":"пхх","351":"Его сделали потому что народ очень просил, так-то исходно они вообще не собирались добавлять поддержку gdb","352":"Тут другие не заходят, бань его","353":"Надо наверное сравнить секции, которые есть в 2 случаях и во всем разобраться.","354":"Ну да, плюс китайский программатор, тоже не много.","355":"Вроде нет, может не ту пдф смотрю","356":"Настраиваю кожаный pick&place  :))","357":"Дальше пока не копал, там надо переделать архитектуру","358":"или perl","359":"Что же с ним сделали? За что 😢","360":"просто jlcpcb из каждого утюга смастерённого ютубным блоггером лезут","361":"@no111u3 проверь багу на другой платформе.","362":"в remotes\/origin\/patch-1 у меня оно было","363":"Пока за это сам нордик или ст не возьмутся, стека на расте не будет тупо потому что нет экономического смысла","364":"Что за курс?","365":"","366":"ну там core появилось не сразу, там даже в крейтах видно что товарищ сначала накакидывал драфты а потом завёл в мейн","367":"@WaffleLapkin https:\/\/github.com\/jonlamb-gh\/stm32-eth смотри от сюда","368":"Когда а этом нет смысла и надо таки подумать","369":"Как и под стм32","370":"Ой, прошу прощения, что-то тыркнул не туда","371":"Смотрю я на hal ы для stm32 и как то они очень разнородно выглядят","372":"это понятно, ты маньяк, но зачем забирать?","373":"а это от хала зависит, там небольшой трюк почему это работает, но на современных халах может и не выйти","374":"И да я даже знаю почему","375":"сам проект https:\/\/github.com\/jamwaffles\/ssd1306\/ у меня тоже не компилится, ни в master, ни в релизной ветке","376":"хех","377":"но если нужна динамика?","378":"до питера","379":"А в какие выходные примерно?","380":"а когда проверка пришла цех внезапно сгорел","381":"бл нет не надо только не это","382":"Меня заинтересовало не lr(k), а описание синтаксиса","383":"который в 4 известных мне мк сделан абсолютно по разному","384":"так если есть аллок - то можно коллекции из кора использовать","385":"не напоминай, у нас из-за этого на всех проектах где я был репа занимала рабочая не меньше 30 ГБ","386":"в разных режимах работы разный sp","387":"вообще не вопрос - могу сделать так как инуитивней в проганье","388":"Так, а где у вас VBUS подаётся на МК? Я только выход вижу на PA9","389":"https:\/\/www.tomshardware.com\/news\/rockchip-rk3588","390":"Добрые люди, можете пожалуйста подсказать, что за флаги такие:\n``` \"-C\", \"link-arg=-Tlink.x\",\n \"-C\", \"link-arg=--nmagic\",```\nВ гугле объяснение найти сложно.","391":"ага, еще и список ключей придется выделить при смене страницы","392":"Можешь даже вписаться в акцию невиданной щедрости на riscv.org, но там непонятно что тебе пришлют, и пришлют ли","393":"Например palkadot","394":"понятно что риск, но хочется ж, наверное библиотеку совместимую, чтоб управлять этой железкой","395":"Я им не пользуюсь, но мб ctrl+D?","396":"а как ты собрался разные биты в разных камнях маркировать или разные типы конфига","397":"Ну за тебя их таймер считает, на частоте ядра","398":"ну они иногда не показывают выводы по разным \"причинам\"","399":"камень точно рабочий.","400":"RISC-V или MIPS","401":"удалите строку","402":"@savant_d https:\/\/github.com\/jonlamb-gh","403":"Может, что-то полезное бы ещё сделал, а так будет думать, что тут одни неадекваты сидят","404":"там на все остальное доков нету лел","405":"я купил себе быстрых мосфетов, попробую попозже как оно","406":"только хотел кинуть, эт собственно стартовая страничка","407":"Охх время было.","408":"я бы не хотел вообще трогать сборку стороннего кода","409":"и тебе надо уравновешивать систему","410":"потому что ты описал ситуацию в которую сам не попадал","411":"0.11.0 Released! 🎉\nPosted June 23, 2021\n\nhttps:\/\/probe.rs\/blog\/release-0-11-0\/","412":"у тебя rtic 1.0.0?","413":"Хотя даже не обязательно напаивать на футпринт, эти же сигналы есть на контактах по бокам","414":"я могу кстати спросить знакомого как у него по нагреву","415":"удивился что оно устарело, хоть я и выбирал новое вроде )","416":"Круто, спасибо)","417":"Так а в чем разница? Скопируйте файл полученный и просто mod elka;","418":"Магия! Ещё раз огромное спасибо!","419":"зачем усложнять","420":"и да благодаря trustzone у тебя на каждом application вертятся до 3 ос сразу","421":"А после забыть про лимиты по току на порт, что-нибудь сжечь, и долго не понимать, почему оно не работает...","422":"Просто Борис не умеет писать код, когда он не отформатирован rustfmt","423":"если есть предложения как исправить \"недостатки\" которые ты нашёл","424":"@dotcypress rust кстати неплохо художественно под рыбу рисуется","425":"ахахах","426":"А ревизия?","427":"С ноута надоело кодить, а так ещё и кринжово будет","428":"если ты ее выделяешь вручную, зачем тебе объявлять ей выравнивание?","429":"Ну мне не нравится то что там билд скрипт по гцц бинутилз, а так я знаю что с асмом в стойле пока вот не айс","430":"ну там они вообще отдельный продукт, идущий отдельным прайсом, плагины же все включены уже","431":"Ну вон в скалке рисковеды обосновались","432":"Даже в дорогом агиленте земля общая","433":"Продвигаю embedded rust как могу: на работе нужен девайс, чтобы считывал данные с линз броадкаст камер(зум\/фокус). Запилил шапку для малины и пилю аппу на расте. Не совсем embedded, но артефактом будет драйвер для AD7732, потом выложу его в опенсорс 🦀","434":"С радостью продолжил бы использовать nrf52 если бы они не стоили так дорого. В общем то и esp32 подорожали, но не так сильно.\nМожно было классно сделать на nrf52840, но добыть сложнее и дороже 🤷","435":"нет(","436":"@dotcypress [korpse](tg:\/\/user?id=636787316) вы объясните therealprof'у что зависеть от крейтов которые лежат в чьей-то частной репе, даже если этот чел контрибьютор это плохо","437":"а не страшно, я сам не специалист в этом","438":"Раст там будет, куда ж без него!","439":"Не буду говорить проект, но с i2cslave параметром код не приняли","440":"Тебе в @CompilerDev","441":"Тогда вот тебе задачка на засыпку: есть stm32f103 и есть gd32vf103, у которых по сути одна и та же SPI периферия. Но все названия регистров и полей регистров отличаются. Как это решать?","442":"Особенно весело у контроллеров, которые в сон уходят","443":"Вэлкам","444":"а они умеют в гибридные или гибкие?","445":"Для US+ и пак есть. Тут все лучше. А на 7000 для начала хотя бы на PS блинк растом погонять. PL подождет.","446":"Ага","447":"ну это уже кровавый интерпрайз :)","448":"там нет даже String","449":"также","450":"ну я поэтому и говорю что у тебя один из размеров кратен 8ми","451":"по описанию звучит как LLRP =)","452":"Короче то что ты видишь это селектор, он общий на все 4 режима","453":"как старые материнки","454":"отлично, надо просто сделать также как асинковцы - просто больше коммуницировать и выработать общую стратегию для развития","455":"И насколько tock живой","456":"😊 Рад познакомиться.","457":"оо, старый баг","458":"интересно, но *const T ведет себя примерно как и *mut T","459":"В USB","460":"или в жаве","461":"ну в общих чертах я могу рассказать тут, в более подробных есть планы на статью","462":"Ещё синхронизации надо","463":"Понятно, та же херня как пинами через шаблонные параметры на плюсах манипулировать. Надо к этому привыкать, потому что как я вижу для раста - \"это нормально\" (с)","464":"т.е. чтобы узнать, что надо читать RM, нужно сотню евро предоставить? Даже кашпировский таких разводов не устраивал","465":"Хочу свой развести","466":"Кого ты прибивать без мму собрался то в мк","467":"Я смотрел, к сожалению они подорожали на lcsc, видел код для имитации ftdi под него, (под ch554 тоже есть)","468":"мде, т.е. прикол вечного ночника","469":"а кинь пару ссылочек, @k00rpse ?","470":"По 4 микроконтроллера на каждой)","471":"та я просто хочу попробовать в последней страничке хранить","472":"О, я нашёл","473":"Ну так и у меня он будет работать","474":"там надо форк собирать с сапортом risc-v, а у меня и так с патчами собрано для stm32g0  :(","475":"Так тут типы не сошлись, сами ретёрны можно.\n`return ()`\nили\n`return;`\n\nРаботает","476":"this","477":"чисто как казино )","478":"ну озу у меня в 401 было всего 96 кБ","479":"this","480":"в м0 же нет деления?","481":"","482":"Но не каждый, вроде не тау давно появилось","483":"а вторая в космосе","484":"та с малиной оно точно заработает. \nочень грустно что они пожалели еще один сигнал на reset :(","485":"А liballoc?","486":"Раст в оборонке не будет из-за гемора со сборкой без интернета)","487":"Known Issues\n    PR40547 Clang gets miscompiled by GCC 9.\n\n😉","488":"на расте? )","489":"А что у NXP?","490":"тогда да ))","491":"++","492":"а то придется за крейтами бегать домой","493":"Кабели по ссылке уже содержат FT232H, у тебя тогда два чипа будет. Зачем?","494":"Током обратки который больше чем ты себе можешь представить","495":"тиай никогда","496":"rust-alloc-no-stdlib -- это ведь оно?","497":"ну или я тупой","498":"именно","499":"а зачем придумывать что-то когда можно взять готовое","500":"@dotcypress а ты на хале сидишь или на чём?","501":"и достаточно и 2 - 3 к","502":"У нас 723 вообще","503":"Без пляски не обошлось","504":"Возьми чип покрупнее тогда, какую-нибудь мегу128","505":"а ты его включил?","506":"Ручками линии рисовали","507":"ога, я слежу за этими ребятами, это теже кто и nintendo game&watch ломанули","508":"А что ггг, товарищ морозит мой коммит уже вторую неделю","509":"если человек хочет изучать новое он будет","510":"кто писал аллокаторы для raw metal? так чтоб не пул, не выделенные страницы, и совместимые с std::? :)","511":"почти как зион в топе","512":"Можно, например, заранее вычитывать регистры после каждого степа","513":"Да просто подзабыли о нем. Раньше SVD под него не было. А после никто не интересовался. Попробуй добавить. Должно быть не сложно","514":"таки llvm_asm надо выкидывать?","515":"а я еще FTDI-rust пилю... кое-что получается, но не быстро. :)","516":"ну это я оптимистичный прогноз озвучивал если что)","517":"мне в подлежащем коде как-то похеру уже что там за конкретный тип у gpio, мне важно только что он input или output","518":"Сорян, перепутал чип, у меня\nmediatek mt2523g","519":"Хмм","520":"","521":"А inline asm не устроит?","522":"для строк, но можно без него, сложно, но можно","523":"О, класс. Очень подробно и как красиво! Тоже хочу давно уже сделать двухканальный диммер на расте (буду рулить CCT-светодиодной лентой, из устройств ввода – энкодер с кнопкой), но пока даже не выбрал, из чего буду это делать. Если что-то посоветуете, буду благодарен!","524":"ну не )))","525":"ну предлагать всегда стоит, если есть лучше вариант","526":"Но то, что там находилось не умеет в микроамперы","527":"а что за привычная? где посмотреть?","528":"это странновато","529":"Ты и без неона запустишься","530":"но с кучей пинков","531":"Стмки","532":"Хз, верилог вроде не самый вырвиглазный получается. Но проект синтезируется раз в 5 медленнее","533":"Это ж вроде часть Arc, а Arc там нет","534":"потому что не искал","535":"Покажи?","536":"спасибо большое!","537":"ну кстати у @emmanuelGoldstein  этот хак в коде есть, но ему не помогло почему-то","538":"типа","539":"их бы тогда нафиг послали","540":"Хочу наверное вкатиться в базовое железо не проебав 5 лет в тупом вузе","541":"если 1Edge - это \"по переднему фронту\" - тогда cpha тоже ноль","542":"а не motion engine","543":"регруппировать проект в нормальный","544":"да нифига не защита, там в каждом модуле как дёргали биты так и дёргают","545":"зип архивами?","546":"Не можешь победить, возглавь!","547":"Так а я что делаю","548":"И хорошо же","549":"там хотя бы мышь от нордика была?))","550":"Ого, полезно. Поставлю звезду","551":"Ну, мы говорим о принятии PR, а он уже принят будет на тот момент","552":"Но суть примерно та же в итоге","553":"Что бы велосипед не изобретать","554":"там вон все слова для поиска выписаны в одну строку )","555":"И не поспоришь )","556":"c малиной не работает, там чот нету свд походу )","557":"Я не понимаю, почему ты так недооцениваешь важность того, что ты сделал","558":"может сразу урл на гитхаб?\nhttps:\/\/github.com\/no111u3\/avra-rs\nи там плюсовать?","559":"во вторых как я писал выше там есть два альтернативных режима","560":"Чье? https:\/\/habr.com\/ru\/post\/594885\/","561":"https:\/\/github.com\/probe-rs\/cargo-embed\/blob\/master\/src\/config\/default.toml#L7\n\nЯ же правильно понимаю, что сюда можно вписать серийник микроконтроллера, с которым я работаю?","562":"Ну это уже холивар","563":"ну я подобное делал у себя - но надо парсер переписать немного, кстати в новой редакции он сможет генерировать код для любого ассемблера","564":"таким образом и фронтенд и синтезатор и PNR говорили бы на одном языке","565":"Solid - это рекомендации к организации, но как и везде есть исключения для применения","566":"типа размеры должны быть в одном месте","567":"об этом узнал когда начал сименс мс43 ковырять","568":"при том список сам по себе не имеет объекта","569":"ну значит бас фактор 1 )","570":"Не согласимся","571":"С чего бы?","572":"без этого оно грузится не будет","573":"не совсем, ты не делаешь враппера как такового, ты просто приводишь их к общему знаменателю, ровно так как сейчас делает эмбеддед хал, просто у тебя будет ряд особенностей если реализация отлична сильно.","574":"я очень давно пробовал. как уде сказали нужна старая карта и клок надо вверх тянуть при запуске карты вроде как","575":"Я могу архив прислать если тут можно","576":"Всяко лучше, чем 0.0.1.alpha0-huyalpha","577":"не, там не перепутаны а прям вообще непрпавильные. Ставишь чистые красный, зеленый, синий - выдаёет желто-голубоватый микс","578":"https:\/\/github.com\/allwincnc\/cli\/tree\/master\/h3","579":"А в солитёр из Shenzhen I\/O играл кто?","580":"https:\/\/github.com\/lu-zero\/cargo-c","581":"или pll ваще не слушается?","582":"поправил","583":"о, я даже и не знал, прикольно","584":"Но да","585":"юзерспейс по хорошему должен был начаться в районе шела и фс )","586":"не, я про синус\/ступеньку","587":"фишка в том что генерить раст либо через proc-macro, либо очень больно. А значит и генератор писать прийдется на расте","588":"детская плисина )","589":"","590":"Ну так идея в том что твой джит верифицирует кодец и только потом из него генерит машкод.","591":"Если ты внимательно просмотрел бы все комментарии а не только те что Любы тебе ты бы увидел даже то как это называется","592":"Всё что есть я замучаюсь кидать)))","593":"Выхлоп генератора не предназначен для чтения человеком, для этого есть документация","594":"там в thumb был прикол что не все операции и не все регистры влезали в команды","595":"ты вообще понимаешь что такое конфигурация?","596":"не вру","597":"Она ж на хосте отрабатывать должна, какая ей разница стд или нет. Она по ir ходит же. Жапарик опять сочинил фигню)","598":"кстати да, треккерная музыка это прям вот тот вариант - учитывая спектр динамика","599":"без стд","600":"ну вообще я читал, мужики хекс так разбивали и загружали","601":"ох, жирненько","602":"к сожалению, orange-cnc в github умер","603":"В мейнлайне","604":"работает с байтовыми слайсами, про цвета ничо не знает )","605":"Пиздато их можно автоматически подбирать аж тремя путями","606":"либо всё будет работать на какой-то определённой частоте","607":"Без hf очень много fp делается в эмуляции, поэтому очень медленно.","608":"@dotcypress у меня дефолтвый апп для дискавери л152 влезал в 1.5к","609":"вот когда нодик как гткашники под своё крыло заберёт либу тогда будет хоть какая-то надежда на работу (но никто не говорит про стабильность)","610":"Для общего случая нужен счётчик топлива","611":"т.е. он либо лишний либо неправильный","612":"Для произвольного ассемблера это не прокатит, конечно","613":"Так он в обе стороны будет","614":"Ну может всё-таки можно как-то не создаваю новый тулчейн передать в build имя компиялтора?","615":"Расскажите что это","616":"Почему этот фогет не ансейфный?","617":"я перечитал про wouldblock, нормальная же тема","618":"да просто у ф7 по озу и флешке слишком всё разное и у меня падает билд экзампла и я хочу это сделать гуманно","619":"esp32 не только на risc-v, но и на xtensa. и они все работают под растом.","620":"Ну формально крейт есть для этого","621":"вот у товарищей с бостона метод А*+ (я не помню как его точно называют)","622":"Обмотка движка згорела , движок был на 1.5 квт","623":"Не удержался)","624":"Зависит от космоса. Кубсаты скорее всего на низкой орбите летают и там почти пофиг. А на геостационарной нужны уже более серьёзные технологии. На последнем C3 доклад про это был неплохой.","625":"А чем она плохая?","626":"прошивка арм - это глагол","627":"а вообще для внешнего ацп неаудиочастот надо уже плис","628":"насчёт доков - я пока не находил понятных по тому как использовать этот hal","629":"С чего они переедут то","630":"триангуляция обычная )","631":"в нём тоже можно в ногу стрелять","632":"BSP скорее  всего  нету, но если там опять же линукс - то пофиг","633":"И оптика, короче силовая техника это про взрывы","634":"И в писать чистейший регистровый код","635":"Ну так тем более","636":"С точки зрения раста больше всего влияет то, чип какого семейства там используется","637":"Это скорее всего потому что реальная частота получается выше расчётной и flash wait cycles выставляются не те","638":"А у тебя их целых два, надо только разъёмы приделать","639":"У нас платят, но надо кроме раста еще немного голову иметь.","640":"как там твой асинк кстати поживает?","641":"В чём выражается это \"не позволяет\"?","642":"это скорее твоя раз ты поддался на провокации","643":"Если нужно чисто растовое решение, то смотри на Rubble","644":"Ты про тот, что на SysTick работает?","645":"то есть по-твоему мы тебе каждую  проблему будем расписывать с нуля пока ты сидишь нихуя не  делаешь и при  этом даже обобщать  полученные знания отказываешься?","646":"Привет, кто нибудь возился с контроллером tms320F28335? Перерыл весь инет в поисках рабочего уарта через прерывания - по даташиту не смог завести, примеры с сайта техаса тоже че то не работают. Уже  не знаю..то ли лыжи не едут толи я такой тупой. Каждый регистр по битикам прописал согласн даташиту - а прерываение не срабатывает :(","647":"Шифровались) мы вас раскрыли!","648":"Там такое \"дерьмо\" иногда пишут деды эмбедеда или аутсорсеры","649":"делаешь копию таблицы и один короткий цикл, ты ваще о чем?","650":"Ну и пусть висит, партию девайсов собрали уже","651":"правда я не знаю с какой частотой его значение инкрементировано","652":"[На субботнем стриме поговорим про SpinalHDL](https:\/\/youtu.be\/VKRwAa1tlH8)","653":"Сразу нашлись две группы по 6 пинов рядом","654":"И то верно","655":"потому что авр это гарвард и там в детском примере выхлоп у компилятора такой что потом линкеру башню сносит","656":"ну он выбрал то правильно по пику, а вот посчитал пики он прям очень криво","657":"я чот думал оно давно на стейбле. но признаюсь на запускал, нет столько оперативы на чипах )","658":"https:\/\/crates.io\/crates\/esp32-hal","659":"А что не так?","660":"Есть надежда что они разродятся процессором","661":"тикет про naked прочитал но для своего случая не нашел ответа","662":"Я знаю GCC","663":"Ну, мне нужна предсказуемость, а если я их раскидаю как попало, то есть шансы, что метастабильности у меня не будет никогда","664":"они сразу 2 ядра представляли","665":"ты линию линию без буффера хер нарисуешь )\nну или нарисуешь по одному пикселю, что по i2c будет вечность","666":"Ставишь бит и первые два регистра превращаются в регистры baud rate","667":"Тут лучше осциллограф взять и посмотреть, лог.анализатор может этого и не показать","668":"ну поэтому лежит на полке, потому что я всё ещё в раздумиях как это сделать","669":"quickcheck?","670":"в конце концов могут в основной ветке раста включить этот бек когда он из EXPERIMENTAL выберется","671":"что бы с bga не возиться","672":"avrdude не подходит как инструмент? Или openocd?","673":"Ну вот мне надо запустить ддр, и считать с флэшки основную программу, а в ней уже и по взрослому можно учиться","674":"ай да к нам на проект","675":"Они как будто выпустили секретный чип и молчат о его существовании","676":"пирацкий поставлю","677":"Да там трэш какой-то","678":"чето диоды такое дно. я о них лучшего мнения был\n(это мне опять нескем поделиться)","679":"это ты просто не пробовал собрать что-то под линуху ну и саму линуху, там бы ты понял что в целом лучше бареметала нет и не предвидится","680":"Это я видел. Хотелось бы какие нибудь нормальные обоснования этому а не просто либу на плюсах","681":"было такое","682":"flash!","683":"можно начинать и тут, отдельного не видел","684":"Просто кто-то на неё случайно наткнулся","685":"Попробуй из другого каталога","686":"Закину пока спойлеров для @dotcypress","687":"E2k не будет в расте никогда больше","688":"а чо так жирно, там надо MMU настраивать?","689":"Оно вроде не перекрыто фичей, так что в след. стейбле должно быть?","690":"Си","691":"а я вот смотрю дш и вижу их","692":"Экспериментально подтверждается","693":"ну оно вроде как ссылается на стд","694":"@WaffleLapkin пробуй писать сразу в регистры - в этом нет ничего страшного, просто рефман тебе что так, что этак читать","695":"ну я делал для spi драйвер когда с плис игрался","696":"а как думаете, для простого ассемблера сложно будет сделать парсер на нем?","697":"ну с вероятностью в 50% оно даже заработает с первой попытки, но не факт что идеально","698":"Я его даже за вечер поднял на плис","699":"Может ему ещё и код за тебя написать?","700":"простите за оффтопик, но вы тут все знаете. ) почему STM32F103C6T6A на али стоит $1.5-2, а следующие F103 - уже под десять баксов сразу. в чем подвох?","701":"Что-то не вижу тут кланга","702":"и с rtfm ваще сказка )","703":"https:\/\/github.com\/no111u3\/tmc5160\/blob\/master\/.cargo\/config - что-то вроде такого","704":"там были сложности с чтением рингбуффера (видимо внутри openocd где-то)\nя делал rtt stop \/ rtt start и в jlink monitor прилетал кусок буфера резко","705":"Я бы начал с консольного генератора","706":"Что бы можно было взять f1 или h7 или g4 и одним и тем же способом включить и использовать пины или spi или i2c или serial","707":"у производителя )","708":"Я тебе так скажу, hs-probe умеет скорость JTAGа, которую уже не умеет ECP5)","709":"japaric самоустранился еще раньше","710":"yes","711":"А PAGE_SIZE тут что означает?","712":"Не видел такого, и не могу пока придумать на что это может влиять. На сам кватернион вряд ли, только на динамику его изменений при движениях устройства","713":"ну на 40х оно хотя бы поднимает контрол поинт?","714":"После твоего PR как будто бы ещё хуже станет :(","715":"а gdb-multiarch на маке есть?","716":"> suspicious unregulated finances","717":"https:\/\/www.youtube.com\/watch?v=VCK9l9gmyDk","718":"есть лучше!\n\nтут сразу все радости плис и пять ядер RISC-V 🙂🍻","719":"ну есть мощности которые дешевле загружать всегда чем держать в простое - тут скоро будет как и с производство печатных плат","720":"мне руки чешутся, но не до того вот совсем :(","721":"пришлось только поковыряться с зависимостями потому что многие крейты не запинены в примерах и может не собраться","722":"Мне кажется тут не язык роляет а бекграунд в целом, сейчас куда не плюнь кубы, а где кубы там и гоники","723":"This site can’t be reached\nmusic.yandex.ru refused to connect.\n\nмкей, спасибо конечно","724":"импортозамещение делает брррррр 😂","725":"Да стоит","726":"или раст в weak не научился ещё?","727":"👍","728":"Документация к аппаратному обеспечению, что идет в проект в обычных случаях кладется в папочку docs, рядом с папкой src. Иначе Вы не сможете в своем коде ссылаться на документацию - страницы\/главы\/и.т.д. поплывут.","729":"В общем можешь посмотреть мой код а заодно подумать в чём разница","730":"смысла нет. еще немного кода и флэш все равно закончится","731":"а не понятно, вроде как не первый","732":"я уже писал","733":"https:\/\/github.com\/paoloteti\/ti-hercules-bsp\/blob\/master\/src\/startup.rs#L158\n\nВышел из main - умер, лол 🤣","734":"вызванной природой","735":"DIP-40 узкий дофига, вроде. Там даже не каждый корпус влезет, даже если под углом 45 градусов","736":"и это я молчу про битстримы","737":"но если что там все равно случайные значения\nесли есть какие-то особые кейсы для нужной хэш-функции, то не лишним их будет отдельно прописать","738":"а то как то в него что то прилетает (я вижу эвенты) но ответов нет","739":"Да он то все правильно сделал, тут в пределах семейства стартовый эндиан пляшет","740":"есть но они нафиг никому не нужны","741":"и даже 450","742":"но raw <= arr","743":"@no111u3 Борис привет! может у тебя есть эл. книга \"Artificial-Intelligence-Based Electrical Machines and Drives: Application of Fuzzy, Neural, Fuzzy-neural, and Genetic-Algorithm-based Techniques\" Peter Vas ?","744":"В данном случае это не критично, ибо обновление так или иначе дойдёт. А учитывая монотонность значения, с точки зрения основного цикла всё будет выглядеть как надо","745":"на скок я понимаю этот memory файл нужен только для дебаггера, так ведь?\nпрошиваю я через `probe-run`","746":"а теперь что-то не уверен","747":"в нем и разводил","748":"более крепкие, не рвутся","749":"давай по честному — его нет!","750":"либо не жадничать и поставить привод с ОС","751":"В теории кста, можно свой умный дом запрограммировать? Только на расте","752":"https:\/\/t.me\/embedded_rs\/29909","753":"А не, два:\nThe MSRV shall always be strictly smaller than the latest available minor stable release. For example, if the latest stable Rust version was 1.32.1 a new minor release of the cortex-m crate can't bump the MSRV higher than 1.31.","754":"В МК программатора встроен USB-serial, который позволяет легко общаться с целевым МК. Если оторвать программатор, то нужен будет кабель USB-serial","755":"хотя на алибабе есть","756":"🥞 почему все примеры для tock-registers на базе uart, другой периферии не бывает что ли?..","757":"то есть последний синк у них с мастером был в январе сего года","758":"ааа, там нету `.cargo\/config`","759":"Ну да, а тут мы хотим блок за 5к качеством но из ширпотреба)","760":"а ты уже забыл о чём мы с тобой буквально пару предложений назад   общались?","761":"на 8 мегагерцах более менее плавно работает","762":"Не обошлось и без секретного бита от ST, без которого PHY не запускается. Не знаю, как я его не заметил в прошлый раз","763":"так и сейчас так","764":"Тогда там другой каскад на конкретно этих пинах и их альтернативах. Подобно тому как mipi","765":"```if x < y {\n        y - x\n    } else {\n        x - y\n    }```","766":"кстати два дня отлаживал глючащий энкодер пока не понял что я подаю 3В вместо 5В","767":"всё вопросы к товарищам из f4, я сделал максимально совместимо","768":"Я уже кидал сюда фото","769":"Ну я кстати таблички заполняю и включаю без асма как раз","770":"А чисто архитектурно хз, ничего революционного там нет, как будто бы","771":"Наказание всегда можно получить","772":"А в том что это не хал)","773":"Ты же компилятор раста не тащишь в мк?","774":"Совет накостылять был выше","775":"Зато они мне поведали, что флексы они режут лазером, а не фрезой. То-то удивительно точно у них это получилось.","776":"по спи ты можешь отправить кусками по 8 бит(байт)","777":"А где там маска?","778":"та я если честно до конца не понимаю сложности, как обычно вслепую иду","779":"верно, но для обучения же супер, тот же spi написать дергая пин очень полезно, я вот попробую","780":"не хочу быть полезным насильно","781":"Да, не секундах с точки Х","782":"Хм, надо будет попробовать","783":"ну это есть такое","784":"о, круто!","785":"да","786":"Там тоже платка забавная","787":"гляну, прям интересно","788":"Да полезно иногда почитать, книжки в особенности","789":"тем что ты потратил на это время","790":"Не знаю, честно говоря.","791":"Хочется прям ща фигней помаяться","792":"а ты релиз я не помню с лто или без него?","793":"Кикфлипы измерять","794":"Занять имя проектом, в котором ничего нет -- это и есть сквот","795":"Его мозилла использует в серво, получается примерно такое\nhttps:\/\/searchfox.org\/mozilla-central\/source\/gfx\/webrender_bindings\/webrender_ffi_generated.h","796":"это из инструкций брал","797":"Такое бывает, если флаги разные в .cargo\/config прописаны. Если прописать одинаковые, то перкомпиляции не должно быть","798":"Я знаю, но вряд ли это оно","799":"`use std::time::Duration;\n\nuse libusb;\nuse libusb::Device;\n\nuse libusb_sys::LIBUSB_ENDPOINT_IN;\n\nfn main() -> () {\n    let context = libusb::Context::new().unwrap();\n\n    let mut uniden: Option<Device> = None;\n\n    for device in context.devices().unwrap().iter() {\n        let device_desc = device.device_descriptor().unwrap();\n\n        \/* \n        println!(\"Bus {:03} Device {:03} ID {:04x}:{:04x}\",\n                 device.bus_number(),\n                 device.address(),\n                 device_desc.vendor_id(),\n                 device_desc.product_id());\n        *\/\n\n        if format!(\"{:04x}\", device_desc.product_id()) == \"2303\" {\n            uniden = Some(device);\n            \n            println!(\"Vendor id {}\", device_desc.vendor_id());\n        }\n    }\n\n    let clean_uniden = uniden.unwrap();\n\n    match clean_uniden.open() {\n        Ok(handle) => {\n            let time_out = Duration::from_secs(1);\n\n            let buf: &[u8] = \"VER\\r\\n\".as_bytes();\n\n            let res = handle.write_interrupt(LIBUSB_ENDPOINT_IN , buf, time_out);\n            \/\/let res = handle.write_bulk(LIBUSB_ENDPOINT_IN, buf, time_out);\n\n            print!(\"Result {:?}\", res);\n        },\n\n        Err(err) => println!(\"Some error {:?}\", err)\n    };\n}`","800":"а из этой диаграммы вообще не понятно ничего","801":"Но и вряд ли это нужно","802":"на всякий случай, min const generics уже стабилизировали","803":"Но на no_std это боль, потому что для селекта надо, чтобы футуры были Unpin и FusedFuture","804":"что за сет?","805":"коротче мне ии гениальную штуку подогнал. Теперь мне больше не нужно толкать копии мьютекс(арк(опшн(Сериал))) - он мне в статичеескую переменную заинитил сериал, и написал макрос для вызова из любого места в коде","806":"Раньше она была самостоятельной.","807":"Это вон в офтопике сражайтесь, мы тут за инженерную практичность","808":"А собсна, что произойдет ?","809":"а ты кстати его пробовал, а то Виталий вон ругался что нифига не быстро","810":"Потом разобрался. Заработало","811":"К доске, пожалуйста, Беркус!","812":"[korpse](tg:\/\/user?id=636787316) а ты уже запускал свой код на новом rustc для stable?","813":"но что ты ответил - мне так лучше","814":"Видео давай!","815":"Ага","816":"блет","817":"парни, а ведь #[inline(always)] с 0 оптимизацией ниразу не инлайн?","818":"я с ним и пробовал собственно :(","819":"скажем если каждый вызов это примитивное взаимождействие с регистрами, то понятно","820":"ааа","821":"полусумматоры","822":"ну и в STM и в nRF SDK там именно два указателя на вход и на выход","823":"в первом он будет реалтаймово реагировать, а во втором при первом же удобном случае спать","824":"Малинка кажется проще. Хотя бы потому, что в этом сообщении из незнакомых слов есть только одно: \"SIP\" :)","825":"искать на барахолках десятикилограммовые авиагоризонты от самолетов )","826":"HAI GUISE","827":"интеграцию модема и звука с него это будет отдельный квест (и да в малинке нет аудиочипов, чтобы тебе было совсем весело)","828":"Всем привет ) Хочу подключить к своей расбери 4 юарт и считывать с него. \nНагуглил вот ткую библиотеку https:\/\/docs.rs\/ruspiro-uart\/0.3.1\/ruspiro_uart\/ \nНо при компеляции падаю с ошибкой \n\nerror[E0554]: `#![feature]` may not be used on the stable release channel\n\n#![feature(llvm_asm)]","829":"Примерно так же, как я могу запустить программу для RISC-V без RISC-V процессора","830":"","831":"Такое можно и запинить","832":"Хм","833":"Однозначно сказать в каком корпусе контроллер-то нельзя...","834":"и затем активируешь cargo build --features name1, name2","835":"how did you know?","836":"ну это 1.30","837":"В этом списке пина нет: https:\/\/github.com\/stm32-rs\/stm32g0xx-hal\/blob\/main\/src\/analog\/adc.rs#L455-L472\nМожет быть это баг и его туда надо добавить","838":"хотя я новые драйвера писал уже под него","839":"Вообще это какой-то хайли ансейф, так можно два раза клоки настроить, скопировав CFGR","840":"Внезапный вопрос: если делать pHat для малинки и на нем будет stm32. Так как буду использовать ADC, то нужно стабильное питание. Достаточно ли стабильные 3.3V у самой малинки или есть смысл брать 5 и впихнуть LDO постабильнее?","841":"Диплом делаю 👀","842":"Где есть всё и ничего пригодного для какой-то конкретной задачи","843":"и чо ты будешь с нейронкой делать","844":"от 5 вроде как яркость будет больше, но вообще мне и так уже нравится","845":"добавлять ревьюеров только мемберы могут вроде","846":"Да, это бан методом compare and swap nahui","847":"так погоди ты rtic мучаешь?","848":"да у меня тоже есть такая контора, но с логистикой беда сейчас","849":"Выше заказывали","850":"фаанг - дно","851":"у тебя ПИД, понятно.","852":"Может быть потому что они хотят воспользоваться фичами языка чтобы получить больше контроля за происходящим, чем в ардуино?","853":"Окей, есть 32 бита без возможности перезаписи флеша самостоятельно ?","854":"Просто для моделирования они не важны","855":"найди ближайший  провод 10кВ, будешь нормально дрыгать и никакой сишечки поблизости","856":"hmm, but have you working configuration for HSI?","857":"ну как видишь ему нужен для вивады блоб, а так спека давно описана на самом сайте","858":"@Bannerets а из кз в расте какие парсеры?","859":"На embedded-hal уже набегало относительно много людей с безумными идеями, суть которых мало кому понятна. Было бы логично, чтобы эти идеи были сначала реализованы и доказаны","860":"Ну судя по \"`rustc --print target-list | grep avr`\" rustc правильный по крайней мере...","861":"Нуу","862":"вообще топовый пацан. и никакого эмбеда","863":"угу а если там qspi то и код тоже)))","864":"А например сервопривод для бесколлекторного двигателя в режиме foc с возможностью удержания и отсутствием проскальзывания. Инерциальная навигация с привязкой к локальным ориентирам и без оной. Планер движения. И это только я из близкого мне по духу привёл.","865":"С сишным халом такой проблемы нет, насколько я понимаю","866":"я тут ссаный SPI уже второй день запустить пытаюсь","867":"Делегировать пользователю логику настройки ширины адреса у перифеии?","868":"ну начинайте ржать: программируемый бредбоард :)))","869":"и у меня получается микросекундная точность, потому  `DelayUs`","870":"я не так давно доки на secure boot смотрел в i.MX","871":"Там внизу, расчётные цыфры, но учитывая техпроцес, грустно","872":"ну пока держится :) 10 циклов уже продержался","873":"нет","874":"А для флешки что?","875":"сценарий понятен, непонятно, как это чисто технически может произойти =))))))","876":"Строб это как раз тема из эмбеддеда, так что всё ок","877":"https:\/\/github.com\/rust-embedded\/cross","878":"я не пробовал запускать, но думаю за вычетом батареи он тоже более менее ок","879":"я не использую хал","880":"ты опять что-то путаешь","881":"только тем кто отбросит этот морок можно трогать раст, остальные пусть стадом пиздуют к 23-му стандарту","882":"> форки","883":"а говорил что я дед :)))))","884":"Это я знаю, но разве разрабов не могут перекупать?","885":"Это да. А вот библиотеки и халы будут только сишные официальные","886":"а есть на плату","887":"в дебаге там надо несколько бит настроить чтобы можно было","888":"Привет, Ivan, прочитай правила!","889":"Dimension W тоже должен зайти.","890":"Сурово","891":"`[dependencies]\nembedded-hal = \"0.2\"\ncortex-m = \"0.6.2\"\ncortex-m-rt = \"0.6.12\"\npanic-halt = \"0.2.0\"\nstm32f4xx-hal = { version = \"0.8\", features = [\"rt\", \"stm32f411\"]}`","892":"Короче мне лень спорить","893":"Мб у кубодрайвера, вот в это я поверю","894":"и так было","895":"Ну тут надо аккуратней быть, чтобы вместо сглаживания положительную ОС не запилить","896":"Есть интеграции с SoftDevice, но на них положили болт. Другой проект это Rubble, BLE стек на расте как раз взамен SoftDevice, его пилит Jonas Schievink из Ferrous Systems","897":"А потом вот это:","898":"Почему мешает?","899":"В rtic поконтрибьють","900":"Поржал над переводом","901":"Видимо, GreatFET+Rhododendron","902":"если не используется в других проектах","903":"Смущает, что первый клок подался заранее и некоасивый, на него слейв отреагировал, а сам мастер - нет\nГрешу ещё на слейв селект, или инициализацию spi в ембейс (может то что они spi включают, потом отключают и влияет как-то)\nБуду следующие пробы делать на прерываниях - больше инфы будет.\nНо пока на низких частотах (328кгц) во всяком случае схема с параллельным spi выглядит возможной","904":"психологические отклонения","905":"Поисковая строка чтобы искать другие проекты на либе usbd-hid: https:\/\/github.com\/search?l=TOML&q=%22usbd-hid+%3D+%22&type=Code","906":"сейчас думаю из неё делать микрохоум сервер, но смотря на то что у тебя актикс долго собирается понял что лучше не стоит","907":"блинкер можно сделать, а если что посложнее - то прийдется мучаться, возможно контрибьютить в сам hal","908":"Ну и вы учитывайте, что ferrous -- это контора, в которой от силы человек десять (больше в их офисе и не поместится, пожалуй), так что тут скорее отдельные люди решают, а не нечто большое и глобальное","909":"а не важно - даже собирая детские схемы законы не меняются и остаются такими же взрослыми","910":"я завтра конечно попробую, но может кто уже игрался","911":"И все вот эти v1,2... это просто прям ужас плюсятиной пахнет","912":"Блин, это мой косяк, похоже. Думаю про байт, а инвертирую всё двойное слово же","913":"http:\/\/nercury.github.io\/rust\/embedded\/hack-the-crab\/2019\/11\/11\/rust-embedded-hack-the-crab.html\n\n\nвот это","914":"маловата, Pi сантиметров между каналами, но больше неудобно будет к плисине подключать.\n\nпро децибелы не скажу, пока не шарю )","915":"ну тут на самом деле смотря насколько сложная работа с периферией, иногда всё же более жирный камень лучше чем менее жирный","916":"ye djn jy b pf,sk dblbvj","917":"ну я так и понял)","918":"Вроде да,  на ноге несколько портов","919":"оу! красота — крабик созрел 👍\n\nтолько вчера подумал, что надо у знать как у вас там дела 😃","920":"В следующий раз tag-connect делай)","921":"это душа чата, без нее нельзя","922":"И именно по этому в расте нет хала","923":"я про ОТО и СТО","924":"Но вот есть книга","925":"скажем так большие дяди это место уже смотрят, причём даже в РФ","926":"кстати используя это свойство его можно и настраивать","927":"да, я его пользовал, правда немного попатчить пришлось, а что за _rtt_ патч, я пытался сделать свой патч и он у меня не заработал, ща попробую этот!","928":"Если ты сидишь и только с совтом работаешь это не значит что только он и есть.","929":"Дак оно везде не сложно, вопрос в желании","930":"кстати да, если swd включен - то это так себе защита ))","931":"watch разный","932":"Надо как минимум сэмплировать это с конкретной скоростью, а потом дополнительно обрабатывать. Вроде Интел рассказывал, как у них ГСЧ работает в процах","933":"Часы норм, но как часы -- не очень","934":"Ты не забывай что fp в армах оно не в ieee754 стандарте работает","935":"Rust, микроконтроллеры и кошкодевочки\nDiscussions about embedded\/no_std Rust on MCUs\/MPUs,FPGA, etc..\nполезные ссылки: https:\/\/github.com\/rust-embedded\/awesome-embedded-rust\n• @rustlang_ru -  про язык\n• не rust но @proembedded","936":"так в авр тоже, там тупо на инит часть много кушает","937":"про ECP3 не видел ещё","938":"Как будто у ST они были, лол","939":"Также как и в си , по факту","940":"ну смотри там математика очень сложная для комплекса, но по сути у тебя штука простая если ты делаешь кластером","941":"с 2 отладчиками","942":"https:\/\/github.com\/no111u3\/stm32cclib - это прям когда я между работами 3 месяца тупил и писал руками.\nhttps:\/\/github.com\/no111u3\/stm32l476_examples - а этот когда за неделю вечерами нагенерил","943":"хуесосить надо помогая, если на то пошло )","944":"ну это кусок изолированного кода, лучше чем все функции нейкедами обвешивать","945":"@someonetoignore до конца читай ту статью, там написано как такое исполнять и чем","946":"ну либо ты не собираешь промдевайсы - т.к. на лабораторном столе они обычно работают","947":"Хддд","948":"но не взлетело","949":"Это уже детали реализации.","950":"Для этого, вероятно, нужен ещё один ключ, который каким-то образом лежит не в прошивке","951":"","952":"а сколько priority bits у stm32f1?\nа то у тебя там есть приоритет 8 и я вот сомневаюсь что там больше трех бит на это все, надо проверить","953":"на микроконтроллере у тебя нет жирной std","954":"Просто вот какие-то из китайцев умеют во все плюшечки, но меньше одного листа не делают. Дорого выходит","955":"с бга думаю вышло бы прям негуманно","956":"И мне надо взвесить все даунсайды подобного решения","957":"Ладно, очень жаль, что тебя интересует только это.","958":"В хале так и не придумали ничего для обработчиков прерываний от драйверов","959":"Печаль","960":"Года два как держусь подальше от гуглов и фейбуков)) Так что я пас\/","961":"и терминал мой ненужен будет )","962":"А теперь ты в проекте прошивки добавил ещё один memory.x, какой из них будет заинклужен в link.x?","963":"не только аэрокосмос американский ещё и отечественный","964":"))","965":"Жду когда Дэйв из EEVBlog либо чувак под ником thunderf00t выпустят дебанк видео","966":"хотя я похоже рано обрадовался","967":"не факт, если архитектура несёт прирост и патентную независимость то могут и вбухать в неё","968":"в этом плане в хале всё нормально прописано","969":"96 из хала вызывает hardfault","970":"Неа, они именно что под nda, те что есть это просто кто-то слил","971":"Он хочет понижать напряжение питания на всём чипе чтобы попасть в уровни","972":"А оно и не будет работать в текущей концепции","973":"Больше там собственно нихера нет","974":"ага, в ресурсы не передаём, слушатель прерывания забирает с кишками. \nПин ловим через exti::Event::GPIO15 и смотрим куда его дёрнуло\n\nа если на одинаковых пинах разных портов ловится  событие ? как определить какй порт стригерило ?","975":"но не во всех эрратах это написано, а баг существовал всегда (начиная с ф1хх серии включительно)","976":"Правда, с асинком там тоже всё не так просто, ибо на разных платформах он работает по-разному","977":"у меня там строк 200-300 вся либа, тупо backbone","978":"Или их гитхаб","979":"Это магнииный энкодер что ли?","980":"https:\/\/github.com\/plerup\/espsoftwareserial\/","981":"тебе нужно быть увереным в его работе и всячески следить за ним","982":"Спасибо большое, попробую!","983":"Так поделись огромным опытом","984":"Лучше бы онтопа набросили.","985":"Скинулись и запилили свой опенхардварный чип","986":"оке, спс","987":"оо, полезная штука","988":"хоть его реверсь — там цинк","989":"но я убрал","990":"Алсо мой список просмотренного удобнее будет тут чекнуть (там сразу со статистикой): http:\/\/graph.anime.plus\/lain-dono","991":"ну вон даже радиопередатчики и приёмники собирали на этом, так что нормально, да, серьёзные дяди делают спец дизайн (аля как в пикосекндных таймерах стм32)","992":"учить английский, причём можно ограничится технической его частью","993":")","994":"Там можно по SPI кормить ему содержимое аудио файла со всеми заголовками, а на выходе получать звук.","995":"еще поляки могли в коробочку от чипа просто положить кирпич","996":"а нужен был CLI для работы с девайсом, и еще протокол для конфигурации, а с фортом - все в 1 флаконе )","997":"mut по ходу просит","998":"целиком на расте","999":"Где-то могут поставить пломбу щетчику после подключения к нему, а где-то нет. Такой разный СНГ"}}