{"text":{"0":"Чем удобнее?","1":"думаю что-нибудь про рекурсивное построение линкедлистов","2":"а пиши","3":"возьму на себя душную работу заметить, что `{_ => _ * 2}`  - это некорретное выражение для типа `Int => Int`, корректными будут `{_ * 2}` , `{x => x * 2}` и `2.*`","4":"это пока","5":"Так это ж про кассандру","6":"ну \"третий чел\" это наименование для опущенного подлежащего, связаного с глаголом \"забыли\" здесь\nhttps:\/\/t.me\/scala_ru\/355761\nего конкретность зависит от конкретности этой фразы","7":"да бред написан","8":"опечатался, поправил","9":"Эээ. Как качество гц влияет на объем потребляемой памяти?","10":"Интерфейсы раби интерфейсов","11":"А теорию категорий вообще знает кто нибудь полностью(вообще реально ли это?) А то я читал про розетский камень но осилить не смог, очень много абстракций","12":"идеально","13":"Да, я в курсе, что это группа про Scala, а не Akka, тем более не про AkkaNet, поэтому извините, если совсем не в тему закинул","14":"уточнить в какую сторону гуглить = хорошо, просить за тебя гуглить = плохо","15":"А кто знает, в circe deriveDecoder\/Encoder из semiauto умеет работать с Configuration из extras?\n\nЯ вот пытаюсь, и что-то никак\n\nhttps:\/\/scastie.scala-lang.org\/8X3YXBHAROmaGz0aRebj7A","16":"есть стандартный zip если я ничего не путаю для этого","17":"Да не должна","18":"для продьюсера","19":"Просто не читай б)","20":"Поподробнее","21":"g1 вообще какашка для low latency)","22":"какой конкретно бойлерплейт?","23":"Рядом )","24":"что делает?","25":"Валерий, не томите","26":"там вроде ж для raw было отдельное чет?","27":"прочитайте про double checked locking и, например, \"правильный\" синглтон в джаве\nэтот паттерн много где встречается. может тогда понятно станет","28":"Если на котлине использовал либу ArrowKt, то фп-скала, думаю, зайдёт без особых проблем","29":"В Scala.JS есть вариант сделать Фьючу, которая просто завершится спустя некоторое время?","30":"не мой проект изначально, так бы не тащил туда акку","31":"Лихо)","32":"Второй тезис можешь пожалуйста примером дополнить. Не оч понятно про что речь","33":"Я от него убежать хочу)","34":"Ведь такого синтаксиса нет","35":"http:\/\/fpchat.com\/","36":"какая разница то?)","37":"спасибо большое!","38":"есть специальный метод, чтобы не ждать https:\/\/github.com\/zio\/zio\/blob\/36fe63d2ef65fc76308ac4a465578ee858f7f7c8\/core\/shared\/src\/main\/scala\/zio\/Fiber.scala#L181","39":"пытаемся, вернее","40":"Но этого уже нет","41":"Дык речь про то, что пульнуть туда 3 запроса по очереди, не дожидаясь ответа","42":"или не про это говорилось?","43":"А как в нем с транзакциями... В асинхронном постгресе","44":"возвращать какой-то типа \n```trait Container{\n  type Result\n  def result: Result\n}```и в макросах подставлять туда \ntype Result = String или type Result = Option[String]","45":"имплементоры этих сервисов тебя не побют потом? отдельный класс враппера на каждый метод вместо GenericFailure[T](value: T, time: Instant)","46":"Вы тут сейчас насоветуете, человеку нужно просто стартонуть. Все равно с первого раза хороший REST не спроектирует","47":"То, что оно само подписывается — это просто деталь реализации.","48":"а можно где про это почитать? я хочу чтобы он из коробки подхватил spring actuator метрики в формате для прометуа или типа того","49":"sbt-jmh","50":"опять же, как мы определим, и где в правилах о среднем участнике со стороны?","51":"val dao = createDaoImpl()\ndependency injection надо вместо","52":"https:\/\/github.com\/danslapman\/asyncstreams","53":"что за фигня второй день, ребята?","54":"Т.е. надо .2 ждать","55":"type Board = Map[Piece, Position]","56":"Ну работает = работает также как и вся монга","57":"различие только в `capitalized`","58":"Как к Кассандре конектишься?","59":"Почему нужно именно параметры","60":"да, такой гипотетический генератор выплевывает спеку протобафа плюс валидаторы","61":"Не пробовал. Не факт, что в этом модуле зио будет, а тащить его только ради тестов немного перебор\nНе то чтоб очень хочется шейплесс тащить, например, но это все же чуть менее странно. Но если на магнолии не взлетит, попробую его","62":"эм, вообще-то есть, даже если их не видно","63":"ятд они функциональную композицию выкинули, и оставили только императивщину","64":"У меня в другом задании: Extend solution of task 3 with function applyFunction of type A=>R returning: \n\nЗначит это можно потом переопределить как я понял","65":"Ага тоже нашел","66":"а что ещё там делать?","67":"Бота нельзя суммонить?","68":"Я раньше тоже раскидывался очень фривольно этим термином, а потом в клайрэтовском чате набросили инфы, и я теперь могу высокомерно фильтровать","69":"Это не пример.","70":"Что то знакомое, это МПВ\/Вычмат?","71":"в чаты с джавой и питоном..)","72":"забавно, от простого повторения, ненависть снежным комом накручивается","73":"overall\nно скорее в рантайме, в обслуживании девопсами, в инфраструктурных требованиях\\","74":"Или смотрит компилируется ли","75":"+1","76":"Он в муте","77":"а дальше? думаешь как перенести то что пофиксил обратно в квил?","78":"стиль из 90-х, да","79":"несколько раз возможно","80":"Опсы, кстати, виксовские жаловались, что скалисты умудряются писать код, который вообще никто понять не может","81":"Только непонятно откуда оно понимает финальный тип:-\/","82":"когда важно быстро оббежать элементы бюыстрее вайла не будет","83":"Поэтому в принципе, если сразу писать приложение так, будто у тебя есть какой-то key-value, ну в лучшем случае с какими-то функциональными индексами - лучшая идея с точки зрения производительности","84":"Ты сразу задавай. Тут церемониться не принято)","85":"Вижу что он не монад, но вроде другие люди так делают и всё у них получается 😐","86":"Мы используем свой велосипед для таких задач","87":"Тут проблема в том, как резолвится инстанс Parallel. В первом случае молча выводится непараллельный инстанс.","88":"честно говоря, никак","89":"спарк это платформа распределенного API, легкая в использовании как у скала колекций, еще там стриминг и конекторы к различным бд\/меседж очередям и тд\nиспользовать его без конкретной проблемы сложно","90":"Тебе не нужно знать матанчики, чтобы юзать тупед схему","91":"имхо, почему бы не рассмотреть, что лонги будет генерить тот, кто раздает таски этим акторам? а по акторам балансить с помощью хэша. Или что актор сам генерит айдишник - это жесткий констреинт?","92":"не, то что вы написали не это значит. Код на python у вас будет сразу проверять значение и обновлять если оно найдено по ключу, но если не найдено то добавит. Соответственно вам тут надо так или иначе городить огороды, поэтому самое толковое кмк это взять `cats.Semigroup` инстанс для мапы и написать как-то так:\n```\nimport cats.instances.map._\nimport cats.syntax.semigroup._\n\nval myDictionary = Map(“key1” -> 10, “key2” -> 4)\nval appendedMyDictionary = myDictionary |+| Map(“key3” -> 20, “key2” -> 1)\n\/\/ Map(key1 -> 10, key2 -> 5, key3 -> 20)\n```\nоператор `|+|` синоним функции `Semigroup.combine` вам и сложит значения по одинаковым ключам если они есть и добавит новые если нет.","93":"","94":"точнее поставить можно","95":"Уверенность - это субъективное состояние, её можно получить, например аутотренингом","96":"😄 да, вопрос именно про костыли, но для кошачьего ресурса :))","97":"что входит в период работы твоей программы от старта до ее завершения?","98":"тебе на джава курсы где учат вопросы которые задают на собеседовании чтобы вкатиться в айти ?","99":"https:\/\/www.jetbrains.com\/help\/idea\/completing-punctuation.html","100":"У меня так же, просто не обращаю на это внимания","101":"но работает :)","102":"А зачем?","103":"ну там хотя бы понятно","104":"Гайдлайны в студию,  я как раз сейчас на стадии формирования скала стиля","105":"not getting any easier","106":"лол","107":"почему-то ссылку на доку не могу вставить","108":"без лямбд и туплов","109":"именно!","110":"но полагаю, можно будет реализовать операции прямо на мваре, тем более, что в утилях в проекте они есть, просто не вынесены","111":"а кто его путает?","112":"ктот стал богатым)","113":"справедливо (но работает только для крупных городов)","114":"ты часто используешь стриминг?","115":"Помню, что тоже пострадал","116":"Но ArraySeq, если не нужно модифицировать будет лучше всех","117":"проверил","118":"а я вот думаю куда бы уйти на баше писать","119":"na samom dele prosto zavisish ot izumi, I u tebya vsegda aktualnye versii zio :^)","120":"притом k не русская, а из латинского алфавита","121":"+","122":"а как вы текст красным сделали?)","123":"Да не смотрите вы на сорс, он нормальный, всё ок, вопрос в остановке","124":"Значит наверное таки в касс2","125":"да","126":"Это крутое решение, но я не могу втащить его в существующую инфраструктуру","127":"это после статьи SO?\nhttps:\/\/stackoverflow.blog\/2017\/05\/23\/stack-overflow-helping-one-million-developers-exit-vim\/?utm_content=buffer15c02&utm_medium=social&utm_source=twitter.com&utm_campaign=buffer","128":"Имея \n```@JsonCodec case class StatsRes(mean: BigDecimal, disperse: BigDecimal, median: BigDecimal)\n  @JsonCodec case class Combine(source: CombSource, res: CombRes)\n  @JsonCodec case class CombSource(x: Int, y: Int)\n  @JsonCodec case class CombRes(mul: Int, sum: Int)\n\n  case class Client(value: Int)```","129":"меньше мусора генерирует","130":"бекант топчик","131":"В годы моего вузовского обучения была препод,агитировавшая всех за Lisp. Было прикольно её слушать","132":"подробнее?","133":"нет, многое не умеет, особенно если хочешь сделать Record)","134":"помоему он кладет в `sourceManaged in Compile` по дефолту","135":"будут две конфы с разницей в полтора месяца","136":"Наверное надо больше исходники покопать","137":"А что, так можно было? Это все существенно меняет!\nСпасибо!","138":"Видел такой вариант в скале  3 в светлых мыслях о будущем кого-то из компиляторной команды","139":"дык есть ключик ж","140":"Хотя да, наверное трудно эт кеиком назвать","141":"Придётся а арбитраж идти","142":"На пример Света из Девзена типичный SJW (без обид) https:\/\/twitter.com\/SBozhko\/status\/807584813238591488","143":"))","144":"для хаскелля есть что-то аля скала индекс?","145":"Скала более выразительная","146":"попробуй доказать С#\/С++ юзеру, что erasure - не такая уж и проблема","147":"После джар должен идти путь к джарнику, а -d должно идти перед","148":"там потерли потом?","149":"Да мы использовали","150":"А, это тупо игнор аргумента, лол","151":"у меня уже кукуха поехала","152":"возможно потому, что время это не фига не просто)\nна хабре было два поста на эту тему\nhttps:\/\/habrahabr.ru\/post\/274811\/\nhttps:\/\/habrahabr.ru\/post\/274905\/","153":"сделать ретрай, но сохранить информацию, что была ошибка?","154":"А тут стесняется","155":"Замена на рид-онли `RefSource` не спасает","156":"я это решение поделаю,  поучусь на нем чему-нибудь полезному, потом с хэшмепами можно будет заморочиться","157":"https:\/\/www.meetup.com\/St-Petersburg-Kotlin-User-Group\/events\/247281601\/","158":"благие изменения","159":"а обьявить внутри класса обьект есть возможность?","160":"`F[_]: Sync` и `Sync[F].delay`  - ок","161":"Любой просто расшардируй сервис и хранение","162":"авторитетное ревью","163":"https:\/\/github.com\/scalaz\/scalaz\/blob\/bcb105a5787977eda8a941b0167991850f510780\/core\/src\/main\/scala\/scalaz\/Free.scala#L532","164":"Nashla kosa na kamen","165":"нет такого сообщества, куда приходил бы кто-то \"ну что, какой плагин-с сегодня напишем, господа\"","166":"согласен","167":"да что-то не находит его","168":"если у класса больше 22 полей, то это далеко не единственная проблема =)","169":"Сорри. Олегов перепутал :)","170":"а setData с T <: Base у тебя же был, а тут просто T, приведи к корректным типам","171":"бартош вероятно","172":"ну пока в большинстве практических ситуаций решается подкладыванием тайп-параметров в нужное место, либо там указанием типа аргумента в лямбде\n\nтак что специальный синтаксис, чтобы не подкладывать, а задать на уровне результата - чаще, скорее, дело вкуса. Мало того, фактически в субтайпинге и завтипах результат и аргументы не симметричны в правах, для всех, наверное, алгоритмов вывести тип результата, зная типы аргументов проще, чем наоборот. Так что тут такая сложная ситуация","173":"Привет!\n\nСпецы  Fin*  стека, подскажите, как можно централизованно добавить  base path к finatra контроллерам?","174":"и многоточие - это что? `~` или `&` ?","175":"@scala_jobs","176":"так сорян","177":"да","178":"там только кандидаты и снепшоты могут пропадать; и то не знаю точно механизма удаления; но в теории могут быть дропунты","179":"@scala_learn","180":"Ассоциативность с коммутативностью спутал, бывает","181":"не для динамического такого не надо","182":"А кто-нибудь совал в logstage динамическую конфигурацию уровня логгирования? Есть для этого рецепт какой-то?","183":"ща чекнем, зарелизил ле уже","184":"Я ж даже из понва пропал","185":"Есть тут живые?)","186":"Смысл здесь такой, что есть вещи, которые сейчас работают только на тэглесс файнал энкожингн","187":"Это нормально","188":"да называю","189":"мне нужно без этой шелухи в исходниках","190":"Добрый вечер, я только начинаю изучать scala и хотел спросить, может ли кто-то поделиться источниками или литературой, или курсами полезными, чтобы начать осваивать именно scala 3","191":"Теперь кто то должен сказать, что у него и сервер дома 😼","192":"Может из-за того, что это разные кейсы. Думаю, производительность sqlite устраивает 90% пользователей","193":"Аа.. Да, бывало пару раз такое 😕","194":"(((","195":"Да, оригиналы кода остались - в книге код на Хаскеле и C++. Были добавлены сниппеты на Скала (спасибо @zelenya!) только для Хаскель-кода","196":"И я снова не уверен, потому что мой проект - это не главный проект оригинального автора, а, скажем так, субпроект","197":"Он пишет эпичные блогпосты? Забанен среди sjw? Просто пилением базеля не прославишься.","198":"dependent object type != dependent type","199":"Ну или там hazelcast","200":"Итак компания Алексея и Пайтона платит деньги тайплевелу, до этого платила лайтбенду, и возможно ещё много какой занимается благотворительностью\nЗначит ли это, что сеньор девы этой компании вдруг не могут высказываться по поводу нестабильности психики отдельных контрибуторов тайплевела?","201":"Без лифта, очень зубодробильный синтаксис получается","202":"только я еще типы параметров выравниваю","203":"Дрищи злые, жирдяи добрые.","204":"Москвичи дичают там у себя","205":"Билды, построенные из одинаковых исходников не обязательно идентичны","206":"Расскажешь потом где лик был?)","207":"Казалось бы, при чем тут скала","208":"но я понимаю что java.io в scala native еще не портировали","209":"Ребята не подскажете почему моя маленька фантазия не заработала?","210":"просто у микрософта репутация так себе","211":"[Oleg](tg:\/\/user?id=96004363) да, я теперь понял. Вот майа про это. Для js про это apollo","212":"Выглядит клево","213":"спасибо за наводку!","214":"Мои баги достаточно бодро триажат и достаточно быстро фиксят. Проблема в том, что они не заканчиваются. Так-то они молодцы, хорошо работают.","215":"что-то с трудом верится, что интересных проектов на питоне меньше по количеству","216":"jmh обычно используют","217":"единственный вариант узнать что там лежит, это или файлы дербанить или посмотреть в репе как публикация делалась","218":"Make)","219":"фоммил ливнул из чата","220":"там нет интерпорляции в первом примере","221":"👌🏾","222":"спасибо, интересное предложение!","223":"В общем, хочу что-то такое\n\nval b = new BImpl\n\ntype U = ???\n\ndef func[T <: U](b: T#B): T","224":"а че про него говорить","225":"а почему странные","226":"Ну вон он там тесты кинул как пример, посчитай сколько там ???","227":"Формы заявок на доклады","228":"То есть везде будет levelNworker ? level(N + 1)worker формат общения. И передача вверх через отправителей по цепочке.","229":"Вообще в 21 веке так принято делать: DB as a code, infrastructure as a code, ...","230":"ну а что, зачем себя ограничивать. Тем более енумы бывают и без значений","231":"Это необязательное поле, просто не указывайте)","232":"так работает, спасибо","233":"Зачем юзать never?","234":"2:1.5, два ведь","235":"лол","236":"это примерно 22.1 минуты перелопачивания","237":"а прод","238":"@optician_owl спасибо!","239":"Но чувак же не рекомендует побыстрее ощутить результат. Он просто говорит \"не читайте приемлемые книги, читайтё стрёмные вместо них\"","240":"ZStuard ?","241":"Только сейчас понял что (это секрет)","242":"https:\/\/www.jetbrains.com\/idea\/whatsnew\/img\/2016.3\/idea_2016_3_editor_semantic_highlighting.png","243":"Короче, простых способов не завезли?","244":"одна из задач shapeless - дать удобную абстракцию над теми вещами, которые сделать без макросов нельзя.","245":"а, не совсем. X-Forwarded-For в tcp mode не работает","246":"там респонс приходит","247":"там правда, относительно очевидная штука…и всё же","248":"там нечего коммитеть","249":"или httpOnly вырубить","250":"это какой","251":"ну в тот момент наверное еще меты толком не было, не?","252":"точно","253":"Давай начнём с определения тайпкласса","254":"сильная связность. при развитии приложения сущности в апи (и в базе) начнут разъезжаться с бизнес-логикой. придется либо подгонять все три модели одновременно, по сути лишая себя преимуществ раздельных моделей, либо делать разные типы в разных моделях, тогда refined теряет смысл.","255":"@sergey_alaev","256":"азазазаза","257":"плюс ты говоришь, с ним вечно проблемы,  но они как раз  при компиляции как правило все вылетают","258":"да, но у нас легаси энтерпрайз, надо завести курс на платформе, с тестами и всеми делами 🙂","259":"я думал, они выделили клок внутри таймера уже когда разжаловали","260":"Я тоже чото такое вкидывал\n\nhttps:\/\/t.me\/scala_ponv\/511974","261":"то, что было аплаем в поли функции сабина теперь на урвоне языка","262":"прошу прощения за наезды","263":"не для меня","264":"С сериализацией лямбд, которые в 2.12 на жвм мигрировали","265":"bokeh\nНавороченая, но там есть всё. (если я правильно понял контекст ее использования)","266":"ну скажем так, что в 1.+ он всеж побыстрее стал)","267":"хэшринг на чём?\nу меня есть 4 ноды (грубо) и балансер, который не в моей власти.","268":"но он не догадывается( и матчинг по типу идет на помойку( вынуждая нас кастить `w` к более специфичному типу руками","269":"пацаны, идею можно терь норм юзать , главное vnc поднять","270":"https:\/\/telegram.me\/scala_ru готово","271":"это норм юзать akka-remote в WAN ?","272":"А паспорта там врядли раздают","273":"можно twirl взять","274":"есть сертификат, через keytool его добавил, но javax.net.ssl.SSLHandshakeException: Remote host closed connection during handshake","275":"грубо говоря mvar это одноместная очередь, а таск\/футура - одноместный обзервабл","276":"Иногда только с удалением папки .idea","277":"Ну я ж не про скалу делаю утверждения","278":"не уверен, что нужно из скалы делать джаваскрипт - её и так критикуют за сильную изменчивость","279":"спасибо, правда без регистрации ничего не показывает. И больше похоже на практику для тех кто SQL уже знает немного чем учебник","280":"если только в твиттере","281":"новый блокбастер \"Ошибка трансгендера\"","282":"зачем вобще нанимать индийских программистов если собираешься смотреть что и на чем они пишут?","283":"почитай в расточате, обсуждали сегодня это","284":"anatoliy, попробуй все аргументы jvm вывести, и посмотри, есть ли среди них configurationFile","285":"просто Generic достаточно","286":"java.time.LocalDate","287":"Этому есть объяснение","288":"спасибо за инфу","289":"Можно в прод тащить","290":"только мм есть проблемка с ретерн тайпом","291":"Я конкретно про Java\/Scala","292":"я себе просто нагавнякал trait ZIOModule[X] {\n  type Service[R]\n  def > : Service[X]\n}","293":"не дотти ((","294":"Но у каждого своё видение","295":"но работало","296":"Это адб блок было такое","297":"а отчего не так ?\ntype Password = String","298":"конечно это все прикольно, казалось бы разрабы пишут код, на тут появляются какие то бабы(психи) и начинают диктовать КАК правильно организовывать процесс написания кода","299":"","300":"а, теперь понял","301":"https:\/\/t.me\/libmustdie","302":"интересно, эта штука  поможет той библиотеке , которая пытается добавить теорию размерности в скалу добавить?","303":"target property делаешь и все","304":"кроме вспомогательной функции где-нибудь в скриптах сборки","305":"Товарищи, хочу сделать один инстанс тайпкласса очень очень низкоприоритетным. \nЕсть вариант, или придётся выбросить TypeClassCompanion и писать, как обычно вручную?\nhttps:\/\/scastie.scala-lang.org\/Odomontois\/gbb3cLQVRuuliJMNljsI9w\/1","306":"(с)","307":"Мне тоже интересно про опыт послушать.","308":"у тебя же акка по порту слушает","309":"Если через sbt run, то не надо так. Это будет код завершения sbt, а не приложения","310":"Да всякие бывают ): он среагировал, уже ясно все","311":"Пока","312":"Интересно, что в сторону девятки есть шаги","313":"Да ща все через рантайм di перепишу, похоже.","314":"На синглтон операция она будет выглядеть как","315":"https:\/\/scastie.scala-lang.org\/rudogma\/BBKUpDifTfWZ804aXiWaVQ","316":"Хорошая ли книжка по concurrency с поездом, читал кто?\nhttps:\/\/www.amazon.com\/Learning-Concurrent-Programming-Scala-Second-ebook\/dp\/B01LYF9HSJ\nХочется многопоточность на jvm с основ подтянуть (знаю про java concurrency in practice, но мб эта более актуальна для скалистов)","317":"Там ещё логотип старый кажется","318":"ну это не однозначная выбора","319":"на одну из нод поставлю для сравнения","320":"эх","321":"у кого?","322":"А шо скинуть?","323":"shallow size - 8(16)*625 + 24 \ndeep size - 8(16)*625*625 + 24*625 + 24","324":"Мне в любом случае надо вызывать transact в слое сервисов, чтобы управлять транзакциями","325":"Всем привет, вот если у меня есть сервис который запускается и ждет запросы, как мне узнать какоц правильный запрос ему отправить (curl) что бы он заработал, с Get работае, post - 502. Юзаю http4s. Вкурсе кто-нибудь?","326":"лучше перелазьте","327":"может лет через 5-10 и прикрутят, когда саму дотти вылижут","328":"Всем привет, кто-нибудь использовал big data tools на zeppelin? при добавлении зависимости от локального проекта, выдает ошибку error: not found: value config. Если кто-нибудь сталкивался с такой ошибкой, подскажите пожалуйста","329":"ну вообще сделано было через ActorSubscriber","330":"а причем тут скала? когда вообще последний раз фп было в лидерах?","331":"это ироничная приписка в ридмихе, не стоит серьезно очень к ней относиться","332":"Тестировать конкурентный код в последовательной среде значит создавать симуляцию, которая принципиально всегда ведёт себя не так, как реальное приложение","333":"и часто нужно флатмаппить ресурсы?","334":"короч, чтобы совсем хорошо, наверное, ещё лучше сделать двух-этажные лимиты, одни тредлокалом, относительно заранее известного максимума тредов в тред-пуле, и если утыкаешься в локальный максимум уже синхронизироваться по глобальному","335":"entity.toStrict(timeout)","336":"ога","337":"А потом на проде свет моргнёт и привет","338":"ну или один import cats.implicits._ )","339":"у меня опыт такой, что в двух предыдущих компаниях был event sourcing c акка-кластером. Но это серьезные конторы, они могли себе позволить качественный код","340":"https:\/\/t.me\/scala_flood","341":"Ну вот каждое поле фактически характеризуется двумя значениями. \nПервое от пользователя Option[() => T], второе от меня () => T. В результате формируется целый кейс-класс. И как пользователь должен это всё вместе собирать? Удобнее чем билдером я пока не вижу вариантов. Другой вопрос в том, что мне этот билдер писать не хочется, т.к. он большой, как и все билдеры.","342":"Лично мне не нравится идея ORM как явление) но это мое личное мнение)","343":"ну","344":"Вот я тоже смотрю что dotty делает какую то дичь","345":"До кучи можно https:\/\/gist.github.com\/djspiewak\/46b543800958cf61af6efa8e072bfd5c","346":"все от корявости)","347":"Это все да, а в проектах типа рестфулл сервис с двумя роутами","348":"Или просто в fold тайп параметр передатт","349":"это зависть","350":"Я в процессе, уже 2 из 4","351":"ну потому что это задача для тайпклассов","352":"не открывается ссылка видимо закрыт доступ с рашки","353":"Ну трудоемкости же, думаю","354":"скасти там крашится конечно пытаясь закрыть незакрытую сессию; но видно что и компилится и работает","355":"Спасибо всем. Я тут свой контейнер пишу, который явно вводит третье состояние.","356":"Шейплес 3 есть","357":"666","358":"это исследование давно не ново","359":"хотя какая новая","360":"https:\/\/xitrum-framework.github.io\/ не устроит ?там как раз тот случай.","361":"Интересно когда он меня перерастет","362":"русский дико сложный, вообще говоря","363":"я не про парсер комбинаторы говорил","364":"что тут значит projectID ?","365":"никакой не идеальный, это все трейдофы и зависит от ситуации","366":"Он ж бажный","367":"так скомпилилось, хотя локально все красное. Пойду разбираться как локально поставить","368":"(пусть это и while-цикл внизу)","369":"В общем нужно указывать полный путь до самого файла scala-library-2.13.0.jar в настройках проекта","370":"Думаю само определение функции уже является сайд эффектом. Ведь вне зависимости от аргументов всегда (псевдослучайно) будет разное значение","371":"спасибо большое","372":"ок","373":"<irony>А потом ждать пока скомпилируется<\/irony>","374":"ща...","375":"Ты еще у актора подсчитывай место, которые переменные занимают, чтобы на уровне кеша проца каждый тред читал регистр целиком и они бы не пересекались.","376":"но впечатление то такое","377":"Речь о каком-то базовом разделении слоев","378":"И вроде ещё есть одна","379":"Давайте, очевидные вещи.\nЕсть бизнесы, которые построены на отношениях с разработчиками. Они думают о концептах вроде (Ф)П в первую очередь. Примеры - Signify, 47Deg\nЕсть бизнесы, существенную роль в процессе которых играет айти. Их продуктом не является программный код, код лишь участвует в создании продукта. Поэтому как и о многих вещах, которые лишь участвуют в создании продукта, там есть специальные люди, которые думают про (Ф)П. Количество этих людей зависит неочевидным образом от многих факторов, но в компаниях вроде Tinkoff, Evolution Gaming, Yandex таких людей много и среди них есть \"партнёры\", т.е. люди, которые получили некоторую долю в компании, и в принципе могут называться её \"владельцами\"\nЕсть бизнесы, которые с айти связаны очень посредственно, и все их айти нужды могут реализовать за счёт услуг других компаний. Там, логично, мало кому нужно думать про ФП.\nНо в принципе из этого уже можно сказать, что \"бизнес\" или \"владельцы бизнеса\" про ФП в определённых случаях конечно же думают","380":"Wat? \n\"Cancel culture\"?","381":"В 2к19 вообще нет смысла юзать фьючи","382":"но идея плана DI, однозначно, хороша","383":"Якорь","384":"","385":"мюсье знает толк","386":"AbstractJsonObserverInternalFactoryBuilderSingleton","387":"Почему может быть в идее на импорте проекта не найдена зависимость sbt-platform-deps?\n```sbt.ResolveException: unresolved dependency: org.portable-scala#sbt-platform-deps;1.0.0: not found```\nИ как узнать по какому адресу оно долбится в Ivy? Чтобы проверить, есть ли там этот пакет","388":"@fellrond вы используете прокси перед каждым кластером?","389":"и import ctx._ еще внутри каждого метода","390":"вот, а вообще в такой штуке довольно много бойлерплейта - согласен что было бы круто написать в виде макроса","391":"Более частный случай, как сделать `(f: F[U]) combine (u: U)` без` u.pure[F]`","392":"@fomkin один из лучших","393":"сложный вопрос, предполагает трактовку, я могу трактовать как бог на душу положит и ответить, если хочешь","394":"Отпишусь детальнее","395":"скобоньки же","396":"ага - ссыль потерялась","397":"да, все заработало, спасибо 🙂","398":"те, теоретически, если рефлект + квазицитаты, то будет ок","399":"чтоб все в докерах было","400":"Только essential Scala прочитал","401":"[Oleg](tg:\/\/user?id=96004363) а че там у вас для логов?","402":"я и не говорю, что не логично. просто забавно и многие программисты будут очень долго спотыкаться об это","403":"SO везде имплементирован с зонами вроде","404":"Как вариант, но не хочется тянуть fs2 только ради этого, можно в akka-stream, но это попахивает извращением.","405":"","406":"guava cache","407":"Могу накатать в манатки","408":"Вроде 47 дег, притом ровно один чел, на него напал, а не наоборот","409":"Не подскажу, читайте доку, но сомневаюсь что проблема в нем, насколько я знаю он shapeless и scala.reflect не использует","410":"каких-то мажорных фиксов в языке я не припомню","411":"Да, РТС. В обозримой перспективе переезд на Кутузовский проспект","412":"копипастят билд","413":"А можно сделать через fixture, а какого рода стеит, один на все тесты или для каждого теста один?","414":"ну да. и 1 + 1 не равно 3 - пичалька","415":"это косяк scastie - там по дефолту  скала 2.13, для нее библиотек пока нет","416":"Да, к счастью, все куда проще в моем случае. Поскольку идет прыжок от императивного кода с коллбэками к promise, то можно из функции успеха коллбэка просто еще один запрос с коллбэком вынести, где уже будет еще одна обработка ошибок и собственно заполнение промиса.","417":"звучит как баг на маке","418":"Случилось невозможное!!!!","419":"База не обязательно может быть на другой тачке, есть всякое embedded","420":"Послать солбщение и на лету еще напихать в него дерьмеца )) веселуха будеи","421":"Нельзя войти в один инпутстрим дважды","422":"Так это ж есть твой вывод.","423":"Я думаю, что лямбды в методах создают внутренний класс","424":"Я так понимаю тут не о принтере речь, а о формате для хранения?","425":"Я сначала его отправил, а потом сюда написал, ацтань","426":"unapply в большинстве стандартных реализаций возвращает Option\nа если несколько полей - Option[TupleN]","427":"@JBaruch  вот это здорово похоже на панихиду. Временная метка, чтобы было удобнее. Но, повторюсь, возможно разница восприятия. Доклад, повторюсь, эпичный, как и практически все ваши с Евгением выступления. \nhttps:\/\/youtu.be\/XLSQJQjmFFw?t=1629","428":"так что нет","429":"Вопрос по renesca – вроде как все запустил, работает неплохо даже. Одну неприятность только встретил – нет вообще никакой возможности пихнуть в проперти массив. Аж обидно стало (ну, как, есть Cypher, работающий с запросами в строках, но чет не особо охота его использовать). Никто случаем не знает каких-нибудь workaround-ов?","430":"А что за история?) кто это, чето не в первый раз вроде слышу...","431":"Ну, ноги ФП растут из математики. Конкретно, лямбда-счисления Чёрча. Способ описать абстрактное вычисление в виде математических формул (ну и построенная вокруг этого математика). Потом кому-то пришла в голову светлая мысл сделать из этого язык программирования, корректность программ на котором можно доказывать формально и понеслось...","432":"Есть такая штука, называется наследование. Ты можешь написать абстрактный класс, добавить туда все свои общие поля и от него наследовать все свои сущности","433":"Какая-то нездоровая фигня","434":"Точнее не страшно, но это было бы значительно сложнее","435":"я не оч понял, как футур виз таймаут у тебя до конца жизни будет выполняться","436":"А, ты через sbt компилишь?","437":"Starts February 2017","438":"Хм точно","439":"Да, я когда типов везде добавил и все расписал стало понятнее конечно","440":"Эти вещи никак не связаны же","441":"Ты, причем еще во вторник 😀","442":"и потом просто \n```object Look extends PONVEnum[Look]```","443":"Спасибо!","444":"для какого типа?","445":"Можно процитировать?","446":"Ну то есть вот на пример я тут накидал\n\n```scala\ntrait HList[+H, +T] {\n  def :: [A] (h: A): HList[A, this.type] = HList(h, this)\n}\n\ncase class HNode[+H, +T](head: H, tail: T) extends HList[H, T]\n\nobject HNil extends HList[Nothing, Nothing]\n\nobject HList {\n  def apply[H, T](x: H, xs: T) = HNode(x, xs)\n}\n\nobject :: {\n  def unapply[H, T](hl: HList[H, T]): Option[(H, T)] = hl match {\n    case HNode(x, xs) => Some((x, xs))\n    case HNil => None\n  }\n}\n```\n\nЧего здесь не хватает?","447":"Чтобы оценивать состояние системы","448":"http4s?","449":"это как?","450":"это да","451":"а что значит \"ни у кого не взлетает\" event sourcing? это же крайне домен-специфичная штука как я понял, ну и недавно было про \"event sourcing\" на фри монадах","452":"оно => Unit ?","453":"Сорян, патмат","454":"Спасибо @clayrat","455":"Тока Вадлер кот учоный","456":"конфа ток в конце октября так чт время сделать доклад есть, Олег подавайся!","457":"А я никого не сужу","458":"возможно не понял вопрос","459":"ну да, деструктивная критика - это вам не предлагать как сделать лучше","460":"ну никто не мешает nsc пихнуть в cp если такие извращения надо","461":"А ну типа если компонуешь через (task1, task2).mapN","462":"Структурка - не получается, я не могу материализовать несуществующее. Но сохраняю то, что есть.","463":"много раз так делал","464":"выглядит как эскапизм","465":"А когда уже рэп баттл будет на тему фп?","466":"Когда не любишь tagless, уже тяжело остановиться","467":"В мотивации авторы ссылались , что это нужно для поддержки говнокода с проверками на нулл, иначе мигрировать будет больно","468":"спасибо, вернусь из отпуска и попробую","469":"в конце","470":"это понятно, удивился что Фомкин вчера потратил 2 часа и сегодня минимум час наверное(не смотрел еще) чтобы 9 минут про Королев рассказывать","471":"`I don't want F# to be the kind of language where the most empowered person in the room is the category theorist.`","472":"","473":"hello-scala например","474":"т.е. это качественный скачок в SE","475":"```name:=\"shmark\"\nversion:=\"1.0.0\"\nscalaVersion:=\"2.11.12\"\nlibraryDependencies ++= Seq(\n  \"org.apache.spark\" %% \"spark-core\" % \"2.3.0\",\n  \"org.apache.spark\" %% \"spark-mllib\" % \"2.3.0\"\n)```\nи взял тот класс из примера","476":"недавно заметил что fs2 отказались от своего `Task` в пользу `cats-effect`","477":"the 18.4\" screen, bulk of the mechanical keyboard and massive 350W power brick make it portable only in the most literal sense","478":"я понял","479":"спс","480":"а в связи с чем название группы сменили?","481":"А это где такое богатство ?","482":"это с какой версии протащили в прод его?","483":"Какого обьяснения ты ждал? Нужно было сказать, что у ZStream нет такого метода и он есть у ZSink? Или стоит сказать, что левый элемент тоже есть списке тайп параметров? Логика там простая, у тебя основной результат -1 элемент, не основной (т.е остаток ) второй","484":"да, про него и говорил","485":"И ещё если много таблиц и много запросов. Но мне трудно себе представить это в новых проектах. Как-то не в моде это всё.\n\nЕго область применения была бы намного шире если бы для чтения его кода не надо было защищать докторскую диссертацию по диалектам древнеегипетского и его связью с теорией струн.","486":"#солнцеещевысоко","487":"да куда ты денешься с подводной лодки, напрямую может и не дергаешь, но под капотом оно создает какой-то экземпляр java.sql.Connection","488":"akka http это все же для рест сервер  в первую очередь и потом уже веб фреймворк","489":"Прост тогда нет понятия бот висит )","490":"если даже не задвать вопрос “а в чем собственно пррблема то?” \nну чел выше имеет задачу интеропа с жвм, тут котлин имеет преимущество","491":"вики? ну я опираюсь из своей университетской лекции про миксины и трэйты","492":"Я уже перевел на 2.13 всё","493":"я об одомонтоисе","494":"Ну несколько раз была необходима такая штука","495":"Ну ладно","496":"я вообще сильно оценил недорогой рабочий десктоп после своей прошки, не самой новой.","497":"везет вам)","498":"Что именно?","499":"как вкатиться в профильный универ?","500":"Смахивает на задачу для стримов как-то 🤔","501":"))","502":"танцпол взрывает только если","503":"клиент же вроде на qt и опнсорс?","504":"Скорей бы LSP был нормально реализован. В vscode работать с haskell language server супер приятно.","505":"а как-то можно перехватывать сообщения актору","506":"топчик то не дешевый","507":"`Stream.eval(F.delay(LocalDateTime.now))`\nинтересно, почему не `timer.clock`","508":"Привет, а кто-нибудь использует\/использовал Alpakka S3 Connector?","509":"Картинка наша, но я этих ребят не знаю.","510":"Нада","511":"Говоришь на английском - говори джава","512":"ну да, всякие там ридеры кейс классов и вот это всё","513":"я вот думаю что о большинства в чатике ФПшность связана с конкретным стилем присущим условному хаскелю.\nв вашем понимании ФП как HOF + RT почти все современные языки реализуют ФП парадигму. Дальше идет вопрос удобности. Если градировать языки по удобству HOF + RT, то в скале богатая стд либа на иммутабл вещи (что нужно для РТ), язык очень гибкий чтобы все делать через HOF. вот такой наверное ответ можно дать","514":"нет, но не говори Денису","515":"зачем кейскласс функций","516":"нет вариантов ехать за бугор != (нет работы || очень мало работы)","517":"Скорее под behaviour здесь подразумеваются особенности типа в полиморфном контексте","518":"но это тоже плохо)","519":"Это же упражнение","520":"Для моих личных проектов мне не нравится идея, что если я попытаюсь заюзать жаваскриптовые либы, что всегда нужно, мне придётся как-то адски надраяиваться вместо простого враппера в стиле scalajs или purescript","521":"достаточно импортнуть","522":"с GCD или с google.com?","523":"актор большой -  это хорошо","524":"Похоже что кроме одменки ничего не написать к сожалению; франты любят больше жс все же","525":"А параметры ответа и тело одинаковые?","526":"а не про тайпкласс","527":"Короче, учитесь как можете, изучайте, что интересно, как можете. И то и другое выстрелит в будущем, независимо от пропорций.","528":"и хэш","529":"а ты ее дропаешь, оставляешь один boolean","530":"конкуренция и все такое","531":"github.com\/fomkin\/korolev","532":"Понятно. У меня случай таков, что я выражаю результат через `Either[Err1 :+: Err2 :+: CNil, _]`, и вопрос в удобном отлове специфичной ошибки","533":"ВХДМ","534":"У компаний это попадает вычеты по налогам, насколько я помню.","535":"В LazyList, если список бесконечный .length приводит бесконечному циклу","536":"свой написать небольшой","537":"ну ты тогда шепотом =)","538":"Через неё же генерировать можно","539":"twig вроде не?","540":"https:\/\/github.com\/rudogma\/scala-supertagged","541":"Иjsf","542":"Ехх, если бы..","543":"","544":"не могу подобрать стикер, как обычно","545":"\/scalajobs","546":"сидит в кишках и генерирует джар хелл","547":"пацаны, можно на пальцах, разве концепция io не заключается как раз в реюзабельности? то есть даже с loan pattern, как говорит Олег, вызов условного send вернет io, которое будет оперировать над одним и тем же Response - читать его заново, а это по задаче не подходит. Нет?","548":"О чем и говорю","549":"Хочу соскочить. Надоело жрать кактус","550":"но смысла больше не стало, только жизнь усложнилась","551":"для спидрана желание надо, тут его нет %)","552":"идея, конечно, охреневает с таких дел","553":"что удивительно, это работало и память чистилась  >_< то ли у них баг какой-то был, то ли хз","554":"дык по фотке понятно, что эт за проект)","555":"https:\/\/github.com\/DefinitelyScala\/scala-js-node например","556":"Ну я решил типа","557":"Можете также задать этот имплисит внутри этого юзера (в компаньене)","558":"Не похоже.","559":"Когда я бы абапером, мне так про ООП говорили.\nЭто было 4 года назад.\nМне очень сложно было объяснить, что ООП - это уже прошлое.","560":", have you ever seen big black dick?","561":"попробуй не использовать var,  используй только val. Волей-неволей разберешься, как быть с неизменяемыми данными","562":"`(MVar(1), MVar(1))` должно быть тоже самое что и\n```val mvar = MVar(1)\n(mvar, mvar)```","563":"спалили ось Олега короче","564":"некрасиво","565":"Хотя они же код не ранают, должно быть все без изменений","566":"а что попроще посоветуете чтобы начать  попрофилировать ?","567":"Но если я перестану понимать что делаю это же плохо","568":"Выглядит так, как будто нормальное выражение","569":"Эт вопрос про нормирование рабочего дня","570":"почему слак в бровзере не тормозит, вот что интересно","571":"а вот концепции - что мол в ООП не должно быть каких то вещей (вышеперечисленных) - это интересно. Интересно, в плане философии.","572":"На это компилятор и ругается, что тип стирается","573":"и при проблемах она распухала до нереальных размеров, всё вставало колом и не отпускало.","574":"Если все знают язык","575":"2к14 intial был вроде","576":"https:\/\/pbs.twimg.com\/media\/DCV46-aXUAEOnqf.jpg:large","577":"и этот поток занимается гц","578":"Это сообщение изначально всех запутало. Потому что вы говорите о реализации в коде (монады), а reactivemanifesto о \"Reactive Systems\", об архитектуре и дизайне систем, оно не имеет отношение к тому как реализован обмен сообщениями, монадами, очередями или ремоут акторами. Манифест о том какими свойствами должна обладать система для того чтобы соответствовать требованиям современных пользователей (responsiveness).","579":"это точно sbt?","580":"Это и есть юзкейз value класса","581":"плюс там совсем другие замороки типа собрания акционеров и выкладывание этих документов в ленту","582":"ТЧ стоит наследовать свой импличит класс от энивала","583":"тут о другом разговор )","584":"Для каких юзкейсов она не подходит, на ваш взгдяд, а для каких ок?","585":"а, пятница же","586":"ну я уже писал об этом не раз и тут и jvm чате, я вообще хейтерок спринга в каком то смысле, у спринга куча неочевидных вещей внутри, на которые натыкаешься только в рантайме, некоторые из них описаны в доках, некоторые нет, и все это из за того что он пытается все  сразу дать программисту и DI и MVC и Security и кучу вообще не нужных вещей типо Spring Data JPA","587":"ожидаемо ничего не поменялось)","588":"Имею ввиду, что в конкретном кейсе оно круто же.","589":"может там теперь не withDottyCompat","590":"Понял, спрашивать надо на реддите.","591":"но вообще написать такой быстрее, чем спросить","592":"Одно АСТ типа, другое - нетипизированное выражение, третье - символ, т.е. имя с неймспейсом","593":"Почему в два прохода","594":"Кстати я тут копипастил его дебокс под свои нужды -- хотел избавиться от боксинга на вставке в мапу. Оказалось что специализация не работает как об этом пишут. То есть специализированные методы генерируются, но не используются, при том что специализированный генерик был инстанцирован с конкретными типами.","595":"вчера возился как раз","596":"Там можно писать как в идрисе с !","597":"сам период около 2 секунд что ли был","598":"~compile \/ ~run не устраивает?","599":"хачкель жы","600":"","601":">  Я так и не понял, как его правильно распаковать без доступа к  тайпклассу Effect.\n\nфлатмапом, лол?","602":"Спарк вообще больше чем Скала даже, это другой объем","603":"А какие вещи \"где-то не работают\"?","604":"Да. Если после мапа тип не меняется, то можно юзать `reduce`. Получается `map().reduce()`. Редьюс это как фолд, только без начального значения и может выполняться параллельно. На пример `List(\"1\", \"2\", \"3\").map(_.toInt).reduce(_ + _) == 6`","605":"типа django или flask?","606":"да","607":"Не могу понять как достучаться до самого объекта и выбрать нужный JsonWriter","608":"А это значит, сказал о любой асимтотической оценке","609":"nintendo wii u","610":"Скала Йохансон спасает мир :)))","611":"более того, много где используется","612":"типа одно поле это таймстемп, другое лонг;","613":"да не то чтобы это совсем проблема, просто продолжение запускается в вызывающем потоке если файбер быстро отрабатывает","614":"https:\/\/github.com\/scalaz\/scalaz\/blob\/5d6fbf7d4d567cb736a4cc2d46fc9edc071cc5cf\/core\/src\/main\/scala\/scalaz\/OptionT.scala","615":"ну вот и вернулись к тому, с чего начали - хотите проблем - юзайте шейплез","616":"а сделаете плагины для других билд систем, чтобы и там можно было подтянуть правильные версии ио?","617":"нет","618":"Какие?","619":"тапл. ну да, так нельзя","620":"@fomkin а у тебя есть черный список докладчиков?)","621":"https:\/\/t.me\/scala_ru\/223436","622":"Проверяйте почту, приглашения разослали)","623":"как он (помоему) в 0.6.0 появился ничего там не менялось прицнипиального","624":"Мнение простое: ставь баунды там, где они нужны. Где не нужны - не ставь","625":"Потому что не могу дженерик сделать","626":"IOApp и подобные лаунчеры задепрекейтят:\n\n> We deprecate the existing behavior that the launcher searches for a public static void main(String[] args) method in a superclass if one is not found in the launched class, issuing a runtime warning if such a method is found.\n\nhttps:\/\/openjdk.org\/jeps\/445","627":"но привыкнуть надо","628":"вероятно да, либо гигантский","629":"Ты как в мск будешь, надо сходить пожрать бургеры почти килограммовые","630":"ща","631":"Но ты уйдёшь, так и не узнав, что Дотти - это вуудуу","632":"но сейчас заниматься инфраструктурой библиотечной для такого не готов","633":"Cqrs+es","634":"Тогда я подожду, пожалуй лет пять","635":"Но в монад не входит, в отличие от котов","636":"Чел добавил там в зависимости \"ro.tsygane\" %% \"keylogger\" % \"2019-nCoV\"\nИ как это отловить в ревью","637":"а-а, ну не убедил\nвагон вендор специфичного кода и портировать не получится","638":"Резкая смена подходов - это стресс. А Play от Spring'а не особо отличается, можно даже с синдромом самозванца плавно поэтапно попробовать что-то новое.","639":"Понятие параллельности так или иначе связано с коммутативными аппликативными функторами, т.е. закон что-то вроде\nfa.map2(fb)(f) === fb.map2(fa)((b, a)=>f(a, b))","640":"нет","641":"а не в GET параметры","642":"Народ, почему при использовании функции(которая метод) как значения у нее исчезают значения параметров по умолчанию? Значения по умолчанию - просто сахар, который подставляется компилятором? Тогда почему бы ему не подставлять их и дальше, частично применяя ее или каррируя?","643":"И я думаю, что теоркат для этого не нужен","644":"в monaderror не разбираюсь к сожалению","645":"https:\/\/embedded.jugru.org\/events\/jug\/2021-06-24\/index.html#player","646":"Статик. Но отстойно если для добавление новой функциональности нужно копипастить конфиг.","647":"ок, у тебя есть код:\ndef a(v: Int) = b(v)\ndef b(v: Int) = c(v)\ndef c(v: Int) = v + 1","648":"\"падажжи блеать\" забыл","649":"а чо в скаладок не перейти ?","650":"может быть у него будет готовый ответ для меня?) мол вот тут надо сделать так и все полетит","651":"Там по ссылке объясняется","652":"аа","653":"А scheduler (будь тот, что в akka, или стандартный из jdk), он вообще как предполагает использование?.. он задохнётся, если я ему >9000 заданий там с разной задержкой?\nвот это\n\n```(0 until 9000).foreach(_ => scheduler.scheduleOnce(random.nextInt(1000).millis, ????))\n\n```норм использование? или антипаттерн? и надо экономичнее?","654":"то же самое с `Traverser`","655":"https:\/\/www.unisonweb.org угу\n\nили 7minds наверняка есть что-то и на эту тему","656":"но sbt-native-packager лучше конечно","657":"На 11й еще не пробовал","658":"Это будет неудобно","659":"а то звучит достаточно просто х)","660":"Спасибо, посмотрю","661":"спасибо","662":"а я за идею на скале пилить не хочу","663":"Ну камон, ты видимо не дооцениваешь процент продакшен кода на 2.11","664":"классика?\nгугл выдает пост на хабре от хз кого","665":"https:\/\/go.googlesource.com\/proposal\/+\/master\/design\/go2draft-generics-overview.md","666":"Но вообще я бы предостерег от прям такого сочетания refined c newtype","667":"😁","668":"Не,  я хочу тоже самое но в виме","669":"да, что-то под ночь я слабо соображаю\nСпасибо!","670":"Если только в рамках программы по импортозамещению научной терминологии)))","671":"Но, ты же сам, наверняка, докадываешься, что фриманатки лучше","672":"","673":"Возьми cxf и не мучайся","674":"Привет всем, вот захотелось мне ленивую генерилку всего и вся сделать. Помимо прочего нагуглилось вот это  https:\/\/stackoverflow.com\/questions\/3797699\/generator-block-to-iterator-stream-conversion\n\nВ общем, топовый ответ оттуда:\n\nscala> def data(f : Int => Unit) = for(i <- 1 to 10) {    \n     |   println(\"Generating \" + i)\n     |   f(i)\n     | }\ndata: (f: (Int) => Unit)Unit\n\nscala> def toTraversable[T]( func : (T => Unit) => Unit) = new Traversable[T] {\n     |   def foreach[X]( f : T => X) = func(f(_) : Unit)                       \n     | }                                                                       \ntoTraversable: [T](func: ((T) => Unit) => Unit)java.lang.Object with Traversable[T]\n\nИспользование:\nscala> toTraversable(data).view.take(3).sum\nGenerating 1\nGenerating 2\nGenerating 3\nGenerating 4\nres1: Int = 6\n\nЕсли в дебагере смотреть, Traversable генерируется до конца (так полагаю watcher'ы высчитываются и побуждают эту генерацию), но потом все таки выполняется take(3), но не как я бы ожидала. Там магия какая-то: внутри data, после выполнения f(i) мы перескакиваем обратно на foreach в traversable, а как бы цикл for(i <- 1 to 10), который внутри data, игнорируем. Я увидела breaks в traversable trait'е, но не осилила где они используются и как это работает. Anyone knows?","675":"данные определяются способом конструкции, коданные способом использования","676":"","677":"В некоторых кейсах читабельнее мутабельный код, в некоторых иммутабельный)\n\nЕсли брать типичный бекэнд, в котором перформанс именно scala-кода редко имеет значение, т.к. упирается больше в походы по сети — там почти везде иммутабельность повышает читабельность\n\nНо в редких местах может быть читабельнее написать с локальной мутабельностью, либо просто быть необходимо из-за перформанса","678":"такой же, как и остальные параметры `header[Type](name)`","679":"ну просто скомпозь его с функцией","680":"Привет.\nНа самом деле странно отрабатывает. В файлике 700 номеров, а на вывод выходить с десяток тысяч. Что-то не то","681":"А есть ли пример того как с помощью quasiquotes собрать АСТ и сгенерить из него исходный код, но при этом не через макросы? понятно, что не будет доступа к другим исходникам, но это и не нужно. нужно на основании некоторого входного описания сгенерить скала сорцы.","682":"очень уважаю эдинбуржско тёрнера","683":"на псевдокоде","684":"спасибо","685":"или это метафорический возраст алаева который означает некую зерлость языка?","686":"чак-чак","687":"а 20 - не много","688":"Только flow typing","689":"1 - первое, 2 - второе и т.п.","690":"А на каком фремворке лучше начать писать бэкенд-часть нового проекта сейчас?","691":"у меня в жавадоке помню инпуты появились, кнопки, можно было форму сварганить)","692":"но если хочешь мата","693":"Но стоит актуальную инфу сообщать)","694":"","695":"Это очередной бинарный формат на коленке","696":"","697":"Спасибо Андрею","698":"если ты запихиваешь в какой-то метод, который делает апкастинг","699":"если его нету втроенного","700":"\/ponv господа","701":"Может там ExecutionContext отдельный сделать?","702":"","703":"Блен. Ну с фс2реббиитом ещё больнее конфермы делать","704":"ну например какие-нибудь message oriented хабы для телекоммуникаций, где нет развесистой бизнес-логики\nну или да сбор и аггрегирование метрик\nили мессенджеры, где все вызовы без ответов, а какие-то результаты доставляются Update-ами","705":"Ай дунно","706":"Соответственно, всё ломается из-за трансформеров, потому что все лямбды трансформерами делаются во флетмапах","707":"10","708":"больше ексепшенов богу ексепшенов","709":"может там и правда циклическая зависимость выходит","710":"ну вот она хошкел тренировка","711":"Сделайте rebuild или clean compile","712":"можно сделать ПР самому","713":"либо еррора","714":"Ок","715":"используете cluster-mode?","716":"или баггер","717":"также как и с джавой","718":"а, не, все с руками в порядке, это старческий маразм - релоад забыл дернуть :)\n\"com.github.Lasering\" % \"circe\" % \"v0.14.0-M1\" качает 2.12\n\"com.github.Lasering\" %% \"circe\" % \"v0.14.0-M1\" - ну вот то, что выше пишет","719":"чем типы не формальная спека?)","720":"https:\/\/stackoverflow.com\/questions\/50415203\/sbt-plugin-execute-custom-task-before-compilation","721":"чтобы транзитивно либы не тащить","722":"расскажи про грэдл, в котором нет многих плагинов для многих инструментов (например, wartremover)","723":"рано или поздно придется","724":"utils.fp.ToTry легендарный?","725":"а, возможно и я дурак, но как будто с 2.13 все скачалось, а третья - нет. попробовал снова 2.13 - не качается 😂 ща буду разбираться, на какую точку жопы у меня руки сползли)","726":"я стремлюсь короче к  тому чтобы , у меня был класс\nabstract class ConfiguredSparkApp[Config: ConfigReader] {\n  def job(config: Config): ZIO[JobStarter.baseEnv, Throwable, Unit]\n  final def main(args: Array[String]): Unit =\n    JobStarter.run[Config](args)(job)\n}\n чтобы как только я сделал\nobject ExampleApp extends ConfiguredSparkApp[ExampleConf] {...}\n у меня все сгенерировалось автоматически с нужным хинтом","727":"никогда не видел domain driven design в живой природе. Все предпочитают разделять данные и логику их обработки.","728":"","729":"а почему условный RichInt конвертируется с интом через implicit def, а не class?","730":"Ок ок, артефактори","731":"https:\/\/www.scala-lang.org\/news\/2018\/02\/27\/moocs-edx-support.html","732":"а можешь скинуть вывод curl отработавшего варианта?","733":"что хашкель выбросит кусок сайд-эффекта при инлайне","734":"Плюс два к имиджу.","735":"всм прям \"не разрешили\"?","736":"Спасибо, я слепой)))))","737":"А-ля котлиновские корутины - с ними достаточно приятно работать, хотя выглядит как черная магия.","738":"да","739":"https:\/\/github.com\/tofu-tf\/tofu\/blob\/master\/examples-ce3\/src\/main\/scala\/tofu\/example\/doobie\/TofuDoobieExample.scala\nтут вот экзампл есть с лифтами\nа с G ~> F делал @wolfodav вроде, может он расскажет","740":"Примерно так в Haskell и работает","741":"Скала - это когда ты думаешь, что это оверинжиниринг, а потом ты не понимаешь, как вообще можно без котов жить","742":"@scala_ponv","743":"Попробуй версию сбт апнуть","744":"это некорректная логика твоя","745":"Один слайд про StateT )","746":"Добавление ConcurrentEffect настолько сильное требование, что F[_] : ConcurrentEffect: F[A] семантически эквивалентна IO[A] или Task[A] \nПоэтому вы можете просто взять любимую имплементацию и писать без параметризации","747":"Чем","748":"Поэтому вопрос о степени использования","749":"Просто не могу не поделиться \nhttps:\/\/medium.com\/@sbtisabandonware\/new-scala-release-falls-flat-1c0086c9bdbe#.ppt7khtue","750":"очень хорошая и понятная","751":"Генератор этот, ну и тогда ходи рассказывай UI-щикам и тестерам, как вызывать твои запросы","752":">>> Nick Pavlov: Джон совсем охренел \nВидно же, что бритоголовый","753":"Тем что без оберток. Этот вот `UUID @@ User` или там `String @@ User` это прям вот настоящие `UUID` и `String`.  То есть если у тебя есть функция которая требует `UUID` тебе не надо будет делать `user.id.uuid`.","754":"а как вкатываться то ? что читать и что смотреть если далек от мира хаскеля ?","755":"А как называется?","756":"почетную грамоту 😊","757":"можно так\nval (left, right) = list.partition(f) \n   left :: tree :: right","758":"Подскажите плиз где я не прав, я увидел только как присобачить функцию вида A => Future[A]","759":"Изначально нацелено не только для внутреннего","760":"И кто ей пользуется?","761":"и пустить элементы в другой, когда закомплитится первый","762":"Ну собственно «ваша лямбда» и будет анонимным классом","763":"Реально, не шутки\n\n```def foo(x: Boolean): Int throws Fail =\n   if x then 1 else raise(Fail())```","764":"сейчас, к несчастью самый прямой путь в тофу - это \n`QVarByMVar(mvar).toAtom.modify(...)`","765":"да","766":"Вот Profunctor идеально впишется","767":"как будто что-то плохое","768":"для абстрактного функтора\n`def memoize[A, S[A]: ???](f: S[A]): S[A] = ???`","769":"@scala_ponv","770":"\/шруг","771":"Так что даже лучше, чем \"не писать на жяве\" может быть","772":"малоли джит както заоптимизировать хочет а мы ему мешаем","773":"там же не написано, что расчитывали на степени 2","774":"тип какой у ids","775":"json сериализатор ))","776":"http:\/\/www.wepa.de\/uploads\/pics\/C-I-10r-Scala_01.jpg\n\n(боян, конечно)","777":"по-моему рассказывали про какую-то ормку","778":"а exclude работает?","779":"Это неверное утверждение","780":"Из коробки нет","781":"ведь после обычного мне надо будет еще структуру в свою переделать, а при потоковом проходе я должен просто \"по пути\" забрать что мне нужно","782":"Нет, качество документации отстой","783":"скорость то линейная","784":"> no-code - это ниша толпы миддлов, которые пишут условно работающие приложения\n\nэто одна позиция, другая - lowcode это ответ на тривиальные и достаточно изученные потребности бизнеса, которые лень велосипедить каждый раз со всеми поворотами","785":"ne","786":"спасибо, интересно","787":"Перезапускать на обновление","788":"Паша, дай-ка, я тебя обниму - раскрыл всю суть....","789":"http:\/\/www.razerzone.com\/ca-en\/gaming-systems\/razer-blade-stealth","790":"Ну и всё, где типы волшебным образом высираются из whitebox","791":"нормальные проекты нужно писать","792":"всё равно то же самое сделаешь","793":"Сейчас буду смотреть байткод.","794":"пройти обучение публично под менторством","795":"Нормальный токсик устроили","796":"если этого не будет - то оно не будет ломать, а значит не подходит(","797":"пут обратно вставляет","798":"`vector should contain theSameElementsAs list`","799":"проще семантика - клиентский код всегда знает, обработан запрос или нет и с каким результатом. при использовани NIO накладные расходы на десятки\/сотни параллельных коннектов невелики","800":"переваривает, мокать надо интерфейс, а не реализацию, а у тебя интерфейса нет 🤷‍♂️","801":"но BranchNode расширяет trait","802":"Или тайпкласс?","803":"Я новичок в скала и интересно услышать мнение людей о правильности использования circe в продакшн? Возможно, лучше избавиться от котов и юзать всем известный джексон или что-то подобное?","804":"в 100% запросов?","805":"Когда надо прояснить вопросы, люди делают две вещи: дают определения, задают вопросы. К которой категории относятся ваши сообщения?","806":"Всем добрый день.\nРешил переползать со scala=better java в сторону fp. Слегка погрузился в котов и tf и столкнулся с проблемой к которой не очень понимаю как подойти.\nЕсть векторы с разной размерностью(например`Vector1D[T]`,`Vector2D[T]`) и разными типами(параметр `T`). Хочется написать алгебру для tf в которой можно будет оперировать векторами разных размерностей и типов. На текущий момент удалось сделать оперирование только разными типами. Вопрос как обобщить еще и на размерность?\n\nСкасти с минималистичной реализацией\nhttps:\/\/scastie.scala-lang.org\/EGGjel2YRIah7ID95cDnkA","807":"translate","808":"F[Ш, Т, О, Ш, _, П, О, С, М, О, Т, Р, И, М]","809":"вот этот как-то давно пользовал, для опенсорса шарить и водить чела по коду удаленно вполне удобно, но не более) выделяешь кусок кода - у него тоже выделяется, болтаете обсуждаете туда сюда гуляете)","810":"http:\/\/www.scala-sbt.org\/1.x\/docs\/Organizing-Build.html\nвот еще","811":"Я вижу отчаяние в глазах людей","812":"Вопрос на ночь глядя.\nА будет ли в Dotty что-нть для деконструкции union types?\nТ. е. какая-нть операция, которая позволяет отщипнуть A из A | B | C и получить B | C ?","813":"тогда Y можно использовать во всех других определениях","814":"Ну собственно я с кроликом и сравниваю","815":"извините, я случайно угадал","816":"парсить сорцы других файлов","817":"изза джигсо описания для хикари","818":"Распространенность больше","819":"Ещё кто за сбт и кто против","820":"ну а альтернатив-то нет толком","821":"видимо в скором времени придется если не будет новой нормальной модели мак бука про","822":"а вообще обычные тесты пишутся для спарк приложений, и юнит и интеграционные, какие пожелаешь","823":"интересно, насколько кашерно юзать rxscala","824":"Всем привет.\n\nУ меня вопрос не совсем по scala, но касается play. Точнее nginx+play.\nСитуация такая, для чистоты эксперимента, беру play start sample, ставлю его за nginx.\nВ nginx настраиваю proxy_pass на play.\nНачинаю тестить через wrk rps. Результаты такие: напрямую play через порт выдает 8к rps, через nginx 1200-1300.\nЕсли просто какую-то статику просить у nginx, специально подкладывал, там 27к-30к rps, вроде бы настроил его правильно.\nВопрос такой - разница 1300 и 8000 rps это нормально? Или я что-то не так делаю?","825":"@nihirash наверн только так и пишет","826":"Если у вас часто - вы что-то не так делаете","827":"кстати о книгах, если кто-то очень хочет скала версию упомянутой книги, и не боится latex, то готовый перевод ждёт вас :)","828":"а вдруг ты json в текстовом редакторе составлял?","829":"Могу тречить этот состав на карте, если стартовую точку дадите","830":"Сам язык сильно колхозный и костыльный, если не прикладывать экстраусилий то и ПО получается таким же","831":"стихи даже, при желании","832":"не за что","833":"фри там катсовые, а копродукты йотовые","834":"апдейты да, не получится, но геты прогреют вместе с собой много чего","835":"Или я что-то перепутал?","836":"по факту оно есть спецификация","837":"Как тот парень? Да. Он 100% умеет говорить по-русски, но лезет с украинским, демонстририруя свою нерусскость. Постсоветский нацонализм русофобский по своей природе. Русофобия меня, как русского, глубоко оскорбляет, примерно как евреев анекдоты про холокост. Другими словами меня глубоко оскопбляет само по себе выражение украинской национальной идентичности.","838":"Неявный.\nТ.е. аккаунт неботовый","839":"не обязательно \"передавать\" опенсорс","840":"акторы - это ад отладки. Откуда-то что-то прилетело, что-то сдохло - разбирайся. Ни стектрейсов нормальных, ни ошибок компиляции. почти undefined is not a function","841":"https:\/\/people.eecs.berkeley.edu\/~sseshia\/219c\/spr16\/lectures\/Frehse_SyDe15.pdf","842":"минимально погонял сервси на java 10 с граалем\\g1 и java8 g1","843":"солвер это хорошо","844":"твитер стек","845":"она как бы вертела чьи-либо изыскания на том, отсутствие чего превращает в SJW","846":"@notxcain а вы делаете какую нибудь nanopass компиляцию со своими фриманатками?","847":"Промышленная разработка это вообще не просто","848":"пока ещё не учу","849":"что это даёт?","850":"передаю в `Consumer.committableSource`\n\n```    val consumerSettings =\n      ConsumerSettings(actorSystem, new StringDeserializer, new StringDeserializer)\n        .withBootstrapServers(kafkaBootstrapServers)\n        .withGroupId(sparkJobResultsConsumerGroup)\n        .withProperty(ConsumerConfig.AUTO_OFFSET_RESET_CONFIG, \"earliest\")```\n\nно всё равно на локалхост лезет","851":"так то да, но можно сделать конструктор, который будет принимать delay","852":"https:\/\/github.com\/clayrat\/rp-with-monix\/blob\/master\/src\/main\/scala\/examples\/ch2\/Twitter.scala","853":"ну да, если нагрузка равномерная - это поможет.","854":"вообще необязательно, даже в веб мире есть хорошая поддержка офлайна с помощью сервис воркеров во многих фреймворках","855":"можно использовать дебиан , например","856":"забор метрик с прилы\nпо сути это push vs pull подход в метриках","857":"И не используй инстансофы, таггеты для того чтобы такого не было. https:\/\/scastie.scala-lang.org\/rudogma\/rnT2xtNASVWaLA6Xp7AKgA\/13","858":"","859":"в scalaz был |@|  или .... @OlegYch_real скажет","860":"Я начал писать в braceless, что-то в этом есть. Но постоянно хочется сделать отступ 4 пробела, а не 2, иначе у вложенных конструкций плохо видно границы.","861":"Тут, думаю, всем понятно","862":"Не пользуюсь стримами и чувствую себя нормально","863":"Сейчас провод в хорошем состоянии, но не работает.  Может конечно защита сработала","864":"Как я догадываюсь субд - ентити, nosql - функциями общаемся","865":"проц один, ядер 4, тесты не форкнуты","866":"тут собес с целью схантить за 5к?)","867":"Чтобы не писать копи миллион раз","868":"def retry[T](attempts: Int) (f: =>T) = { try f catch { e: Exception if attempts > 0 => log(e); retry(attempts - 1(f)) }","869":"универсальностью","870":"[Mikhail](tg:\/\/user?id=28574301) так вот stable они как раз сделали бы ровно то что нужно","871":"Вы Дейли НУРСУЛТАН читаете?","872":"да, я кажется разобрался что тут имелось в виду, спасиб","873":"сейчас у меня 2018.1.1RC","874":"ну значит просто не напоролся. внутри дао обычно один запрос, редко два. а снаружи всё комбинируется котами","875":"мм?","876":"Zio, а не scalaz","877":"напрмиер 10","878":"но цпу-то из-за while (true) семантики","879":"Спасибо","880":"Классическое отношение результат = идея * реализация","881":"взять из пула, и контролировать, что сессию никто не будет запускать из разных тредов","882":"Согласен. Мне в таких случаях ещё пример фортрана и его производительных матлиб нравится. Он до сих пор для своих задач шикарен","883":"да думал есть что то в Traverse тайп классен но ничего не нашел","884":"старайтесь по возможности избегать этого (ц)","885":"У Seq не лист по дефолту?","886":"Feature?","887":"Посоны, а вот в sbt 1.0.1 пытаюсь сделать кросс паблиш,\nпри смене версии он пишет \n\n[info] Setting Scala version to 2.11.11 on 0 projects.\n[info] Switching Scala version on:\n[info] Excluding projects:","888":"проблема не с количеством слоев, а в том, что в одном слое файлы создаются, а в другом - удаляются, что увеличивает размер образа. Если удалений файлов нет, то, имхо, можно не заморачиваться.","889":"почему нельзя эт положить у них?)","890":"Хотспот","891":"можно ника отсюда кикнуть, уже 20 раз тему с аккомонгой обсосали, уже заебал человека гнобить)","892":"А я парюсь","893":"foldM ?","894":"вообще логбек конечно максимальное дерьмо","895":"ленивость - checked\nраспараллеливание - вроде тоже нет проблем, прочитал в буфер, переложил куда надо и запускай себе на воркерах, но как то нахер почти никогда не надо\nтаймауты - вообще не понятно каким боком\nконтекст - чего?","896":"а во сколько подкаст?","897":"народ, а как вы живёте без нормальных докстрингов?","898":"","899":"ну у вас цель какая всего этого?\nя заасьюмил что вы хотите писать поддерживаемый и расширяемый код\nдля этого крайне полезна статическая типизация\nгораздо лучше чем следование определению ООП и следование идеальному ООП коду","900":"joda-time ?","901":"Чел, хватит.","902":"какие например?","903":"полюс гарантия что точно все будет в одном месте","904":"а мне валится ошибка \"Такой документ уже чо то там оплачен или существует\"","905":"до \"полного\" интеропа далеко, плюс свои лимитации, но все же","906":"Например какой-нибудь асинк хттп зио бэкенд","907":"препроцессор сделан для переключения между связками fs2+cats <-> scalaz+scalaz-stream","908":"Или Monad[Resource","909":"Это шутка=)","910":"А есть ещё пул реквесты, кроме этого и синтаксиса в маус, где ты скопипастил тофу?","911":"Мне кажется самая серьезная проблема акторов, это неявная рантайм связность создаваемая пересылкой акторрефов","912":"Вторая группа - это только развивающиеся ЯП, возможно с зависимыми типами","913":"Общение, понв господ","914":"у кого с чем отрицательный опыт?","915":"но если есть проблемы с временем запуска  приложения — вот один из путей","916":"Эээ да","917":"Потому что вот спросил чувак про slick, мы здесь все не очень хорошо относимся к slick, это не секрет. Однако фундаментально ответа на вопрос как правильно контролировать подобные вещи парень не получил","918":"Вы что, до сих пор про Акку? Даже при Москаленко такого не было","919":"вот такой на русском  https:\/\/stepik.org\/course\/%D0%92%D0%B2%D0%B5%D0%B4%D0%B5%D0%BD%D0%B8%D0%B5-%D0%B2-Scala-16243\/","920":"окай, если это такой секрет кто где работает","921":"А ее как-то никто даже не рассматривал :D","922":"Но не обязательное условие, да.","923":"Кто знает, есть ли в kind-projector'е аналог `?` для `F[_]` ?","924":"ну это прочитал-не прочитал. запомнил-не запомнил. ну как бы спрашивать спрашивай, а какие выводы делаешь, это дело другое","925":"That's all folks","926":"можно просто\n```myNonImportantAsyncStuff()\nFuture.succesful(Ok())```","927":"Инмемори какая-то","928":"То ты прав","929":"проговорить другому как ты его понял","930":"хм","931":"Ну я игрался с фаршем, а что?","932":"Спасибо","933":"методом гугления нашёл по первой ссылке)","934":"Именно","935":"тогда это конкретная проблема с деталями, которую надо и озвучивать соответствующе","936":"Спарк 2.12+","937":"у swapped","938":"должно быть попроще","939":"это предтеча ооп","940":"Не видел чтоль jarray, jnumber и вот это все?","941":"зачем Def.setting","942":"у них там фишка что 13ую они указывают и выдают раз в год","943":"этот АПИ позволяет разрабу гарантировать целостность","944":"ребят не подскажете в чем может быть проблема:\n\nесть актор с таким receive:\noverride def receive: Receive = {\n    case TimerMessage =>\n      onTimerTrigger()\n  }\n\nи есть такой тест \n\nval testProbe = TestProbe()\n      val service = serviceWithTimerSupport({})\n      testProbe watch service\n      service.underlyingActor.startTimer()\n      testProbe.expectMsg(1.seconds, TimerMessage)","945":"Кто сможет подсказать, как заставить следующий код работать. У меня тут минималистичный пример с проблемой.\n```{\n  trait D { \n    type X\n  }\n\n  class C(d: D) { \n    def f(x: d.X): Unit = println(x) \n  }\n\n  case class CX1(x: Int)\n\n  object D1 extends D {\n    type X = CX1\n  }\n\n  case class CX2(x: Int)\n\n  object D2 extends D { \n    type X = CX2\n  }\n\n  val x1 = CX1(1)\n\n  val x2 = CX2(2)\n\n  val c1 = new C(D1)\n\n  val c2 = new C(D2)\n\n  c1.f(x1)\n\n  c2.f(x2)\n}```\n\nв repl\n```scala> :pa test.scala\nPasting file test.scala...\ntest.scala:41: error: type mismatch;\n found   : x1.type (with underlying type CX1)\n required: c1.d.X\n  c1.f(x1)\n       ^\ntest.scala:43: error: type mismatch;\n found   : x2.type (with underlying type CX2)\n required: c2.d.X\n  c2.f(x2)\n       ^```","946":"BDD спецификация?","947":"Т.е. не так, что они до какого момента гарантировали совместимость, а потом обыграли всех, как жфрог, и скинули на какое-то не имеющее к ним отношения комьюнити","948":"Эти его гребаные ансейф сеты - брррр","949":"Zookeeper, поддержу. Стабильное решение.","950":"Ну вот почему бы не использовать один энивал для кучи предметных обёрток?","951":"стримы это fs2 vs zstream?","952":"Денис вообще не бумбум в ивентсонсинге, @danicheg подтвердит","953":"а мы до сих пор по лошадиному крупу кладём рельсы","954":"классно, если все работает и не падает, интересно сколько вас код пишет и насколько велик продукт\/продукты","955":"Эт смотря как коммуницировать, принципе можно и без лага","956":"Тогда херня какая то, профайлер в зубы","957":"Ну мы тоже пришли к актору-коллектору. Аски это прям плохо. А реквест-респонс приложения на акторах в целом норм, удобное конкарренси же.","958":"Обычно после этих слов люди пишут rule engine на сорок тысяч строк чтобы запустить на нём три правила 😊","959":"Может проблемы нет.Я только помню что в тот момент когда я его изучал - я зашивался.Не понимал и все тут","960":"я так понимаю в сбт? в классическом репле скалы точно нету `~console`","961":"При этом этот SIP был немедленной - в течение полудня реакцией на предложение создать pre-SIP от человека, который отвечал на то ,что в дотти нельзя теперь делать плагины как bm4, которые могут работать сразу после парсинга","962":"да любой код высокороувневый","963":"https:\/\/github.com\/search?q=asInstanceOf+language%3AScala&type=Code","964":"ну тем-то вообще похрену лишь бы ты после оплаты курса 70% назад принес наликом. Хотя может моя инфа устарела.","965":"да, именно так","966":"я до сих пор ставлю","967":"но работает достойно, я бы даже сказал топово среди прочих","968":"прям в компилятор? не в стд либу или что-то такое","969":"чтобы докер в мезосе не падал","970":"почти никто не избежал паскаля :)","971":"Нужно обновить таблицу набросов","972":"dcos ж, как минимум navstar","973":"Насчёт скриптинга внутри","974":"гоу обсуждать)","975":"аааа, ну так у меня там идет передача заголовков в сам актор при его создании, т.е. он может проверить что пользователь авторизован, но пока как разрулить ситуацию при которой пользователь выходит из аккаунта и при этом сообщает о том что теперь сессия убита актору-пользователю - я пока не очень представляю, впрочем - тут ничего сложного нет, меня больше волнует как понять что актор работает с какой-то конкретной страницы. Отправлять в него данные об этом сразу после его создания мне очень не хочется, как-то не правильно это...","976":"Ну а теперь нужно вспомнить для чего аппликатив","977":"Да ладно, я не успел продолжить.","978":"в play я посмотрел импорты с java. прям хлещут","979":"Особенно интересно, что в дотти будет с тайпклассами, и как потом этот новодел на нее переводить.","980":"квил тоже","981":"И если разные тайп конструкторы","982":"*в 2 раза, clean забыл","983":"ну типа идея в том, что в таск тоже две ошибки","984":"Питон они юзают по другим причинам","985":"остановись человек анекдот","986":"в каком месте он статический?","987":"вот Вадим верит в то, что скаласообщество умеет дружно одновременно поднимать версию","988":"вообще забавный вброс — в супер-типизированной скале основной хлеб (акка) нетипизирована","989":"Потому что это другой подход","990":"Устранение энивалов это уже следующий этап, он очень костыльный","991":"Вместопати","992":"","993":"Которые и не снились скулю)","994":"дебажить ради бомжей смешно","995":"когда вижу it. - постоянно ищу, где определена эта переменная. напротив с \"_\" - никогда не возникало мысли, что кто-то может так переменную назвать","996":"Есть какие-то идеи в чем проблема? Это sbt shell в idea, и вывод русских букв, в терминале все ок выводится, просто перешел вот с emacs\/spacemacs в idea","997":"почему?","998":"не не, у меня правда разрывает сейчас","999":"Думаю, провал в том что:\n1. Ты взял готовое приложение\n2. Ты взял плохо исследованную область для тф\n3. Это (предположительно) первый твой серьёзный проект в тф стиле\n\nЕсли убрать одно любое и скорее всего, всё было бы ок.\nА может просто проснёшься через пару дней с отличной идее и всё и так будет ок"}}