{"text":{"0":"OK mr robot go for hacking","1":"I m  trying to add liquiidty on testnet but gettig failed","2":"to fix that issue for example","3":"Just a little\/big of this year's savings","4":"Hey all \nI took a new initiative to get all blockchain devs on to single platform. \n\nHere you can talk all things related to smart contracts of any chain Ethereum, BSC, Tron etc \n\nAlso we all urge teams members and founders to join because we’re going to create an army of blockchain developers in next few months \n\nLink of the group: https:\/\/discord.gg\/csGjaht9","5":"If you found someone honest please tell me i need also one","6":"TC they have so far","7":"That will allow the owner to disable trading though","8":"Thanks for always helping","9":"String manipulations are expensive, but luckily you have an integer. So just play around with multiply and division to get the parts of the number you need","10":"Hey guys, I'm a Technical Recruiter in Chicago. I have a client looking for strong Blockchain\/Ethereum\/Solidity people to join their team with a background in Javascript and Node. It's permanent and remote! DM me if you want to speak more.","11":"actually it works with an option 'pragma experimental ABIEncoderV2' included in smart contract. and works through web3, but I can't make it work in Remix","12":"https:\/\/www.udemy.com\/course\/ethereum-and-solidity-the-complete-developers-guide\/","13":"go down","14":"\"crypto enthusiasts\" are obsessed with uploading assets to ipfs, although you still can upload shit.png and just change base uri... I'd try to convince your clients that decentralized approach is much easier and cheaper if you need to change metadata regularly","15":"probably better to keep as v,r,s in the contract.. usually comes in as bytes, and need v,r,s to recover signer","16":"","17":"safe trip.","18":"check your constructor . and while deploying choose yes at right corner","19":"can I get some swaps like pancakeswap or there github url","20":"how to copy this smart contract ?","21":"If you keep posting same message it’s spamming. Stop it. No one will help you if you spam.","22":"Freelance when the opportunity arise. Study and learn in the meantime","23":"","24":"https:\/\/goerli.etherscan.io\/tx\/0x90c85bacc71a4f5d1e943be69ff5398003985ffb08d6fd8792c63a2622a252b5","25":"I am really intersted in coding and my dad told me to try and find a group that could help me because he is in construction","26":"Thanks alot","27":"yes","28":"https:\/\/solidity-by-example.org\/super\/","29":"0x000freezygod","30":"and use graphql","31":"Thank you","32":"not true","33":"underpaid dev + auditor","34":"@admin","35":"proof","36":"yes","37":"I mean where i can see the auto liquidity is working from what part i can check? do you know bro?","38":"Just tried setting the gas limit to the max and it worked, thanks!","39":"Any job available for junior Blockchain developer?","40":"the token I'm making right now regulates its own supply within the lp pair based on price setting from external validators, it is also also determined by buys and sells. For it to work users cant be allowed to add liquidity to that specific pair, it regulates its own liquidity, that is what i needed a solution for.","41":"i saw becoswp promoted there last","42":"i meant my question has notyhing to do with this","43":"how can i convert this 0x12a78381c4ea2ae balance into human readable output","44":"Hi","45":"You have any example how to fetch price from pair on frontend?","46":"Sure. I’ll get back to you","47":"Uniswap UI","48":"Hi, I need test eths","49":"https:\/\/t.me\/ethereum_jobs_market","50":"I was thinking of running a sim to check token balances before and after and get token transfer fees. That's how it would work in a backend but I'm not sure that's the accepted practice with frontends too","51":"People keep buying it, now they call it JSTV4 you need V4 to sell a part of V3 and so on 😂","52":"I don't get import hardhat account to metamask in what way ?","53":"what does it mean?","54":"will try tomorrow","55":"ty","56":"Im a newbie too , so corrections would be appreciated","57":"in bsc gas is always charged in BNB?","58":"in the mapping or in the array of your choice, you must enter the addresses","59":"i found a contract what is burning from a allocated wallet 0.5% each time elon tweets","60":"Sure","61":"Yes \nThats right","62":"?","63":"Can't send a dm until we add each other, can you try sending t me first please","64":"Yeah i guess all your imports needs to have the same version. \nI can't even make this work with hardhat. idk how you did it without that.","65":"this compiles and should work","66":"and what params do i pass into this function?","67":"I will study this","68":"But wait. Etherscan has 2 options that we can choose either verify solidity single files or multiple files or even multiple sub-contracts. But, i don't know why there's a problem with bytecode related of constructor arguments.","69":"Bruh you serious?","70":"mandolino","71":"I am not able to share media","72":"🤔","73":"😁 got it","74":"The account I am using is created with the same key as the main account","75":"use the same data type","76":"Anybody want to comment on this? It's an infinite minting flaw a few tokens have been having. Just an FYI","77":"decimals 18 wld place the decimal point after 18numbers from the back","78":"I think something is wrong in my deploy script for .mint(...) call but not sure what part","79":"Oh lol I forgot","80":"Real help not going far","81":"Hi all, does anyone have a recommendation for a multisig ETH wallet?","82":"I sent u to @crypto_developers_win","83":"","84":"in reality, we need to read every line of code slowly and assume that every function is misnamed.  That takes far more time than we typically spend before investing","85":"...ay my bad mate been busy in the physical realm.\nSo you understand that a smart contract is the transaction code that binds two parties interacting during a transfer of ETH or a swap from tokens to ETH?\n\nYou could have a smart contract between a website and ETH wallets if there was an interactive transfer for either a payment for a product or service or a digital asset from your page.\nYou should go to the Ethereum main in page developers section. To develop on the ETH blockchain you need to actually build and deploy directly to it, using their interface and compiler or the only aspect of your site that will be blockchain based or oriented will be the smart contracts which is the digitally binding public view hyper ledger entry like a paper trail so to speak.\n\nLike for example the unity games for mobile which feature SOUL erc20 tokens, they are crypto earning games but they are not hosted on ETH blockchain or ecosystem, the only thing blockchain about these apps as they are not dApps is the smart contract between the site\/game for the SOUL erc20 token swap to ETH.","86":"This is the place to ask questions if it's solidity related, if not, you can send me a dm on other language questions","87":"Lol scam token","88":"","89":"and hardcoded owner address 😢","90":"from where?","91":"If you plan to do this decentralized, my idea would be maybe making an option to mark a result as wrong. And if 51% of both sides vote for that, everyone can claim their bet back plus the bet creator gets some tokens burned or so. Like let's take my example, now all users of B want to punish you, but since A won, noone of A does. However, let's say you enter B as a winner even tho A won. Now you'd have to have some honest A bettors who claim a wrong result and if 51% of the A bets agree on that, all bets get released and you get tokens burned you have to placed up as a security. Something like that.","92":"ah ok","93":"People argue the transfer function does not check if there is enough balance, but why did I think by having the require line of code, things are working fine? Am I missing anything?","94":"That's bs","95":"i am asking becouse someone did","96":"ok then yes this I kew thak you","97":"Link the github","98":"Would try this too, just getting to find out.","99":"It's interesting","100":"I assume diff nodes","101":"it is public, anyone could call it right?","102":"welcome","103":"But exp in general software dev only (ex: web dev) can also be accepted if the profile is more senior","104":"😂😂","105":"perfect, will try it this way here and see if I can make it work in an independent and automated way","106":"There some arguments that arise","107":"We'll other than EOS 😂","108":"i see that there is no actual actions of traders in this token, is it for test purposes?\nand another question, what is KK Migration function that was called a lot?","109":"you are missing some functions compared to the original one","110":"Guys, please!!!!! I need your help!","111":"line 176 etc","112":"@SimonTian666, @WilliamOney.\nThank you)","113":"Hi\nAny one have smart contract call sign function scam token ?","114":"it will just skip the check","115":"Pretty much all you need to know here: https:\/\/docs.openzeppelin.com\/upgrades\/2.8\/writing-upgradeable","116":"Go to etherscan\/bscscan or whatever block explorer for the blockchain you are in and search that address","117":"So they haven't discovered some magic potion","118":"Hello!","119":"If you don't ask it, nobody will help you....","120":"How do i find in the code if a token is nonsellable?","121":"Any nft prokect for beginners please","122":"I might have partially won my war against opensea lol","123":"👍","124":"move, add, sub go to, \n\nwith just these instructions , everything can be done","125":"Solidity","126":"why =","127":"can make new modifier that combines them","128":"I think this problem is related with my  another question technical","129":"and  that should be 3 different tx's \n\n1, 2, then 3-5","130":"@Kevs001","131":"Perhaps this isn't the right forum to debate this, but the way you're talking, you want to validate the product and make money on it, before* you focus on the development.\n\nIn that case why do you need a developer at all and instead why not hire a technical product designer?","132":"So, how we can avoid that kind of market volatility??","133":"there is no function to change","134":"Yup that's the one","135":"Is there a way to simulate buy\/sell without deploying the contract?","136":"@kos_tya99 check pm","137":"(3 + 8) [@jKolJR](tg:\/\/user?id=1994324824), please, send the solution to the arithmetic operation provided within the time amount specified to this group, otherwise you will be kicked. Thank you! (60 sec)\nPowered by [1inch Network](http:\/\/1inch.io\/?utm_source=shieldy_en&utm_medium=cpc&utm_campaign=powered) ([iOS](https:\/\/apps.apple.com\/app\/apple-store\/id1546049391?pt=122481420&ct=shieldy_en&mt=8))","138":"Someone asked me for the same contract.","139":"Any Indian Web3 developer, ready to work for an Indian company, Plz DM.","140":"to stay in this group theres a fire baptism where everyone roasts your code and questions, everyone has passed it here","141":"yep","142":"Sorry, If I try run more one time, there is no issue, But while testing, I faced \"Too large contract code\" issue.","143":"Gotcha","144":"hello","145":"ok","146":"Sometimes it's good to have a second pair of eyes look at it. Or explain it to an inanimate object","147":"right...thanks so much for your help","148":"@emyagkova please I sent you a DM.","149":"it's not an error at all","150":"i was never on test. I directly launched on mainnet","151":"Etherscan doesn't connect a wallet on the view section","152":"Who is David","153":"hmm not sugar granny ?","154":"Time-lock contract","155":"bro fix up the code structure and send it back why tf do u have an if statement that runs and does nothing (the first nested if statement)","156":"What's your use case?","157":"Any Solidity essentials for a smooth brain?","158":"Roger I didn't know lol","159":"Does anyone have experience with balancer v2 vaults?\n\nI am trying to add liqudiity to a vault , but it keeps reverting with an invalid opcode error\n\n```\n bytes32 poolIDOmniUSDCavax = IBasePool(OmniUSDCavax).getPoolId();\n        IVault.JoinPoolRequest memory request;\n        request.assets[0] = IAsset(OmniUSD); \/\/ It reverts here\n        request.assets[1] = IAsset(USDCavax);\n        request.userData = abi.encode([100, 100]);\n        request.fromInternalBalance = false;```","160":"ok. ty","161":"Tried a simple one, what's wrong here?","162":"probably accesses the blockchain","163":"I have a similar feeling, the author won't properly explain things properly for other's creating confusions as well.","164":"See WHAT  have you got","165":"it worked! Amazing!","166":"you mean a new token?","167":"is it me or is that server dead slow","168":"copy.","169":"Is my pleasure to join these amiable group","170":"anyone know if BSC gets tempermental at times? Its taking me 5 minute to do a transaction","171":"https:\/\/uniswap.org\/whitepaper.pdf","172":"oh you know what I think PCS isnt configured for test net like Uniswap is, actually","173":"Alright, my bad then.","174":"I'm writing a staking contract for 1155. But if user has any nft of another 721, then he'll get extra 10% of tokens.\nNow I'm just thinking what would I do if another contract was 1155, because I can't call bonusContract.balanceOf(address), as I need to pass any id.","175":"someone just transferred tokens into a different wallet and there was a huge dump \n\nhttps:\/\/etherscan.io\/tx\/0x021ce1f060605384f1af8ae7aa7afb785a925de154f2a8f5e39c71cdc0bad481","176":"then check burn() function from erc20","177":"Hello, my name is Cameron and I am reaching out for someone to hopefully point me towards the right direction. Right now I market for crypto projects and companies around the world. I am trying to actually get a real job under a larger company. Should I spend time learning solidity and trying to find a job with that?","178":"+1. And if you are confident, go for ecma rather than vanilla Js","179":"yes?","180":"","181":"I'm looking for dev UI PART","182":"yea bru just had a retarded moment","183":"Feel free to ask questions about OpenZeppelin Contracts in the community forum: https:\/\/forum.openzeppelin.com\/","184":"hard to say without seeing the contract code","185":"you're absolutely right, mb","186":"Newbie question: Can someone help me understand this line of code? bool public mintingFunction = false","187":"the stake contract was broken, so I would have to fix the bugs and create a erc20 contract and deploy both on testnet just to see if the functions ware connected properly, he refused to give me the testnet address and abi for some reason","188":"Not on my pc rn, so i can't easily tell","189":"You want `abi.encodeWithSelector()` there","190":"I've deployed in ropsten just forks","191":"I was thinking it could work as u do with making tokens in to eth for \"charity wallets\" etc","192":"Thx","193":"Thanks!","194":"Okay, I get this. Would make more research.","195":"It is a bit unclear and don't send it to all the chats","196":"💪🏻","197":"You can use address(this)","198":"But logic contract doesn't hold any state","199":"Was expecting the gas fee to be no higher than a typical swap fee","200":"Who can make dapps? Pm me","201":"only if they subtract more than the specified number of tokens from the uniswap pool contract's balance, would the pool contract revert the tx","202":"That's what she said","203":"when metamask pops up","204":"Position: smartcontract ERC-20 experienced developer, audit and review, cryptocurrency technical consulting, JavaScript junior, experienced customer support service and marketing.\n\nI am a developer of   ERC-20 smartcontracts and provide audit services for smartcontracts written in Pragma Solidity language.\n\nAs a technical consultant in cryptocurrency system technologies and experienced in deals with partners in the cryptocurrency sphere, I have the experience in working with blockchains and cryptocurrency sphere since 2014.\n\n I have profound knowledge about the structure of blockchains, the mechanisms of operations and used  cryptography principles.\n\nExperience in commercial  creating smartcontracts for Ethereum using ERC-20 standard, auditing  existing smartcontracts and supported ICO projects since the summer of 2017. Comprehensive counseling.\nLanguages: English, Russian, Belarusian.\n\nI have the huge experience working with small start-ups, mainly from India and Vietnam. The truth is often I do not even know their websites. In my memory is only goldunioncoins.com, which is active until now.\n\n  The project venusenergy.io also uses the smartcontract that I wrote for them, token Venus is traded on the exchange kuna.io, and even Venus project is put up for sale now for 300'000 $.\n\nAlso, I can mention addtoken.io so as  I had  been done some work for that project.\n\nThe job I really proud,  is completely from scratch I developed a smartcontract for accruefrom.com bank project.","205":"Why not try a normal script. See if that works","206":"Hi Alexander, why should deleting be impossible?\n\ndelete array[index];\n\nSee https:\/\/ethereum.stackexchange.com\/questions\/1527\/how-to-delete-an-element-at-a-certain-index-in-an-array","207":"Hey, why are sandwiches MeV increasing on mainnet the last 6 month?","208":"yeah, first google the topic or even ask chat gpt about the topic in the youtube video","209":"If the contract is on tronscan, you can extract the interface from ABI","210":"@peachdefi here's the grp link. \nAdmin can delete it if it's against the rules","211":"Thanks","212":"I'm not the dev but, I'm told that whitelisting one wallet could potentially whitelist all. This didn't make sense and that's why I'm asking here","213":"as soon as the tx is mined","214":"Thank you so much! means a lot","215":"Thank you for your recommendation, can I ask one more question","216":"On rugdoc when it says “Xmas Past fork” on a project how do they know? I can’t find these projects on GitHub","217":"it is used to take tokens oit of the contract","218":"ye i wish he had metamask that shit so fast","219":"yes you just need to get free eth from faucet (google it)","220":"seems good to go, check the start\/end block and ensure there are events emitted in those","221":"Hi, i’am stuck in a HDwallet i’am trying to send a smart-contract transaction with Web3, token have 8 decimals so when i try to get the balance i’am getting the balance with balanceOf 412.583828125 it’s 9 decimals why i don’t get 8 decimals ? now i’am trying to convert toWei for sending the transaction","222":"Anything that can interact with the Ethereum network. You're most likely looking for a Web3 implementation to do this. We're talking about making the call from outside, right?","223":"I don't know much maybe the admin can help with that","224":"do any other provider methods work? sounds like some kind of other issue\n\ntry getBalance, getNetwork,","225":"do you know where can i find the factory adresses of dex ?","226":"Never ever 🤡","227":"https:\/\/medium.com\/coinmonks\/solidity-storage-vs-memory-vs-calldata-8c7e8c38bce","228":"Enable optimizations","229":"anyone?","230":"that's the best way to get in troubles later","231":"you can find a job in blockchain development","232":"typically right-shift (>>) and bitwise-and (&)","233":"DONT DO RANDOMNESS ON CHAIN","234":"Guys. Who hasn't subscribed yet, check it out 🔥🔥🔥. It is our channel w\/ resources\nhttps:\/\/t.me\/soliditypedia","235":"Can u dm me","236":"Hi","237":"each fork is different than the other, the release notes should mention the EVM version","238":"but rinkeby is the best either way","239":"Sorry I didn’t get you","240":"","241":"Bsc testnet does that sometimes. I’d check the last block mined on the homepage sometimes it stops for a while","242":"Hyperledger in collaboration with Ledger Academy hosts a 4 part Series that answers the question, Where does my piece fit into the blockchain employment puzzle? Whether you're thinking of opportunities for a career in blockchain or need to find qualified applicants for new positions, this series is right for you.\n\nTo register please visit: https:\/\/www.meetup.com\/Hyperledger-Princeton\/events\/279128790\/","243":"there was an NFT collection with only 10 legendary, randomly picked on reveal but the system had that \"random\" selection of the tokenId.\n\nOne of the variables is msg.sender and so you can manipulate it","244":"I usually work for a project","245":"I didn't mean scam. I mean shitcoin as a meme coin that people know there is no tech, only hype and speculation","246":"please  could you write a piece of code","247":"send me your wallet, i can sent you 1 gETH","248":"I see what?","249":"web 1","250":"many early small projects have a dev chat.  Unresolved problems, vulnerabilities etc","251":"show me your remix deploy page","252":"I’d look at graphql and bitquery. Easy way to get started depending on how real time you need it","253":"I did dm  to you, check it","254":"yes they are dependent on the 1st transaction. \nIf it fails then all of them will fail.","255":"First use both of them","256":"I just used infura, but need testnet eth and nie found out even the faucet is down","257":"yes","258":"Basically, traditional banking focus ofc all they efforts on trying to assure lowest % of default. Let’s not make this the main point when it comes to defi lending","259":"Hi everyone I've been looking for away to access this data through mapping key and value structure.\n\nHere's the architecture:\n\nStruct Person {\n  string name;\n  uint age;\n  bool checkedIn;\n}\n\nPerson[] public peoole;\n\nMapping(address => Person) public  addressToPerson;\n\nSo after pushing Struct array, I can't find a way to use address of sender (msg.sender) to access the Struct data.","260":"But I can't figure out how much is it correct","261":"","262":"Oh","263":"someone can help me with uniswap sdk in js ?","264":"wrongrouter","265":"","266":"maybe, I tried to flatten and plug into remix","267":"familiar with proxy contracts and hardhat?","268":"Btw you probably need a nonce tracker rather than mutex","269":"Hello everyone. If you need an experienced community manager for your Crypto project, you can reach out to me.","270":"Hello..\nI wanna start learning the solidity.. so what courses do you suggest to me as a beginner?\nAnd is there any suggestions to help me more for this?","271":"No","272":"NFT Marketplace Developer should DM me","273":"Hey guys, anyone know of a reflection token without security or any kind of issues for me to review how reflection tokens work?\n\nIt's troublesome to find one and be sure it is not corrupted","274":"no so that is the contract I forked off of. I just copy and pasted the contract and changed the name","275":"hi, is there an array method like array.includes()? I guess no? how to check if arrays includes a value? thank you\n\nwithout a loop","276":"It can directly be done by web3.js utils function","277":"yeah uint 8 is 127","278":"let me give that a try","279":"You can monitor the mempool for txs from your desired address and copy it as soon as you catch it","280":"initially he said that, but he isn't sure","281":"There is some code snippet to be added code in code to remove the BNBs stuck in the contract contract? Those BNB not deposited directly at the contract address...","282":"Only owner can make that","283":"okok, thats what I thought","284":"Yeah that's what I'm doing currently.. But it's just.. horrible. Like, isn't there at least a tool somewhere to convert my input into the required hexdata?","285":"Or you can pay for one in \/job chat \nOtherwise find one similar and copy paste and hope that nothing breaks","286":"hello, I created a token to practice but I can’t withdraw my liquidity. anyone have an idea? the name of the token is «TEUHG»","287":"You can interact with the pool through pair contract. \nFast depends on gwei you pay buddy","288":"anyone can help me to read private mapping variable in solidity using web3.js?","289":"6711 members ready to take your orders","290":"thanks, sorry for duplicate","291":"It’s not a problem with truffle but npm","292":"did you fix the other things I tokd you?","293":"I came to solidity after checked math was introduced and I like to rewrite code to get rid of safemath when i copy anything)","294":"keys are generated client side, stop spreading misinformation\/fud","295":"Yeah mate. Here now","296":"I don't think so, forked network is also a part of network, it requires to pay gas fees","297":"Getting this error while trying to remove LP from PCS V2 router using a python script\n\nExtraDataLengthError: The field extraData is 280 bytes, but should be 32. It is quite likely that you are connected to a POA chain. Refer to http:\/\/web3py.readthedocs.io\/en\/stable\/middleware.html#geth-style-proof-of-authority for more details.\n\n\nPython Script\nhttps:\/\/pastebin.com\/N8dYBVFY","298":"@grimreaper619 dm","299":"No, it allows it to go through","300":"I really think it's best if you publish.  Then I don't have to guess what version of the code pertains to whichever transaction.","301":"How its works? Or what do you mean mr.?","302":"It depends on the cro price then","303":"That's not the purpose of a proxy","304":"At least if you're using infura","305":"you are thinking or asking us to think ?","306":"Thanks!! For the answers! I usually do the case B but I want to have better understanding of that! Thanks to all and will check that link Grim!","307":"yes","308":"Because it costs almost 100 times more gas if, by misfortune, that user happens to make the transaction that reaches the trehsold","309":"Why revertedWith can be not working on hardhat?","310":"","311":"https:\/\/www.typescriptlang.org\/docs\/handbook\/intro.html","312":"Guys ! I'm need smart contract creator","313":"vyper optimized to be nearly as efficient as huff","314":"The node operator use a server, and he pay for that the node that is confirming your transacfion needs to be funded, the node operator is not a ghost so death is inevitable and if this happen who will fund the oracle account and pay the server fee.\njust my own point.\n\nThat most of all are hardcoded doesnt seem to be a valid point.","315":"Hello, I am looking for a graphic designer who can also do PixelArts for an NFT project, if someone is interested to write to me privately, the payment would be made in cryptocurrencies (to choose), if you are interested or know someone who is interested, would be of great help.","316":"Create a list of fresh deployed contracts, keep it in the list for x amount of time, after x amount of time, check its verification status and keep\/remove it from list according to the result","317":"A problem?","318":"@all can you check with this issue","319":"google","320":"read the code","321":"Use block.timestamp I think it works","322":"Hey!! Is anyone interested in participating in a hackathon on solidity\/blockchain??","323":"","324":"check here https:\/\/docs.uniswap.org\/contracts\/v2\/reference\/smart-contracts\/router-02","325":"Thank you so much","326":"Did anyone know solana smart contract?","327":"Check calc. properly","328":"do you have the token address?","329":"Your question isnt clear","330":"Dont worry i apreciate your help 😁👍","331":"No","332":"Just use another mev protected chain","333":"yeah thats my problem you guys nailed in this cover lmao","334":"anyone know why:","335":"Try this","336":"What link?","337":"You cannot specify that in a transaction","338":"What's wrong with this fallback function?","339":"Hi everybody \nI'm programmer telegram bot, \nIn this group someone need bot api or cli? \n**Contact me : pv** 🤝","340":"Where I can see example","341":"What???","342":"means call the approve from function within the same parent function? I'm not too sure tho","343":"Interface IERC20{}\n\nThen it is \nIERC20(Yourerc20adress).methodname","344":"Um. Aha.","345":"human","346":"hi i am 7 y old eth dev with 10 years exp nice to meet u","347":"h = new b.a.providers.JsonRpcProvider(\"https:\/\/data-seed-prebsc-1-s1.binance.org:8545\"),","348":"Hey, I want to setup a fee of 2.5%. I don’t have a fee divisor. How to set it up?","349":"I have a question for you or anyone that knows. I use an android phone with trust wallet and metamask. Is it possible to get my crypto stolen via APKs or some other kind of malware?","350":"I have a good idea and i want to transform it into defi project.\nIs there a good course about solidity?","351":"interesting.\npaste the code snippet here, if you want to help debug","352":"@FreezyDev Do you know how this scam wallet works?🤔 \nThese scammers sent the private of their wallet with some assets (here $500 usdt trc20) to groups and many \nfalls for this scam as they try to sent trx to that wallet address for gas fees. Just after receiving the TRX it'll get automatically sent to other wallet address. So its impossible for anyone to withdraw that USDT (which is the bait here). How does it work does anyone know?🤔","353":"lol","354":"Cool, thanks for your reply mate","355":"-","356":"of course, most token contracts do this using a mapping for account balances.  You could also store the addresses in an array if you need to.","357":"look this one shows 0 transfers 0 holders and some supply minted","358":"🤦🏻‍♂🤦🏻‍♂","359":"Hey @tyler1111  I have a doubt. I still couldn't get my head around this . \nWhy there is a need to mention \"memory\/storage\" location in function parameters for array, string etc ?","360":"Solidity by example \nCryptozombies \nHardhat docs","361":"yeah man","362":"Can we identify if a particular contract address is nft or a erc20 token inside smart contract","363":"nhandledPromiseRejectionWarning: Error: Hardfork with name function () {\n        return this._hardfork;","364":"JS does some weird things but all the words are perfectly standard","365":"I guess it is gonna work","366":"Hi \nI want a source code of crypto exchange \nAnyone can help me?","367":"Dm","368":"Do you mean a different Ethereum testnet? Then you just choose a different provider and deploy the same code there","369":"On pancakeswap you give allowance to the router only","370":"If you are looking for a job or you have a job offer use @ethereum_jobs_market.","371":"Even the migrations are confusing","372":"we need good business. we just got scammed by he said he is dapp dev","373":"Node js","374":"Let apes look for another concept","375":"Use OpenZeppelin Defender.","376":"There is no technical writeup for reflect, as far as I know.","377":"router address","378":"Can i paste the code here?","379":"Great news that Electra Protocol is introducing public Solidity smart contracts in less than half a year. Totally new uses cases will come along. #datamoney #zerogasfees #nearrealtime #blockchain https:\/\/research.binance.com\/en\/projects\/electra 🔥🔥🔥","380":"pls ban this","381":"😂😂😂😂😂😂😂😂","382":"Id recommend learning how storage is laid out for a smart contract as a starting point","383":"just frend and learning no other purpose","384":"it gives you coin 0 and coin 1","385":"they can, they control the nodes","386":"make sense","387":"Paste the content, ctrl-x y enter","388":"@etherboiiiiiiiiiiii","389":"I'll help","390":"it gives: functools.partial(<function call_contract_function at 0x....>, <web3.contract.Contract object at 0x000..>, name' , etc.","391":"😂😂","392":"Just wanted to ask about the experience and how latest the contents are","393":"As this options are not used often, anywaay...😅","394":"let ERC20Funcsigs = \"0xc9567bf9\" || \"0x293230b8\" || \"0xfcfff16f\" || \"0xd543dbeb\" || \"0x01339c21\" || \"0x8a8c523c\"","395":"git clone sushiswap.git xD","396":"systems like ERC223 has been made specifically to \"resolve\" that allowance system, but that's the ERC20","397":"web3.eth.getBlockNumber().then(async function(_block) {\n    console.log(_block)\n})","398":"👍👍","399":"It’s not dead… yet","400":"Will check them out, Thx. Idk meme tokens do work IMHO.","401":"do you know how to use ethers or hardhat?","402":"I mean how to use it in program to automatically check transactions","403":"yes, building similar","404":"I legitimately only know the basics of coding, and it would take too long for my tastes to learn an entire language","405":"shared fork","406":"@leendertsmulder","407":"Early adopters via mining","408":"Oh the last time i used it, doesn't take much time, i uploaded about 40+GB files.","409":"Hi, I need some  intermediate\/ advance level  problem statements to practise solidity, if you have any can you please DM me the document or suggest any website.\n\nDisclaimer: I have solved ethernaut already","410":"I shared all the details in pm","411":"it's too expensive","412":"looking for something that will play nice with the optimizer, so assuming that the bytecode offsets can't be known ahead of time, so i need the compiler to give it to me","413":"Go to offtop","414":"Anyone here who can integrate tron script with the codeigniter app ?","415":"Ok, good luck","416":"It is group for solidity devs 😂","417":"u need to learn gas optimization","418":"I wanna make a platform to make the trace of products through a couple of entities to guarrantee the origin of the products","419":"can someone still help me","420":"isnt nonce related to tx, not account?","421":"Yes... But thats weird how do I set first the price of the private... I dont have info here","422":"Then you probably need to do some config on contract level itself. If a user is capable of interacting with contract directly, chances are he will be able to automate it as well","423":"show me the if version","424":"All you need is there","425":"but that wont hold true as many are honeypots and others rugpull","426":"Hi guys, I am reading about upgradeable contracts right now - https:\/\/medium.com\/rocket-pool\/upgradable-solidity-contract-design-54789205276d. \n\nAnd there the author basically says that there's a set of contracts which communicate with each other with the addresses for each of the other contracts specified softly, not hard coded, right? \n\nSo, the author says that it's a good practice because otherwise there can be bad consequence. \n\nMy question is like this: \n1) Doesn't it mean that the dapp is mutable in this way? Because dev can easily make changes to the contracts - either based on good motives or bad ones?","427":"I'm getting this error in solidity 0.8.11","428":"on remix","429":"pancakeswap contract same i can say","430":"did you already complete cryptozombies?","431":"you should not even open VSCode for 50$","432":"Trufflesuite, nodejs","433":"stupid question\ndid somoene tried from bsc scan?","434":"https:\/\/twitter.com\/HardhatHQ\/status\/1465408316365053955","435":"Then where do I start, I’m ready to learn.","436":"I think you need to replace the @ imports with the https from github","437":"maybe fee? if so it got left in pair contract","438":"If you can, i recommend Steganography mode of encrypting your private data.","439":"What's in your console?","440":"Glad to see someone actually programming in here...","441":"check your dm pls 😅","442":"Do I need to add +18 decimals 0 when doing an airdrop","443":"hi. somebody have problem with install canvas","444":"Check constructor arguments: If the UniswapV2Pair contract constructor requires any specific arguments,\n\nDouble-check the router address: Ensure that the router address you are using is correct and corresponds to the Uniswap V2 router contract on the Ethereum Mainnet. Any mistake in the address can cause the contract creation to fail.\n\nAlso check if you have enough gas fee","445":"https:\/\/cryptozombies.io\/","446":"you say 9 \/ 9","447":"but I may be wrong","448":"can help you with that","449":"helllo","450":"Any programming experience can help but starts with Object Oriented Programming language like Java or C++","451":"Hey, a good NFT Fi Protocol needs help with this, is anyone interested?","452":"trying to mint a ERC721 token","453":"I never used dxsale on bsc testnet so I don't know if it support it","454":"for example i assigh  serial numbers 1 to 1000 to each ticket. And i get a random number 1 to 1000  using chainlink VRF and decide the winner. Is this safe?","455":"","456":"creation of erc20 token and  integration with DApp","457":"hi","458":"Take a look at the color_auto string","459":"If it's something I can help with :l","460":"Hello guys","461":"Guess I'll go for 5TB then","462":"I am a senior solidity\/smart contract developer and I can provide you with an immediate full time availability in US time zone.\nMy resume: https:\/\/docs.google.com\/document\/d\/1b2UTPrkJJrNrs3epiMGP51LVF5y6k7R8SZDGsHkDkyk\/edit\nGithub: https:\/\/github.com\/voyager-gold\nThank you.","463":"i tried it on other tokens it works flawlessly","464":"but I want to be that address","465":"guys what is the best environment today? i heard hardhat is the most advanced, is that true?","466":"ask if you specific questions but I can't help you with \"everything\". You should also google for some recent tutorials, there are plenty of those out there","467":"no reason just testing","468":"So instead of putting it up as swap, how do you check for how much you'll receive if you swapped?","469":"hahahah i love this","470":"I have a question regarding adding addresses to send transaction fees if anyone’s willing to help, you can dm too if you’d like","471":"Hello to all scammers 👋👋👋","472":"I am not sure about that. Yes, I know","473":"could any solidity dev help me with this simple question? https:\/\/ethereum.stackexchange.com\/questions\/99983\/call-swapexactethfortokens-from-contract-and-pay-with-contract-balance ty (upvote helps too ^^)","474":"Yes :D","475":"No compile is allowed.","476":"Its not working properly so it not right, nor did the image attach to teh symbol... But again im a novice.","477":"0x98b9a27528e8d3854250cf12ce181c894ac2fa1fef80aa4252d6170219398e3b","478":"can it be done through etherscan?","479":"True","480":"Hey, guys. I need to write a smart-contract, where users make a bet on some event and after a while outcome is announced and winners get percentage of total bank.\n\nDoes anybody know smart-contracts I can take as a reference?","481":"I have started earlier from some youtube tutorials but won't work out well","482":"Oh reflected tax are already based on holdings?","483":"Ok I should go verify on bscan?","484":"You shouldnt 😂 this is the way","485":"Anyway I remember one codebase using uint8 instead of bool and surprisingly it spends less gas.","486":"I need a developer who can develop an smart contract","487":"there was a split between empty messages \/ non-empty  messages with valid targets and those with no valid targets","488":"Me , got all my positions out because the red market haha","489":"Hey! Thanks a lot for checking it out! On my way to the office now, will look soon! 🙏🏼","490":"copy and paste people","491":"@karola96 what themes you use in visual studio code? Once you mentioned one but can’t find the message","492":"?","493":"So instead of using Merkel tree proofs, the developer decided to hardcode huge amount of addresses in contract","494":"What's the usecase of ur contract ?","495":"you need 2 things:\n1. approve your contract to spend your busd\n\n2. use transferFrom","496":"Abi is to interact with contracts from javascript","497":"I used its interface.","498":"it's not super easy.. they gotta know to use typeof and !=== 'undefined'","499":"https:\/\/docs.chain.link\/?_ga=2.129877839.256405140.1624919241-1438439555.1610452990","500":"Hey guys, anyone have experience with kadena pact solidity? Is it alot harder than remix or what networks are worth looking into other than bsc and eth? In particular id like to create an nft market place with a very specific use case but low gas fees and a few other criteria.","501":"Hi people, I am developing a marketplace with auction, and I have everything in one contract.\nI want to modularize it in at least 2 contracts, researching I have seen some examples made with erc721 contracts in the main contract and then an erc71holder in the secondary contract where the latter is passed the address of the former.\nNow, is this approach correct?\nany other option or article that explains a bit more?\n\nthanks","502":"How can i restrict it?","503":"and just went to test I can’t purchase more of the token?","504":"still issue","505":"All right but what this has to do with the keyword PAYABLE???","506":"Where to get an example","507":"Any react mint sites u guys could send me to checkout?","508":"Its about a hash trx?","509":"i'm not working with a contract","510":"Guys","511":"https:\/\/soliditydeveloper.com\/eip-2535\/","512":"Ok","513":"heuristics, looking fo sertain opcodes in contract bytecode","514":"but people treating a group like an alternative to a google search just brings the quality down imho","515":"For pancake tokens with slippage is it better to use swapExactETHforTokens or swapExactTokensForETHSupportingFeeOnTransferTokens if amountOutMin is equal to 0? In this way I will not get much higher slippage rate than token have ? For example token set slippage 7% and I will be charged 15% ? What is the best function and slippage settings to buy tokens on bsc with slippage? Thank you","516":"Are you deploying locally or to a testnet?","517":"i guess i was trying to see if the mainnet apps would still work in my fork. I can spin up an empty instance no problem, but i wanted to write 'combo' type of contracts which interact with various mainnet protocols (testing flashloans, margin trades, etc)\n\nWhen i navigate to existing mainnet apps with my forked ganache as the server in metamask, my usage is very limited and seems to lock up on sites that makes a lot of eth_call commands.","518":"How does it even operate?\nIs my wallet at risk?","519":"Lmao","520":"😞","521":"Let me get that data one sec, so you can see what I mean","522":"what do you mean","523":"Enough with this airdrop bs","524":"Is it only ether or also tokens that need to be saved?","525":"tx fees","526":"I suggest Hashex btw for good audits","527":"Yes","528":"Hi there","529":"99% of the time","530":"On etherscan or on the wallet","531":"it works on mainnet","532":"I’m still on my phone but are you sure your functions are pushing something into mapping, because as I see the code it looks like you are pulling From mapping into memory to fill it up and then it closes the function so in this case it’s not saving the object to storage but only to memory (x)","533":"desperate attempts to try and resolve it to be honest. \n\ntried this from the guides also and couldnt get it to work...","534":"You can check for the ChainID BSC for example has 56, ETH has 1","535":"send me your art in pm, not here","536":"I don't see any possible route for the scam","537":"Thanks, mate appreciated, guess I'm just bored of relying on bnb and would like to make our cap a little more exciting heh, will dm appreciated","538":"So you dont use loops","539":"try to use `_transfer(...)`","540":"0), \"ERC20: transfer to the zero address\");\n        require(amount > 0, \"Transfer amount must be greater than zero\");\n        if(from != owner() && to != owner())\n            require(amount <= _maxTxAmount, \"Transfer amount exceeds the maxTxAmount.\");\n\n        \/\/ is the token balance of this contract address over the min number of\n        \/\/ tokens that we need to initiate a swap + liquidity lock?\n        \/\/ also, don't get caught in a circular liquidity event.\n        \/\/ also, don't swap & liquify if sender is uniswap pair.\n        uint256 contractTokenBalance = balanceOf(address(this));\n        \n        if(contractTokenBalance >= _maxTxAmount)\n        {\n            contractTokenBalance = _maxTxAmount;\n        }\n        \n        bool overMinTokenBalance = contractTokenBalance >= numTokensSellToAddToLiquidity;\n        if (\n            overMinTokenBalance &&\n            !inSwapAndLiquify &&\n            from != uniswapV2Pair &&\n            swapAndLiquifyEnabled\n        ) {\n            contractTokenBalance = numTokensSellToAddToLiquidity;\n            \/\/add liquidity\n            swapAndLiquify(contractTokenBalance);\n        }\n        \n        \/\/indicates if fee should be deducted from transfer\n        bool takeFee = true;\n        \n        \/\/if any account belongs to _isExcludedFromFee account then remove the fee\n        if(_isExcludedFromFee[from] || _isExcludedFromFee[to]){\n            takeFee = false;\n        }\n        \n        \/\/transfer amount, it will take tax, burn, liquidity fee\n        _tokenTransfer(from,to,amount,takeFee);\n    }\n\n    function swapAndLiquify(uint256 contractTokenBalance) private lockTheSwap {\n        \/\/ split the contract balance into halves\n        uint256 half = contractTokenBalance.div(2);\n        uint256 otherHalf = contractTokenBalance.sub(half);\n\n        \/\/ capture the contract's current ETH balance.\n        \/\/ this is so that we can capture exactly the amount of ETH that the\n        \/\/ swap creates, and not make the liquidity event include any ETH that\n        \/\/ has been manually sent to the contract\n        uint256 initialBalance = address(this).balance;\n\n        \/\/ swap tokens for ETH\n        swapTokensForEth(half); \/\/ <- this breaks the ETH -> HATE swap when swap+liquify is triggered\n\n        \/\/ how much ETH did we just swap into?\n        uint256 newBalance = address(this).balance.sub(initialBalance);\n\n        \/\/ add liquidity to uniswap\n        addLiquidity(otherHalf, newBalance);\n        \n        emit SwapAndLiquify(half, newBalance, otherHalf);\n    }\n\n    function swapTokensForEth(uint256 tokenAmount) private {\n        \/\/ generate the uniswap pair path of token -> weth\n        address[] memory path = new address[](2);\n        path[0] = address(this);\n        path[1] = uniswapV2Router.WETH();\n\n        _approve(address(this), address(uniswapV2Router), tokenAmount);\n\n        \/\/ make the swap\n        uniswapV2Router.swapExactTokensForETHSupportingFeeOnTransferTokens(\n            tokenAmount,\n            0, \/\/ accept any amount of ETH\n            path,\n            address(this),\n            block.timestamp\n        );\n    }\n\n    function addLiquidity(uint256 tokenAmount, uint256 ethAmount) private {\n        \/\/ approve token transfer to cover all possible scenarios\n        _approve(address(this), address(uniswapV2Router), tokenAmount);\n\n        \/\/ add the liquidity\n        uniswapV2Router.addLiquidityETH{value: ethAmount}(\n            address(this),\n            tokenAmount,\n            0, \/\/ slippage is unavoidable\n            0, \/\/ slippage is unavoidable\n            owner(),\n            block.timestamp\n        );\n    }\n\n    \/\/this method is responsible for taking all fee, if takeFee is true\n    function _tokenTransfer(address sender, address recipient, uint256 amount,bool takeFee) private {\n        if(!takeFee)\n            removeAllFee();\n        \n        if (_isExcluded[sender] && !_isExcluded[recipient]) {\n            _transferFromExcluded(sender, recipient, amount);\n        } else if (!_isExcluded[sender] && _isExcluded[recipient]) {\n            _transferToExcluded(sender, recipient, amo","541":"I want to add a some functions to my Contract Address","542":"https:\/\/ethereum.stackexchange.com\/questions\/32145\/how-to-specify-which-wallet-address-to-deploy-contract-with","543":"wew hunyput  😂","544":"Increased karma by [Pablo Cryptobar](tg:\/\/user?id=447361249) (**+1**). Current karma: **1**.","545":".","546":"Would appreciate if you share any links on this","547":"may be is there any on-chain services for this? like a chainlink","548":"Hello","549":"i know solidity but the question was js","550":"probably 😂","551":"","552":"ty","553":"Usually the first or second","554":"Hey guys I need an estimation of how much does it cost for building this project \n\n\nNft projects –\n\nRequirements\n\n1) Token\n2) Website( logo, project pitchdeck)\n3) Marketplace\n4) Nft launchpad\n5) Nft staking\n6) Nft lending\n\nAny one","555":"https:\/\/www.4byte.directory\/","556":"Hi guys","557":"`{\n  \"description\": \"Friendly OpenSea Creature that enjoys long swims in the ocean.\", \n  \"external_url\": \"https:\/\/openseacreatures.io\/3\", \n  \"image\": \"ipfs:\/\/some-weird-content-id\/3.jpg\", \n  \"name\": \"Dave Starbelly\",\n  \"attributes\": [ ... ], \n}`","558":"","559":"that tornado fudder guy hires others to shill his channel","560":"Wow sucks...","561":"Hello, seeking for a web3 minter webpage for nfts, if you can get the job done, dm me your price","562":"Enable optimizations on compiler :)","563":"I starting learning python from a year from now, was just thinking why lot of tutorial are for JavaScript but not that much for python","564":"I worked with javascript before,  so mapping is key value stuff, that makes me believe it has a direct reference to that struct. I just want someone to confirm","565":"Mmmh ok, now I will study this case. Thank you so much!🤠","566":"no","567":"you should share the link","568":"Lets help this fellow out)))","569":"","570":"Yes","571":"thank you everyone","572":"I can't check now I am driving","573":"https:\/\/cryptozombies.io best one imho o\/","574":"Click on name. If you have common groups it'll show","575":"You can get the exchange rate of a token pair. So if you are paired against a USD token then you can get a price. Otherwise you can get the exchange rate of whatever you are paired against. \nhttps:\/\/ethereum.stackexchange.com\/questions\/91441\/how-can-you-get-the-price-of-token-on-uniswap-using-solidity\/94173","576":"yes @letsgetrekt I want everybody see the solidity code. How I verified my contract in order to be available for everyone to see as a solidity code?","577":"Hi, how can I hide the function input or create an unreadable way?","578":"Only slight changes would be needed in the solution I'm looking for","579":"I won't comment lol","580":"But it stopped working for some reason @bondcoder","581":"What sort of corruption?","582":"was not checked, and I didn't find a solution that solved my problem","583":"Buddy, does it also work for .s.sol?","584":"That’s the thing, it has no liquidity so it’s expected to revert but I want to catch it.","585":"did this","586":"text net erc?","587":"I want to compare the gas fee as my contract is taking around 100$ for transactions😶","588":"and you'll pay gas","589":"ChainId required for TransactionType 0X02 EIP1559","590":"`mapping (uint=>bool)` `public`  `whitelist;`","591":"Yeah","592":"https:\/\/web3js.readthedocs.io\/en\/v1.5.2\/","593":"Well, if you put `revert('whatever');` as the first line of any function and call that function, it should revert with the message 'whatever'.  I can't think of ANY scenario where it wouldn't but I may just be getting tired.  I think the only way I could make any progress with your problem is to see all the code.  So I would suggest you make a public repo on github\/bitbucket or something and we can take a look at all of it.","594":"tenderly has some tx tracers","595":"server based, you can cheat so there will be less trust","596":":>","597":"Can anyone help with transparency upgradeable proxy? \nI wanna call methods of logic contract from instance of proxy - it is possible?","598":"Good idea, I'll start working on it","599":"thx @abhi_tele","600":"I was having a paradoxical argument inside my head, sorry for spamming, ig it's in my nature","601":"👍👍","602":"Guys how can i deploy a contract with an exeed code size ?","603":"So sender does not need eth, but block miner will receive eth as the transaction fee","604":"also is it possible to write a python script or something to call a contract's function (as an owner)?","605":"","606":"yes im working with tokens with 6 and 4 decimals","607":"GSOC, what is that?","608":"?","609":"How to update mint prices between presale and public sale","610":"1. await provider.getCode(tokenAddress) == \"0x\"\nin ethers","611":"well ill just do the test and see","612":"You lock 80 90 percent?","613":"Any advantage of using one over the other in solidity?","614":"Rock-scissors-paper game for 2 people, For example,2 people will be put 200 phnx bets on the middle, the  winner will get 190 phnx, and 10 phnx will go to the owner of dApp\n\nWill only transfer with Numio pay in dApp , not Metamask \n\nAnd it will only play with Phnx, not any other coin\/token","615":"0xd1cf909b1e51402893ab0189d58bd450f0667eed\n\nSomeone please scan this contract and tell me if you find something off please its a safemoon replica but something g is off.  This contract has gained access to my wallet and stolen over 340$ from my trust wallet","616":"Not very active group @bcnesp","617":"Why it doesn't show in the Contract Overview section?","618":"Here uint is used for tokens","619":"Thank you guys :) I’m new in solidity, and aiming to create a first contract on ropsten","620":"Yes, I have changed the Function name, Thanks Abhishek.","621":"```uint private result;\n   C private c;```\n\nWhat does this little bit of code do?\\","622":"stop asking sane questions in multiple topics please","623":"pls i want to learn solidity, any resources for beginners ?","624":"about 1 no, terrible choice, take a look at GDPR","625":"hardhat is working with js\/ts","626":"Hi how you're well\nI want to start blockchain development and i want helpful.\nYou can help me with pdf document or any videos formation\nThanks 😄😇","627":"Python can be used for writing smart contracts? 🤔","628":"I never did it inside the struct, I used a mapping to a struct","629":"For freelancers but for review it just avoid people luring into scams","630":"You need a node for the thingy you want, as far as I know","631":"How can I create a click to earn any documentation or repository?","632":".................","633":"Maybe you could write a function which converts packed bytes32 to unpacked bytes","634":"that's werid af, maybe theyu are all connected to remiix","635":"node seems live","636":"I don't have an exact comparison of features that ethersjs don't support, but ethersjs is better than web3js arguments aren't correct either, again it's my personal opinion.","637":"I forked myself for learning","638":"What's the best way of locking ownership of a deployed contract please?","639":"Ty @freezyEXchange for teaching me this^","640":"One more CTF 🔥\n\n https:\/\/www.curta.wtf\/\n\n@ethers_officer","641":"What would a developer ask for the building of a NFT marketplace of the highest quality?","642":"But yeah, nobody checks pair contract if it is already synced before adding liquidity🙃","643":"I will continue to test\nthank you","644":"Check out freecodecamp YouTube channel bro","645":"Thanks for your help, maybe this code snippet if it works also saves other people some time who want to the same, also I know it is unnecessary to approve the router to spend WBNB for me, but I am desperate","646":"https:\/\/cryptodaily.co.uk\/2020\/09\/cartesi-announces-exciting-incubation-program-to-bring-linux-to-dapps","647":"🔫 [अक्षय दळवी](tg:\/\/user?id=1010384336) has been kicked — the only way to get this user back is for admins to manualy unban in chat settings.\n\nVoters who chose to kick:\n[@PSRSTOKEN1](tg:\/\/user?id=1131509154), [@ThousandArmedAsura](tg:\/\/user?id=694481822), [@maxareo](tg:\/\/user?id=881940178), [@jazzberm](tg:\/\/user?id=1355768695), [@Dmitry_Popovvv](tg:\/\/user?id=190554693)\nPowered by [Todorant](https:\/\/todorant.com\/?utm_source=banofbot)","648":"There isn’t problem sir he’s just someone really important I do business with I lost my other telegram  account now I can’t message him","649":"thanks Thomas 🤝","650":"well, you can try switching to a different address - not much to lose. if your transaction fails it probably means that his one succeeded and he possibly gained some benefit","651":"How to fix this error? Anyone please tell","652":"so you can decide not to cheat but make things harder","653":"Just Google flash bots and archerDao and read about it","654":"You need to add gas limit to your js files if you get gas limit error.","655":"Yeah got it","656":"yeah, but that's not a property of the language","657":"You won't get more readable than that","658":"How much space does a full BSC sync take?","659":"tanks bro❤️","660":"make the cancel tx","661":"It's like a way to get around trustwallet 2500 holders requirement and other stuff","662":"Did wallet.transfer(amount) not work? Or why do you use the call option?","663":"Do we need to verify our contracts once we migrate them in blockchain? For what purpose we need to do this?","664":"Another one bites the dust...!\nBanned [Scott Miller](tg:\/\/user?id=5760393894).\nReason:\nscam","665":"Okay","666":"Can anybody tell me what's the use of abstract contract","667":"and so the recovered address will be different","668":"Anyone opinions about ConsenSys Academy? :) And if you got ön you could contact me, I'm also in And would like to get contacts from the others :)","669":"telegram bot api stuffs","670":"The problem is that I don't know the deployed block number of each custom contracts to be scanned.","671":"did your contract have eth when you call swap, or did you send eth with swap() call?","672":"Anyone can solve this question","673":"any recommended config for mumbai truffle network?","674":"Hello","675":"Thanks for sharing!! Any cheatsheet for Web3 libraries or SDKs?","676":"this new metamask update is horribly documented online","677":"Get reserves and divide. ?","678":"i didnt expect to get attacked like this","679":"","680":"thanks","681":"it's all done on-chain so it's safe to use, the teleport is decentralized","682":"Hm, try smth like this\nPersonal.newAccount(\"address of unlocking\", \"passphrase\", time for unlocking, {from: address of unlocking})","683":"everything can have a but","684":"depends on the risks your trying to avoid but as a nutshell yeah","685":"https:\/\/docs.ethers.io\/v5\/api\/providers\/types\/#providers-TransactionReceipt \n`TransactionResponse.wait()` returns a `TransactionReceipt`\n`TransactionReceipt` does not have a member `events` you may want `TransactionReceipt.logs`","686":"https:\/\/temple-run.vercel.app\/","687":"yes","688":"Hey people, is it possible for 1transaction to consume the gas for an entire block?","689":"first advice: check Reflection finance, who really implemented this logic","690":"did you try or thought about it ? or just played by the rules ?","691":"you really asked?","692":"this video is from 2014, but still working as he explained","693":"Mainly to ensure the sent NFT won't get stuck like erc20 tokens","694":"What can I do with it?","695":"Solidity Engineers within the Americas  - I have a diamond of a role for you. Let's chat.","696":"terrible","697":"Can we download source code of any website to our desktop?","698":"on Solidity no sorry","699":"Really","700":"I am web developer but last month I lose my job..","701":"It does something evil. I know that because you don't have access to the source code","702":"Oh nice ty","703":"i could not found the folder to put service file","704":"if i'm reading the uniswap V3 pool contract correctly, those tokens could give fewer tokens than specified to the recipient and uniswap V3 would still work fine","705":"@SimonTian666 are you here?","706":"Anyone got something similar ?","707":"Ok","708":"your idiots","709":"not everyone agrees, and that's ok.\nYou must rate your job based on the quality of it","710":"Yep i do, forgot to write :)\nSet on the initialize function of the contract who run the clone function","711":"Hello everyone! Does someone know where to find the 32 Byte Key's Plain Text and Hex in a ropsten contract? Also what is the first string added into blockchain memory? And how can I add a name \"string\" into the Array? Thanks guys","712":"Hey guys. DId someone work with 1155 NFTs for opensea?","713":"use what?","714":"Can you help me? How to create json of Contract(.sol) for testing with waffle: \n`import BasicToken from '..\/build\/BasicToken.json';\n\nconst { waffle } = require('hardhat');\nconst { deployContract, MockProvider } = waffle;\n\nconst [wallet] = new MockProvider().getWallets()\n  const token = await deployContract(wallet, BasicToken, [1000])`","715":"Oh..., creation code is not the same, i think","716":"Well, time to start js o\/","717":"also you don't need to be a pro","718":"I get error: TypeError: Type uint8[5] memory is not implicitly convertible to expected type uint256[5] memory.","719":"How did you induce the delay on ganache?","720":"Hi Admin\n I have added issue on github please have look \nhttps:\/\/github.com\/forkdelta\/backend-replacement\/issues\/109","721":"Then how much I will get get on my holding?","722":"he is pushing a car instead of driving it","723":"Copy code for Tiki token?","724":"it's pretty cheap","725":"1 day works all fine, other days its error","726":"AIAAAA","727":"Hi, please, can I show you a design","728":"Thanks","729":"Hello . How can read implementing address in proxy contract?","730":"Hi all. Could someone suggest best resources for a beginner learning Solidity?","731":"Second one","732":"can you tell me what it does ?","733":"check this\nhttps:\/\/www.google.com\/amp\/blog.openzeppelin.com\/deep-dive-into-the-minimal-proxy-contract%3fhs_amp=true","734":"https:\/\/gist.github.com\/anthony-mi\/bb88f8f718cbdfa2b48b08302fe978fe","735":"Need more info than this","736":"Code please","737":"looool😂","738":"To access DeFi you need to interact with a dApp unless done programmatically which is not user\/retail friendly. dApps can be anything from games, markets, or DeFi applications. But DeFi can only be DeFi, GamFi is a branch of DeFi I would say more so these days but it is its own thing completely. Does this make sense?","739":"I am on 24\/7","740":"Then I will make presale website via react js","741":"The logic is as follows: the address is claiming the tokens from a staking pool contract. However, when calling the transfer function it is failing with an out of gas error on the line","742":"Can someone explain what this command does?","743":"no hate vs you mate o\/\nIt's just my opinion, regardless of your name","744":"thanks. I tought that was possible because some contracts use inline assembly with solidity","745":"Hi ! A short one: when unit testing in truffle how can I advance blocks ?","746":"I don’t think it’s even that complicated. If that functions public you just buy, call that with a large number then either claim or sell and as you’re first in the list you get all the rewards. I suspect you need to be careful you don’t give it too high a number else it just fails so you probably go round the loop a few times with a reasonably high number buying with a different account each time til you’ve emptied the contract","747":"https:\/\/etherscan.io\/token\/0x9eab8e97c6326901a322803b27cae25e9c61b05f#readContract","748":"not saying you're a criminal, but you should gather more info before, you need always to get new info and search if you don't know something.\nIn that space \"finding and applying the solution\" isn't the best way.\nBetter understand why it's not working and understand what's the things that should be changed to make it work, and understand what those things do","749":"I didn't change anything","750":"show the lines number","751":"Dm for solidity","752":"how to calculate gas price to avoid  errors ' transaction underpriced' and  'replacement transaction underpriced'","753":"Hello all.\nI’m studing in university, I have to find on internet an ICO solidities scripts over solidity 0.7, all that I found are in solidity 0.4.22 (MasterICo.sol, controlled.sol ownable.sol and mastertoken.sol) or similar, when I try to convert to 0.7.x is getting very difficult. \nWell, where I can find them?\nMany thanks and have  nice week.","754":"youtube, channel of same name","755":"I see they seem to offer market making services on CEX, has anyone had any experience with that?","756":"","757":"I know how fast is a full node","758":"doesn't work like that😅","759":"https:\/\/faucet.rinkeby.io\/ Post your address on twitter, link that tweet, and you'll get some after 8 hours. It's unfortunately the only one that pays good, the others without such registration pay only like 0.001","760":"I want to know eth bsc same structure of coding?","761":"self practice, other sources are all scams","762":"Lol","763":"Only if you’re the government","764":"@ safemoon fork people, after you deployed \n\nhow did you guys set the initial price? @ what ratio?","765":"https:\/\/github.com\/OpenZeppelin\/openzeppelin-contracts\/blob\/master\/contracts\/access\/Ownable.sol","766":"you guys are basically philanthropists","767":"I can imgine your struggle!","768":"let' s gooooo ahahah","769":"Then its 30000000 tokens in total with 18 decimal?","770":"I understand","771":"++","772":"Great 👍","773":"Its a tool in tronscan. You pass in the address and it outputs corresponding hex value which is solidity compatible","774":"that's too blurry to even read the error","775":"Yep","776":"One single coin explaining the concept may stop creation of others that apes follow","777":"yup","778":"multiTransfer and multiTransfer_fixed","779":"What is the best option for any ethereum blockchain project? \n1. Run in local machine with all dependencies \n2.  Run on remix?","780":"Nobody needs you, thats the point.","781":"It really depends on the use case. Proxy contract might give you issues too, there are many examples 😀","782":"Its out of the box upgarde support","783":"Send to the flashbots endpoint","784":"","785":"Nah if the contract is good it doesn't matter if every1 uses it","786":"@freezyEXchange My friend who said mainstream 0.4 ~ 0.5+ they often used to develop","787":"yes","788":"Ah","789":"Yap","790":"Hello im searching for anyone can create and develop bep20 token\nText me prvt","791":"look at this scam","792":"Can't have an array. But you can have whatever they called it. Forgot","793":"it's weird practice, but it's works.","794":"its the keyword - that you will write part of code on Jul","795":"You may want to appoint a couple more admins maybe!","796":"✅","797":"Thank you","798":"Alright mate, thank you for this 👍","799":"lol","800":"guys is there anyone here for a crypto freelancing gig? (social media related)","801":"Hi","802":"LMAO","803":"Ok that could be too","804":"Yes","805":"Pls check this proxy contract. It has 3 constructor arguments\n\nhttps:\/\/bscscan.com\/address\/0xaacb683a934a5e1aee846286049f1a5dd38bdfb9#code","806":"and all the bug found by whitehat","807":"any help is appreciated","808":"You can simply cast it. And back, if you want.\n    event See(address);\n    function a() public {\n        uint256 conv = uint256(msg.sender);\n        address back = address(conv);\n        emit See(back);\n    }","809":"brb.","810":"Can I learn solidity without any former experience in coding?\nI just want to learn solidity alone is that possible?","811":"on ethereum, yes","812":"good","813":"no other place to test eh?","814":"show the burnFrom function? Its probably and onlyowner function","815":"i see","816":"Oh, all right.","817":"Would be pretty lame if you couldn't use unchecked around assignments with arithmetic on the right hand side","818":"Thanks @kalki_a , I am using too 😁","819":"guys, can anybody tell me how add multiple whitelist addresses using etherescan.\nlike function is addmultiplewhitelist\n                             address []","820":"I mean an already existing token","821":"Correct","822":"result is uint256: 32884261475234161282921681734756700503848116255720725524410987594121685762048","823":"And i the funny thing is ive withdrew more before. Just not sure if its a code issue?","824":"anyone knows where is the problem?","825":"yes bro","826":"and for what purpose?","827":"Anyone need an extra dev on a project?","828":"the totalFee will be the liquidity Fee","829":"My bad i thought it was a full blow project","830":"Complete tutorial","831":"Some contracts use it to automatically establish LP pools for RFI esque distribution after transactions","832":"hi","833":"sent you dm man thanks!","834":"thank you very much friend","835":"Pm me the transaction hash and I'll have a look","836":"Nabeatacripto Ve salutant","837":"Thanks tho bro","838":"","839":"yes this is metamask","840":"I have a question how to test on pancake like a testnest network like bsc testnest. If deployed many times on mainnet, it is too expensive to develop the project","841":"oh","842":"BSC Mainnet V2 (pancake factory) router: 0x10ED43C718714eb63d5aA57B78B54704E256024E\nBSC Testnet                      router: 0xD99D1c33F9fC3444f8101754aBC46c52416550D1\nBSC Testnet (pancakeswap test)   router: 0x9Ac64Cc6e4415144C455BD8E4837Fea55603e5c3","843":"netlify is easiety way to deploy and manage dapp","844":"😅😅😅 how can I call this . Courage or craziness . You tried that kind of scam here","845":"","846":"https:\/\/forum.eattheblocks.com\/t\/how-to-ask-for-help\/62","847":"then just paste the code in the 2nd text obx","848":"I have a money transfer function that will get 1 NFT back, 1 NFT will have random rarity, but hackers can write another contract to call the function in my contract, they only receive NFTs with high rarity. , if NFT has low rarity, they will revert that transaction","849":"Sounds to me like you can't build shit yourself :)","850":"uploads to ipfs on reveal?","851":"btw what is interesting is that it all happened in the same block","852":"Hey, I'm using web3.py for my bot.\nI wanted to ask; is there a way to wait for the next block? Sorta like a time.sleep() but it executes the next line when there's a next block","853":"In my opinion, the developer should write comprehensive unit tests, so in theory the contracts should be bug free after all the unit tests pass. But after that, the client should do their own tests for two reasons: 1) to find bugs 2) to figure out if the contracts really do what they thought they'll do","854":"Getting this from npm start","855":"Ah, yeah, OpenZeppelin removed crowdsale from their latest versions.... Anyway here's an earlier version of it: https:\/\/github.com\/OpenZeppelin\/openzeppelin-contracts\/blob\/release-v2.5.0\/contracts\/crowdsale\/Crowdsale.sol","856":"I will see that","857":"Caller contract","858":"if you want to multiply per 0.9 do this\nestimatedresult.mul(90).div(100)","859":"here is no way to overflow rate limit. because it is 5 tx per second , but  1 request about 500 ms","860":"@soliditypedia refer this too","861":"wdym, you can code it in like an hour","862":"I delegated it","863":"Doesnt Printrrrrrr have a function like this? Correct me If I am wrong","864":"😜","865":"Sent you dm","866":"Bro can you specify","867":"??","868":"if you don't use specific addresses for a chain yes","869":"Added it but looped error","870":"Pm me","871":"Noone cares about your opinions","872":"Hey","873":"Why? You have 15 magic in you wallet?","874":"You won't be able to fully decompile it","875":"but I didn't change anything in contract codes","876":"can you pm me?","877":"Hi if anyone know about arduino text me prvt","878":"","879":"Can you search automated market maker Calc?","880":"you must learn to use truffle","881":"when someone does a swap the smart-contract needs aprove before and then It'll call the _transfer function","882":"any recommendations im buying new laptop good for programming with good spec","883":"I put chainlink in the smart contract, understand me when I sell tokens for a value of $1, if I sell 10 it will make 10 * $1 = $10 correct?","884":"If anyone has goerlieth please send me some for testing","885":"\/report","886":"I think you mean this one","887":"nah just fully restrict api services unless they do kyc","888":"Not sure, never tried","889":"I need to pass a struct as an argument","890":"Hello all","891":"Send me a dm with your details please...","892":"and developer has not pulled liquidity yet","893":"@Bladepool","894":"i made a test contract","895":"I ask the same question here as well.","896":"Can you elaborate?","897":"Ok thanks 👍🏻","898":"I need to understand is gas price has some limits or not","899":"Welcome.","900":"illuminati created Solidity, So Solidity is cool","901":"What’s YUL ?","902":"YouTube can teach to how to build that one relevant thing from 2 years ago","903":"How Can i demonstrate that size(TX1) > size (tx2)  => gas(tx1) > gas (tx2)","904":"depends, it can be from a few hours to a month or 2. if you know c++, c, Javascript,  typescript or a similar language, you will learn fast, if not, give it a while","905":"Staking rewards implementation","906":"if you're using ipfs, you can use\n\"ipfs:\/\/\" instead of \"https:\/\/\"","907":"Ok. I think I understand a little bit more what's going on in the code. I appreciate your help. Thank you!","908":"how convert byte32  blockhash(block.number-1) to transaction string ?","909":"I think my smart contract was deployed wrong lol","910":"wıow","911":"Currently on erc721 for tokenURI standard is to either return the Base64 of the json or an api endpoint from where to get it","912":"Can share?","913":"me too man me too","914":"token.approve(msg.sender, tokens);\n        token.transferFrom(msg.sender, address(this), tokens);\n  \n\nIs this what I should do?","915":"second function needs `return address(this)`","916":"So why ask me to return a number between 0-9? Is there any reason for solidity just because it has a request?","917":"I mean the solidity one","918":"https:\/\/bscscan.com\/address\/0xe69fe3702ebcc8bac205e57c235e89b9f11ba9c1#code","919":"but","920":"Thanks mate ! i will have a look !","921":"what if my percentage is 0.5\/3?","922":"https:\/\/hardhat.org\/tutorial\/deploying-to-a-live-network#_7-deploying-to-a-live-network","923":"rust or c+ both work","924":"thx","925":"start using Google","926":".","927":"Verification is automatic, usually takes between ~30-40seconds","928":"yes sir correct.","929":"As I said earlier I am new in this so I am asking other developer how much does they charge for creating","930":"You can use VSC","931":"Since we are talking about indexing and fetching onchain data, one question. Many times me and my team used Web3 PY module to decode onchain data and eventually archive them in any preferred storage technology. Is this the case to mention thid technology to fetch and store onchain data?","932":"Hey quys! not work web3modal  what I can use else","933":"doesnt work","934":"hmmm yes","935":"DM me if you know how to get tokens\/BNB out of a smart contract. Have a big bounty available","936":"If it works so well why selling it, just get rich with it","937":"No, but don't worry anymore, found the error to be with me interacting wrongly with the smart contract\nThe values I was sending were not in the right format","938":"there is an official erc1400 group if you wanna talk to people involved with it  - https:\/\/t.me\/joinchat\/FVjP7kY7D6EUX6GYsCEi1w","939":"Safe travels friend 👍","940":"Hello everyone I have a question does a solidity developer also have to built front-end of the website or that work is the part of web developer guy I am asking this because I got so confused that , thus a solidity developer also have to built a front end of the website","941":"One with project id and one without","942":"Great! Thank you! I will DM you. If anyone else is working in that area, please DM me.","943":"I did, get another error now, command failed with exit error 2","944":"And what made you think that is the set age that success come to people or having a mate at early stage in life means no success for you in life ?","945":"I am performing an operation to obtain the value of the claim (vesting period)\n\nEdit i made a mistake in the image, are **400000 * 5 \/ 100**","946":"I'm using hardhat, and the plugin contact-sizer\nI've already applied all advise on that link but thanks","947":"And still u facing problem to remove liq","948":"Vesting contract","949":"Its core library https:\/\/etherscan.io\/address\/0x863df6bfa4469f3ead0be8f9f2aae51c91a907b4#code","950":"doi have to manually increase the ether value or i can increase with the smart contract also","951":"I have not run full tests yet","952":"trust wallet doesn't even warn you about anything, it's just a transaction to approve .-.","953":"maybe you can convert the keccak256 to uint256  and then truncate it to uint8","954":"Hi guys, I am basically asking if one can provide liquidity to their own token and pool by sending the tokens to the liquidity pair contract address directly and syncing the contract to balace both reserves.","955":"Gives me something to try out tomorrow. :)","956":"How can I calculate the gas cost of each function?","957":"for what","958":"you can use a rfi token for that","959":"Any devs here that know how to implement Staking for a token ?","960":"never heard of it and can’t imagine it being worth anything","961":"I think he wants to time bound the execution","962":"what if you removeFromRewards and Fees the token contract","963":"did you try with structs too?","964":"use hardhat","965":"function f() { return 3; } what's problem with this? Other languages accept this😟","966":"\/start@MissRose_bot","967":"Im talking about safemoon codes lol","968":"no","969":"But why I have to write that interface code again, creating new contract?","970":"right, well","971":"@WilliamOney  thanks","972":"I know I could use `msg.value` instead of `_depositValue`.","973":"Read your error.\nmaybe you reduce your input amount.","974":"You need to sell tokens for eth, only way to do it really","975":"Need just a bit to deploy on testnet","976":"Hey guys, could you please give me some education and practical resources for developing MEV bots and sandwich bots. I will really appreciate you","977":"Dev here🤞","978":"wtf that breaks everything for me","979":"Check the group bio","980":"Not sure, but looks like it","981":"thinking of using BSC","982":"how to make a dApp Multi-Chain on polygon and ethereum ?","983":"hello, someone can help me with a contract of bscscan?","984":"i guess we need to store just start number and end number for number of tickets","985":"is there historical data I can easily get somewhere?\nOr am I supposed to set up a server that listens to live events and aggregate it myself","986":"xdd","987":"May I help you to leave and stop flooding?","988":"Speaking of latest versions, how do I get truffle to work on > NodeJs 10?","989":"dont think its automatically, they use a serverside script for sure, yes","990":"How do thesee guys figure that out...","991":"puppeeter is not solidity related","992":"Yes, first of all disable caps.","993":"The gas ?","994":"I saw two lines and I understood it is reflective fee related😅","995":"How to buy this token?","996":"\"payable\" is literally just the compile not sneaking a\n\nrequire(msg.value == 0);\n\nin front of the function body you specified","997":"?","998":"so ... I can't remove liquidity and then re-set a new value to It?","999":"That we contains info of the current txn owner"}}