{"text":{"0":"i thought internet was banned","1":"Didn't understand","2":"Check ur dm😏","3":"Americans, British, and German","4":":\/","5":"so they weren't really viable","6":"Well, that's kind of my voice but a tad lower","7":"a hello world in flutter should be 5mb, and a fairly large app should be 10mb","8":"Åh","9":"I am just struggling with that android.mk shit","10":"How can it be blue if it reflects white? White is the sum of all colors. If it reflects white nothing has been absorbed and all is reflected = moon has no color.\n\nMoon actually appears light gray tho.","11":"xd meh","12":"Need to oversimplify for now","13":"I just wanted to launch an app...Soo....","14":"but facts tell that most of them are using any browser but IE","15":"","16":"https:\/\/hydrozzen.github.io\/NatkhatIndia\/\n\n\nHave a look at it and do tell any changes i should go on with","17":"still it's a normal data plan","18":"i said ur code","19":"fucking christ, tried to do some validation using joi to my teammate's project and js threw at me every unhandled promise that can ever throw like million line of errors, tied coupled project as fuck love.","20":"entropay has been shut down","21":"is it fast for large files","22":"Or they'll fuck your server","23":"CIA","24":"Send me your github","25":"How many episodes has jujursu kaisen","26":"xiaomi exaggerates a bit on their camera that's my experience. their camera's are not that great","27":"if I want to build an app that blocks cyberbullying texts for prevention and make those sentences blank and send an alert to parents through email? what all should I learn to create it?","28":"damn it man you succeeded this time xD","29":"I just said it for fun","30":"plz send to me join link of it","31":"Which generates CSS","32":"","33":"😂","34":"> Java bad because that's what a Twitter dude told me","35":"Did the episode come out already?","36":"Supporting a game takes time, many problems can be platform specific or even distro specific, Gamers aren't geeks always they can't always debug\/fix the bug from there side perfectly so you have to provide some fail safe.","37":"You might as well just add the extra ban as one for free, you know when you buy something some sellers give one for free, well I need one for free","38":"It's the most permissive and compatible with whatever license you choose for your own work","39":"","40":"hmm, these","41":"if there's an easy way to create cross-platform native apps in a popular language, people will switch","42":"I didnt read the whole convo, maybe not for u but","43":"xD","44":"Possibly a Mr.Robot reference","45":"um h265?","46":"I'm not a newbie, but i don't know what's that","47":"Web developers know web development, that's enough for them\\","48":"find channels which share these kind of proxies and just click on one proxy. or copy its address and port and create a new proxy with those data in settings.\n\nif you are trying to bypass filters you may want to use TOR or VPN apps or services.","49":".","50":"","51":"It is also suspected that it is the binary code for an alien architecture","52":"too soon to hate it, their monatization was really chill til now, but telegram is kinda dodgy","53":"Also csharp and asp\nI choose php laravel because of it's facilities and flexibility. 😍","54":"You can't hate python if you saw python","55":"Every 1 year in human years is 10 years in programming years","56":"Anyway, does someone know about paths like \\\\.\\C:","57":"what you put into shaders I put into mods. So we use the same amount of RAM haha","58":"Or chances are that. They will be using rest APIs","59":"and this one is my fav so far","60":"Fine I'll just cry myself to sleep. I want a divorce","61":"lel #CoolPun","62":"this","63":"another libtard","64":"It should be as simple as that","65":"I blocked you and deleted your chat","66":"he just ragequitted lol","67":"Also the diamond smuggling industry","68":"So please.... Slow down man...","69":"Nice","70":"","71":"Can't you just set your router to use 1.1.1.1 or any other DNS outside your country?","72":"scammers don't create any value, in fact, they destroy value","73":"It's good. Unbiased points of view are always good","74":"What is this group for i wonder","75":"Source?","76":"You're just used to see the negative side of things.\n\nYou have no idea how shitty LTE coverage was before this guy became our ICT minester.\n\nAnd yeah, sometimes people suck but it doesn't mean that they don't try !","77":"😂","78":"Ok, give me some Javascript code to execute","79":"Hehe there is guy named as swift and he keep sending only those messages 😂","80":"Any idea how I can get pass with pattern lock","81":"https:\/\/github.com\/0xaryan","82":"Ik. Ask my employers Facebook page :\/","83":"Which you can find conveniently on libgen.io","84":"Didn’t know there was so much stuff","85":"Makes me dizzy","86":"Google the name of the book, see if it's available for free or if it's a paid book","87":"","88":"well","89":"We will build our own Twitter with blackjack and hookers","90":"dude — I just contributed a fuckload — Sylvain is still in charge","91":"He should use jquery but he doesn't know about how jquery works.","92":"I really need to promote my page on facebook for free, anyone have any idea?","93":"submit to publisher? send to friend for editing?","94":"But I you learn physics you learn to use variables","95":"Or this","96":"🛠 **Groups I manage**:\n\n- [Android](https:\/\/t.me\/joinchat\/FNPR30Fs51OX1853MfCKVg)\n- [C \/ C++](https:\/\/t.me\/joinchat\/FNPR3z_cJVfTQQazM6fT-g)\n- [C#](https:\/\/t.me\/joinchat\/FNPR30MHMoe3dNsEo0kQbQ)\n- [Dart \/ Flutter](https:\/\/t.me\/joinchat\/FNPR31d8fNEYKJLxKOnhvw)\n- [Data Science](https:\/\/t.me\/joinchat\/FNPR30pFD0AA2TTD_ht0Ng)\n- [Databases](https:\/\/t.me\/joinchat\/FNPR30zFvqKaWRLOmq-R6A)\n- [Design](https:\/\/t.me\/joinchat\/FNPR30KREgxNWEUmPMZJAg)\n- [DevOps](https:\/\/t.me\/joinchat\/FNPR30LzhcFnGe-Sdq2brw)\n- [Devs Chat](https:\/\/t.me\/joinchat\/FNPR30QUj4X7ycnEBCoFIg)\n- [Devs Share](https:\/\/t.me\/joinchat\/FNPR30OEe86iIQ2Xd5AK-A)\n- [Functional Programming](https:\/\/t.me\/joinchat\/FNPR30eyuZ3Iv33PLPn6nw)\n- [Game Development](https:\/\/t.me\/joinchat\/FNPR30TxcmsVOAN_PPMTiw)\n- [Go](https:\/\/t.me\/joinchat\/FNPR30QTWYP2j3S9bFsKEQ)\n- [IoT \/ Electronics](https:\/\/t.me\/joinchat\/FNPR31I38XntL6m0lXlr2A)\n- [Java](https:\/\/t.me\/joinchat\/FNPR30HS8_FCVNzWMgOxCQ)\n- [JavaScript](https:\/\/t.me\/joinchat\/FNPR30EU-CGZ2Fc9vb4lmQ)\n- [Kotlin](https:\/\/t.me\/joinchat\/FNPR31S3nRGX5x_JdpHfog)\n- [Linux](https:\/\/t.me\/joinchat\/FNPR30JIlcnuoY7679K5Yg)\n- [Machine Learning](https:\/\/t.me\/joinchat\/FNPR30d2e0lIE756t-dhvg)\n- [PHP](https:\/\/t.me\/joinchat\/FNPR30I7auD3LGM5LaGUdQ)\n- [Python](https:\/\/t.me\/joinchat\/FNPR30I6mgRwdNV2W_K4aw)\n- [Rust](https:\/\/t.me\/joinchat\/FNPR30fL93Kyh_RNJRc2ZQ)\n- [TGDR Support](https:\/\/t.me\/tgdrsupport)","97":"I'm talking about El Capitan","98":"I think source code ins worse that u think","99":"Thanks","100":"Ah","101":"waw, that's solid","102":"Hey. I need assistance with some HTTP network calls\n\n- I am making an HTTP POST request, which will return a promise with a JobID.\n- Next, I want to use this Job ID to repeatedly make a GET request to know the status. If the status is \"finished\", then I can proceed, else make the GET request again\n\nThe issue is that I'm unable to figure out a proper way to repeatedly make the GET request from within the returned promise's \"then\" block","103":"So shadowsocks is doing a great job with a hassle free installation","104":"linuxjourney.com\nGo here and start reading.","105":"Had to reset","106":"well that's basically the uses of the keypair, each key in the pair has 2 functions","107":"😂","108":"","109":"did you get a proper computer now?","110":"void disp() function is going in an infinite loop.","111":"I am from Ukraine and i do not know too","112":"ur mom ghey, lol","113":"but for my new job in Feb. in the field of crypto I'm planning to bump up my security","114":"Oh there's more to come","115":"This happend 😶","116":"Librem phone seems interesting","117":"Wekan seemed nice but no android app","118":"I think I just hit limitation of LibreOffice calc","119":"By the @watzon believes USA is one the \"Shitiest\"","120":"He is right tho\nBut we also have the right to annoy you","121":"I would imagine there's some kind of safety built in to prevent that from happening.","122":"it makes me so sad","123":"Right, I wash dollars too.","124":"I want to remove win xp for ever😩","125":"flexnet publisher","126":"sniff","127":"Name something.","128":"ma problem is how start...do u know any ways other than books or sites?","129":"","130":"","131":"^ +1","132":"But i did Cpp too","133":"https:\/\/en.m.wikipedia.org\/wiki\/Whitespace_(programming_language)","134":"Jainism","135":"Because all u do is play game and watch movies.\nWe talked about this in the Reich","136":"Can read the Wikipedia disambiguation lol","137":"Anything that is user writable is rip","138":"so. there's some content that loads on a page when i click some element. \nI'm trying to set up breakpoint. DOM mutation. how can i find what is the event that caused a specific element to load onto the page?","139":"Kek","140":"@codexetreme","141":"https:\/\/github.com\/Microsoft\/ChakraCore\/","142":"For public groups you can get a public link to a message which will go to that specific message, but you posting such a link here will get you a warn","143":"That isn't installing apps dude, that's when apps compile and execute XD","144":"yep","145":"Fyi I dont think this is the real Hacker News. \n\nThere is another that I am in","146":"The logical reason why I'm slim","147":"I mean\nRegex is just that, isn't it?","148":"i can't play CS 1.6","149":"Pure procedural.","150":"Inspirational","151":"Ideally even more than Rust","152":"the webapp that you are using is most likely scanning the IP from their end and rendering the results on your browser","153":"I know","154":"Searched docs and also stackoverflow but didn't find anything","155":"big step :P","156":"Sec, am helping a friend with Icelandic","157":"It's probability. Maybe someone opened a special link with his first device in his first try! But yes you are right. Actually this won't happen.","158":"Enough said","159":"hence commas after 2 numbers","160":"I'm ok. You see the bottleneck.","161":"🤪","162":"i mean very cool that you recovered. not that you got infected, that was not cool","163":"Can go to hell","164":"@SitiSchu","165":"Guys I wanna build a chat app","166":"👍","167":"he a bit dum dum","168":"It's fun to imagine now, nice","169":"He might also feel like joining","170":"I know, Github does that\nIndentation is larger on Github","171":"no? lol","172":"i liked none","173":"","174":"yes","175":"You have to spend some time learning JavaScript","176":"From scratch","177":"Do a hardware test, your laptop manufacturer should provide a utility to do this :)","178":"Fair enough","179":"**Text**: `guixsd`\n**Toxicity**: `0.46095464`","180":"Yeah","181":"There's a Game Dev group if this is related to that","182":"I have OpenJ9 and I installed Hotspot for them (I have 4gb ram)","183":"Yes","184":"Python has a group, and they're both general purpose","185":"If they weren't immigrants I would've called them Russians","186":"Hmm maybe I'll get some of these BT jammers for my arduino and take it to the school bus.\n\nAlthough, that's very much not legal","187":"No problem mate, take your time :)","188":"instead of spaces, it was indented with non-breaking spaces","189":"Thanks, I just took lessons from Sinatra","190":"Ayyy, google fucked up some update and now some of you must have pretty slow phones.","191":"Imho making 90+$\/h on little side projects won't work on upwork, look through the proposals\n\nThe devs (not devops) I talked to working fully on upwork make something along the lines of 50$\nDepending on where you're from this can be heaven or shit","192":"","193":"\"How to Socrates in 10 minutes\"","194":"Saw this in le reddit","195":"https:\/\/community.notepad-plus-plus.org\/topic\/13093\/which-regex-engine-does-notepad-use","196":"Rip psu btw","197":"DO TELL","198":"well, that convo definitely scared some people 😅","199":"For SwiftForth ONLY, these are some people:\nKoc University Physics Dept.\nKonings Software\nLockheed Martin Missiles and Space\nLogix Controls\nLoma Linda University\nLos Alamos National Laboratory\nMatrix Systems\nMicrel\nMicroCAMERA (Dermotricos, SRL)\nMurdoch University\nNASA Goddard Space Flight Center\nNEDAP\nNorthrop Grumman\nNorthwest Marine Technology\nOptical Physics Company\nOrbital Technologies\nOwens Corning\nPharos Systems New Zealand\nPPL Interstate Energy\nPrecision Devices\nQuantum Composers\nRadiant Power Corp\nReilhofer KG\nSacramento Municipal Utility District\nSan Diego State University\nSandia National Laboratories\nSESSCO Technologies\nSmartway Solutions\nSpalding\nStanford University\nSun Microsystems\nSunrise Systems\nTEK Data Systems\nTexas Instruments\nTextron Systems Corp\nTonick Watering Ltd\nTransonic Systems Inc.\nUniversity of Detroit Mercy\nUniversity of Saskatchewan\nVersus Technology\nVillanova University\nWaters Corp.\nWeld Tooling Corp.\nWescan Systems Ltd.\nWest Coast Aerospace Inc.\nWL Gore & Associates\n\nA2D2 Electronics\nAdaptec\nAdvanced Wireless Solutions LLC\nAerospace Corp.\nAGY\nAMTELCO Inc.\nAnser Coding\nAntek Instruments\nApator S. A.\nApple Computer\nApplied Instruments\nArchivex LLC\nArgonne National Laboratory\nAuburn University\nB&C Electronics\nBEI Precision Systems & Space\nBoeing Military Aircraft & Missile Systems\nBorg Warner Turbo Systems\nCalifornia Cedar Products\nCaprilion Enterprise Co.\nCedars-Sinai Health System\nCentral Piedmont Community College\nCombiMatrix Corporation\nCustom Manufacturing & Engineering\nDIRECTV Inc.\nDRS Technologies\nDymaxion Research Ltd\nDynatronix\nEastman Kodak Company\nEltek Specialist Data Loggers\neTurboTouch Technology\neV Products\nFedEx\nFlorida State University\nForTest Italia srl\nFurman Sound\nGE Analytical Instruments (Ionics)\nGE Digital Energy\nGeneral Dynamics Advanced Info Systems\nGeneral Dynamics SATCOM Technologies\nGeorg Fischer Signet\nHanson Survey & Design LLC\nHeartland MicroPayments (Debitek)\nHF Projects\nITT Advanced Engineering & Sciences\nJohnson Matthey Testing","200":"If anbody knows a way to read bank transactions from my account in any bank in the Eurozone please hit me up 🙃","201":"it was, on my ubuntu 😆","202":"Yeah now its cool i dont have a photo 3ditor on my phone did it from default one. Now its perfect👌😂😂","203":"which laptop are you replying from now","204":"Every time I listen to it, I keep hearing Yarel the first time, then Laurel every time after.","205":"Yeah this needs to have IoT","206":"Like 2 days ago","207":"^","208":"Let's see why 🙈","209":"I'm waiting","210":"Some languages don't have a word for \"it\"","211":"he ascended","212":"So that I don't feel that bad watching YouTube for hours","213":"Are you there? @MSFJarvis","214":"Depends on you\nI would call it\nTheOmegaPixelCountOfDoom\nYou being a reasonable and responsible person need to think very hard on this but maybe\ntabPixelCount?","215":"> ignores all logical arguments and sends ellipsis","216":"Btw, this is common with abused children. I have the same issue, acceptance is very hard for me","217":"Oh, I think python is not the best language to learn oop on, seriously","218":"composition is the way","219":"yes","220":"the point is that's what SILICON VALLEY is","221":"saying hello to your mother tomorow morning is right thing, so they exist","222":"Banana sticker == vegan?","223":"yea github","224":"good luck","225":"Uhm lots of people","226":"are you saying it can be something other than 1\/e for this case?","227":"Same","228":"Didnt you say you blocked me\n?","229":"Go have some sleep man","230":"I fell asleep","231":"It's the truth","232":"No i mean sometimes you can't have all data you need simply","233":"https:\/\/blog.sigmaprime.io\/solidity-security.html#storage\nugg i want to start doing blockchain but kinda want to get good at pwn too","234":"I don't understand what you're trying to tell me\n\nMy \"hmm?\" was a \"what do you mean?\"","235":"usually fixes all the shiz","236":"Hi baby","237":"should be","238":"I dont see #s","239":"Btw","240":"That's like 5 months ago","241":"M$ are pretty much a dead end","242":"Glitch maybe","243":"Always i worke on python","244":"thanks!","245":"this shows stop using node","246":"Why would it be? there's no virus in Iran obviously, no need to worry, no need for quarantine.","247":"this","248":"just not centimeters","249":"There's a universe for every singular different change in that theory","250":"You don't rely on police to stop you from breaking the law, you're supposed to just not break the law","251":"this reminded me of an image of a C source file with everything #define’d to emojis","252":"Hey there, it looks like you were trying to commit suicide. Do you need help with that?","253":"or get a 70% kb","254":"","255":"True dat XD","256":"You are not even near to an ethical man","257":"","258":"Me 2","259":"HertzField!","260":"alright bois hes a skid","261":"what do you want to be discussed here? what do you want ppl here to post?\nmaybe make a list of the permitted things allowed to say here it'd be easier for all sides, no?","262":"Oh","263":"It's not enough","264":"","265":"It's a good oraganis chemistry pun","266":"I have matatta source code how can I implement it to my bot ?","267":"","268":"point me to that message. that's all I said","269":"Sigh of climaxing guru in programming","270":"I get why you can't revoke it (detrimental for apps which use it for apps), but I'd still like to know","271":"Hah","272":"Hey, anyone know of a gboard clone without all the googly bits?","273":"You know, like these ones you attach to the DSLR and stuff","274":"They have a variety of images, including windows.  But you'll probably want to pick Ubuntu.  (Windows is expensive)","275":"python group","276":"true but some stuff incites anger in a certain group of people","277":"Yup","278":"Let's talk about Linux here and offtopic in the Linux chat","279":"but detours is used for hooking a function","280":"(240+70)*80€*12 is quite a hefty sum","281":"difrferent people use different langs","282":"","283":"It will laze around all day, eventually it's creator will be forced to shut it down for good to cut energy costs.","284":"I wanted JSON lisp","285":"¯\\_(ツ)_\/¯","286":"i say send php","287":"There was one in India too right","288":"Well, why would someone buy from you instead of grabbing totally new one and having the option to pick parts?","289":"Is that a proof or trolling?","290":"Is nodejs ideal to build the backend of a ml","291":"Bcz he is","292":"Lol I'm actually pretty good at math I am just ignorant to FP","293":"cyberbullying doesn't exist","294":"","295":"wut even 😂","296":"stop sending misspelled whats","297":"they cope","298":"😂","299":"right","300":"man I started that project months ago","301":"","302":"Most of what TS has is a zero cost abstraction over modern JS","303":"nodesource, skype, bintray, wine, heroku, mongo, vscode, playonlinux, erlang,...","304":"oohhhhhhhhh god","305":"And @Tim_mz4  he is the one who is now on in this community he is that hacker","306":"na too bloated lol","307":"& executive.","308":"Yeah, finally :$\n\nIt was also big step forward, when they introduced the text shortcuts for emoji...","309":"Job interviewer be like:\n__I don't think open-source contributions is something that should be prioritized in a job__","310":"Hippies don't","311":"From Android to lap and lap to android","312":"Knowing everything that is listed means you’re probably overqualified","313":"What?","314":"Actually","315":"Yes","316":"wasnt till last week that i changed, only my pc, to mx linux","317":"Awesome. Me likey.","318":"Like","319":"its my father acc","320":"Also osmc for a while.","321":"Hey Martin can I pick your brain a little bit? I have a couple of questions","322":"Could cause nausea","323":"To americand it all looks the same","324":"No.","325":"Im not sure where to post this, but protonmail has opened up a lot more job positions \nhttps:\/\/careers.protonmail.com","326":"looks like JSON","327":"I just copied and pasted your original message into google and that is what came up","328":"Either do it right or don't waste your time","329":"\"out of shock\"","330":"I know this algorithm a little bit but don't know how to work without negative edge and undirected graph","331":"Entropy in chemistry has similar meaning","332":"Apollo guidence computer, probably.","333":"<i>","334":"adrenaline is the shit","335":"Lol","336":"Don't listen to him. Assembly is fun. DO learn it.","337":"so it can be anything","338":"Let's say, I'm going to upload to cpanel using ssh","339":"That's the really hard thing","340":"Surprise","341":"Lol","342":"","343":"(I switched jobs)","344":"Skittles was in the rack of chocolates while u were buying @dank3y","345":"Throw it to the trash","346":"And compared to nvim and emacs is not very extensible","347":"","348":"I have tried OniVim it sucked","349":"Oh","350":"I don't use it tbh","351":"`C:\\Users\\<USERNAME>\\AppData\\Roaming\\Microsoft\\Windows\\Start Menu\\Programs\\Startup`","352":"Is it worth spending 200 USD (for example) on something that every month will save you 50 USD in productivity hours? i think it is","353":"bindsym $mod+shift+n exec --no-startup-id termite -e screenfetch\nThe above command will execute for less than a second..I mean it will disappear immediately..I also tried exec_always ..didn't work","354":"we don't have a lot of americans afaik.","355":"you're late sir","356":"xD","357":"It has... User accounts, you know","358":"You're globalist by any chance?","359":"No, i'm simply asking you a question.","360":"i m so free now","361":"https:\/\/www.reddit.com\/r\/AskReddit\/comments\/a2zwpp\/whats_a_rule_that_was_implemented_somewhere_that\/eb35r41?utm_source=reddit-android","362":"wdu expect it's combination of two languages made by hunch of horny and arrogant teens","363":"I'd rather be politically incorrect and try to protect the bullied","364":"What problems","365":"😂😂😂😂😂😂","366":"You must learn regex","367":"","368":"But some ads just don't go away.","369":"I see, you have all the quality to become admin of almost all the groups you are in.","370":"But Lisp > Forth","371":"well... I installed `rbenv` with homebrew in order to use an older version of ruby. \n\nthen ran this command (found it online) to run everything with that old version. \n\nI'm not sure where to search to help myself get out of this. \nthere must be some global requirement that I have no idea how to figure out\n\n```rbenv install 2.3.7\nrbenv global 2.3.7\nruby -v\nbundle config bin .bin --global\nbundle config path vendor\/bundle --global\nexport PATH=\".bin:$PATH\"\nGEM_PATH=vendor\/bundle```","372":"Who cares though","373":"And I just made a pong game then lol","374":"thanks","375":"Can i go there and beg for employment to become the CEO of Microsoft?","376":"so, I finally found it being applied","377":"No, at home now","378":"`- .\/backend\/shoppa-logs:\/usr\/src\/app:rw` tried this but nope..still the logs are not getting written into the host file","379":"No.","380":"Like more specifically","381":"Good morning lil one","382":"https:\/\/www.techradar.com\/amp\/news\/mozilla-and-firefox-could-be-about-to-change-the-vpn-and-privacy-market-forever","383":"Any proper video editing software","384":"(TS)","385":"sounds like a very limited version of Xeger","386":"command prompt is a slightly generic term","387":"Yes","388":"will be scammed","389":"Without Script one?","390":"Boy. What good is it?","391":"This","392":"🔩","393":"","394":"Privacy related? \n\nOr dictatorship?","395":"> if the earth is round like you say. Then why someone dedicated it's \"time\" to build a clock design.\n\n- another flat Earth fact","396":"Anything","397":"I want y'all to help me learn JavaScript","398":"SSD should be standard now","399":"","400":"YOU are warn worthy!","401":"Site Reliablity Engineering","402":"","403":"How much?","404":"Gayness in the anus","405":"working 24 hours? 🤔 \ntry the new Jack Ma style: 9-9-6","406":"Manual!","407":"I am not asking about windows","408":"Heh","409":"Mee too intj","410":"Not prod code","411":"I'm in","412":"yes","413":"though I discovered some really great projects","414":"[void](tg:\/\/user?id=513387254) https:\/\/instantview.telegram.org\/","415":"It's a browser engine, yes. Which is kinda the point of the whole thing. It comes with what it needs to work, but it's not full of things you don't need. If argue against saying it's \"bloated\"","416":"Like 19°C weather","417":"i use LTSC (Activated)","418":"It is so bloated that it was visible even on 144p","419":"I have like 100+ groups 🤨","420":"That level of strickness is not good imo","421":"Plus limiting it to the domain and samesite lax or strict","422":"I think Samsung S8 for one","423":"debian controlls the lvm for it, but the metals raid controller is what controls which disks are physically active before the LVM assigns them to the group","424":"Necro time! Was stressed out when the question was asked, now I'm feeling like talking about games. I care about accuracy of this answer probably way more than you do. This is gonna be juicy...\n\n (++great, you're missing out; +cool)\n\nI play variety of stuff in different genres (recently I finished (not 100%) and enjoyed +Super Meat Boy, not-so recently +Bastion, ++Hotline Miami 1). Some games are just so good that their genre doesn't matter as much to me.\n\nI love to make important decisions when item slots \/ resources are scarce, as in roguelikes. In moments like this, I think to myself, \"that's my game \/ genre!\". And in roguelikes, I don't have to lock-in into one build for extended period of time, as each run is fresh and relatively short. (++FTL ≈ ++Isaac > ++Downwell > +Dead Cells > Into the Breach > Necrodancer ≈ Slay the Spire ≈ Gungeon ≈ Freeware Spelunky > Convoy ≈ Organ Trail > Nuclear Throne)\n\nOn the other hand, I don't play RPGs, games which put character progression over player skill. I never did, was afraid of grind. And now I'm also concerned about the time investment required. Games like that I refer to as \"not my genre\" (`not \"my genre\" !== \"not my genre\"`, there's a lot of stuff in between)\n\nThere are some games like that that I intend to play anyway (I heard they're great), mostly Witcher and Nier Automata. Cross Code also looks interesting.\n\nI also refuse to try Factorio, I'm afraid that I'd spend too much time in it. But that might change, I'm learning to take breaks.\n\nAlso, I played a bunch of 4th wall breaking titles (++Undertale >= +DDLC >= +Stanley Parable > Pony Island > One Shot), and now anything like that immediately enters my to-play list (except Evoland, dunno why it doesn't interest me as much).\n\nAlso enjoyed some puzzle games (+Chronotron, +Braid, ++Portal 1, Crazy Machines 1) and intend to play more.","425":"> rice for fish","426":"there have not configure file :(","427":"also you cant initiate conversation from bot to user","428":"Thanks","429":"https:\/\/youtu.be\/yfi8yrP7HnQ","430":"All of them are same, actually u r hiding behind it","431":"Translate this","432":"I guess","433":"it is called: Out-of-Context-Devs or \"Running Wild and Debug Nonsenses\".","434":"That does not answer either of the two questionnsn.","435":"2 word == Dword","436":"I am in love with this thing","437":"In point, what do you think of the distributed internet as an idea? It definitely has a long way to go to get user acceptance. Case in point, convenient, safe ways to access known websites, without needing to remember\/store long hashes.\n\nRelated, I'd also like to make the point that a distributed internet is not so much about privacy as it is about not having central control. There's a misconception among some that distributed = better privacy. What's on the distributed net will be much, much harder to remove than on the regular internet.","438":"Far fetched","439":"1+0= 1","440":"Wow what a fucking bigot, disgusting","441":"Sounds quite bad to me, it doesn't add any value to your UX","442":"Yes please","443":"so you're saying I rape 4 year old kids?","444":"good job","445":"I am sure","446":"https:\/\/en.wikipedia.org\/wiki\/Category:Software_using_the_BSD_license\n\n+ several Eclipse projects (they call it EDL-1.0) + OpenSSH, literally everyone uses that","447":"yep pretty much what spark said.. but keep in mind, free tier only has 15gb free outbound data","448":"Nope","449":"Or at automatic intervals.","450":"is it saying\/asking you anything?","451":"Well myself i just find the basic c# syntax more similar to C, and even the \"extra\" stuff it has feels like it was made a bit around the C syntax. Java on the other hand has some \"special\" style syntax that i haven't really seen anywhere else and coming from a C background it feels really unnatural","452":"you crate model for post","453":"roasted lmao","454":"Wat","455":"if you removed non-ascii from Japanese-Japanese, you'd be left with nothing","456":"Insulted Iranians?","457":"🤨 Wth","458":"i will throw metaphorical rocks at your house","459":"lol","460":"Created by [@GingerPlusPlus](http:\/\/t.me\/GingerPlusPlus), powered by rextester.com.","461":"Lol","462":"Because he can't read.","463":"perl, Ruby on rails etc","464":"lol, the meme will never die","465":"More importantly, I'm going to read contracts more carefully. But ideally I would like such contributions to be part of my work too.","466":"You're 15","467":"But how specificity will affect it?","468":"XML is more realistic as it's turing complete","469":"^","470":"But then they're just interactive books.","471":"Which books is best for machine learning and devops","472":"You are just the fuel","473":"I don't think you can find a cool eye photo that isn't monster-style","474":"need root","475":"He is a boring superhero","476":"i did that in about 1 or 2 hours","477":"same","478":"means go back to prehistoric epoch","479":"The hassle with the mouse is both typing then the mouse","480":"Both are by definitions a different approach to facism, both are sexist and racist ASF, etc","481":"Also language, sometimes","482":"android group","483":"Can we embedd javascript widget in angular app","484":"x10","485":"and, I'm also a gamer, that's why I have Windows in the first place","486":"here in Spain these days there is an activist from palestine","487":"Lemme send some code","488":"Latency is not refresh rate\n\nLatency is latency","489":"**public** key","490":"How it was a meme back then too","491":"Rxjs is sick","492":"too much tech talk","493":"thanks, I could hate myself more, the truth is I don't know what I'm saying, I'm new to this and I would appreciate the guide","494":"No. It came from Apple launchd","495":"😁😁😁","496":"done!","497":"even embedded os can be based on webassembly","498":"but it's not finalized yet","499":"mathematically it's possible","500":"Well if people are gonna stirr up trouble they will be stopped","501":"","502":"https:\/\/www.cnet.com\/news\/two-people-fired-over-pycon-dongle-joke\/","503":"Cool","504":"👍","505":"yes, but afaik vibrancy plugin doesnt work on linux","506":"That's how everyone learns things.","507":"hey guys","508":"r\/creepyasteriks","509":"What is that Hitler label ?","510":"سلام😁","511":"Use gohugo.io or Jekyll","512":"not going into it :p","513":"plus all of these are not original. the crappy quality and double statusbar shows that they have been sent and compressed over 100s of times","514":"Don't get it, it's too easy.","515":"Engineering college","516":"Not true","517":"https:\/\/youtu.be\/H27rfr59RiE","518":"Even if it is a show persona","519":"xd","520":"Anybody has a way to use it with Google pay?","521":"Or python","522":"since my account is permanently suspended I can't even close it I think","523":"What do you mean?","524":"yeah, but you mentioned UI, what exactly in the UI?","525":"i use emu8086","526":"Wickrme is great too.","527":"I should stop saying this, literally everyone says anything except \"Who?\"","528":"I made lists in batch","529":"lol","530":"","531":"if murder wasn't a crime, you would be lying in dani's pool right now","532":"thats really really nice","533":"apparently so","534":"@Edwing123 that is awesome but weird😂😂","535":"You sent a meme and you did not even notice","536":"ah","537":"Åh","538":"0.o","539":"ah i don't have anything to show on this phone\n\nmaybe I'll remeber at home","540":"@GingerPlusPlus  what is this error in guard-bot?","541":"Some Times You Need To Download Cracks","542":"You are going to Scranton Business Park","543":"Gn bro.","544":"if you don't participate in politics you're not even a human","545":"Or the Greek","546":"3","547":"its usually measured in gr\/dl if its 8.2 gr\/dl then yeah its kinda low","548":"Maybe it's programming, it keeps the nervous system active all the time","549":"Is windows 7 is still good to use?","550":"u ded?","551":"There's a time limit for the message that is invisible in the recent actions, but you can hide that you edited the message from there. May I use animations now, they don't spam the recent actions anymore?","552":"Have you created a script for editing the message in mimiliseconds","553":"Don’t be racist","554":"Abstract, get into detail","555":"advanced society imo","556":"The endpoint is fine, it works as intended, I've used it before and works, it still works for some of the requests but not sure why it behaves this way","557":"They understand global politics & economy as they are touched by it now.. so it's understandable\n\nAlso they got enough padding to take these steps","558":"Takk fyrir! (Icelandic)","559":"the point would be letting gamers (who do rely on up-to-date drivers) mine in their off time","560":"ThinkPad","561":"This is pip","562":"Hi guys my I have MacBook air with Ubuntu os installed, i switched on my laptop today and after turning on for some time it turns off i try to turn on again but it can't.","563":"For a relic","564":"I am in love already, 😍😍😍","565":"rip","566":"Xiaomi just asks permissions to write data to Apple Health","567":"","568":"nei","569":"You could sell literal magic to people","570":"That's honestly hard to believe","571":"In Unity you don't even need to write code at the beginning, you can just connect nodes and get a shooter game","572":"Oo","573":"","574":"","575":"this group is going way offtopic","576":"Can Elon musk buy Russian and close up their military, so we all can have peace","577":"practical examinations are one day things, anything can go wrong and you are done, I value assignments much more as it aligns much more with continuous learning and gives the person time to explore","578":"\/random does 0 requests, amortized","579":"That would explain a lot :v","580":"It would be awesome if we could achieve something like fail2ban but for telegram","581":"Am making it your job now, now start coding how I can confirm my btc my self, oh and do it behind btc company backs","582":"don't discuss it because it is not answerable not because of stupid rules that takes ur freedom","583":"Old but gold","584":"I just try to encourage people to look stuff up by themselves and use resources readily available on the internet, they can be using arch or Ubuntu or Mint or anything of their choice","585":"Laptop is over there xd","586":"just wondering","587":"was long ago","588":"When you know the type, you know what methods it has","589":"This does happen in some places","590":"Because if clang is released under a permissive liscense, Apple gets free developers without paying a single cent.","591":"Not you","592":"unpaid intern was a lot funnier than weeb","593":"So you arr the one who writes browser engines so it renders html?","594":"LastPass is a good product","595":"Hello\nI'm sending this from Iran\nNowadays there's very poor internet connection, people are arrested and killed by government\nWe need the world to hear us more than before\n\nHow can you help us in these difficulties?","596":"Where did you get the idea to use Kali for web development?","597":"Nah I'm in Canada screw you XD","598":"that's the girl","599":"Essentially, run the application in the debugger, and examine the contents of the `imageReference` object. You'll have to work backwards from that point to see what is wrong with it.","600":"> new\n> awesome\n\ndid you mean 1960's?\ndid you mean retarded?","601":"Soundcloud suggestions arent too shabby either","602":"by prompting with a box that says are you over 16?","603":"Not really also most of Rust stuff is somewhere between stable and alpha.","604":"Apparently natives didn't exist","605":"Wth is your profile picture history lol","606":"I'm doing the same but in C\/C++ and low level high performance invocations","607":"added the 2020 one :p","608":"even if I use rextester for it? 😆","609":"better than this one","610":"Iframe","611":"I wanted to tag @elanseca","612":"Im looking to hire senior developer with 500 years experience salary from 1k to 1.5k, knowing all possible languages in existence is a plus","613":"Java is lob","614":"if you can write a brainfuck interpreter in something, then that thing is in fact a full fledged computer","615":"like if the interval is 24 hours, I cba for webhooks, go straight for cron","616":"with Amazon Prime + Netflix you can pretty much watch every movie and series in existence tbh","617":"And then I will pardon him seeing what his bans are","618":"There was 4..","619":"I am terrified that you're setting up mail and not even knowing how to stop a process","620":"the bot takes PMs iirc","621":"XD","622":"Essentially","623":"Now that part vanished i thought something wud come up😒","624":"I think some tech is political, and some people in tech are political, but tech isn't inherently political","625":"Nah yeah","626":"","627":"just googled","628":"He ended up falling for Lisbon anyway so that's that","629":"As long as I finished the work and sent them","630":"or muslim messiah? \n\nislam is new word i hear in english.","631":".....","632":"Told me what?","633":"🐸 I am not afraid","634":"hot daddy","635":"https:\/\/discuss.atom.io\/t\/how-do-i-delete-a-file-folder-permanently-in-atom-tree-view-without-moving-to-trash\/26826","636":"I have a 2 months notice period, it sucks the happiness out of me","637":"I don't understand the point of consoles","638":"I have a Samsung TV (UE55NU7023K) which is a strange model, I get notifications for a new firmware update but I'm unable to do the update.\n\nThings that I'm certain about:\nThis software version is moded.\nI did a TCP dump and verified that no request is hitting Samsung also no DNS query for Samsung as well.\n\nI also tried to do manual update but I couldn't find the firmware on Samsungs website.\n\nOnline demos for this model shows a different app store that has Spotify, emby and YouTube...\n\nSo, I really need help. I want to get ride of this moded firmware.","639":"Thanks I intend for the project to be small and done in about 2 days.\n\nIs OOP a programming pattern or do you mean throwing something like MVC on top of it?","640":"nice","641":"With your hands retard","642":"**Result**:\n```@solooo7\n@solooo7\n@solooo7\n@solooo7\n@solooo7\n@solooo7\n@solooo7\n@solooo7\n@solooo7\n@solooo7```","643":"But I'm so lazy and worried to do it on my main","644":"I wonder how many people get muted in that","645":"\"Too slow\" depends on your usecase","646":"who ?","647":"Just solder?","648":"and always ads came up on youtube with on what i say on chats whatsapp and the links I open on google news","649":"Which part ?","650":"It is","651":"I dunno if it's your first time using vscode, wait for indexing to be done.","652":"Or I must borrow your a..ss.!!😂","653":"Would prefer that you did that over insulting me due to lack of experience and then just proving you too, lack experience by being unable to provide any proof or rebuttal of your BS and then just result to a copypasta that isn't valid anymore and then be all egotistical about \"be destroyed\" because you finally gained enough intellectual complexity to learn the basics of debating rather than illogical insulting and bs, so ye, tomorrow do send an ACTUAL list please. Gimp has problems. Everything does. Gimp isn't perfect, nothing is. But to say it's a toy and that it in no way is good enough for art production and then just avoiding by saying \"you just don't have experience\" and then pull an outdated copypasta is just a bit of an illogical stretch to me that makes me question if you've ever even opened Photoshop or Gimp.","654":"Simon the Savage","655":"lmao","656":"forgot its name, starts with an `r`","657":"mmm","658":"DM me a voice clip? 😅","659":"I am just talking about ui","660":"try and make more sense when you rephrase that","661":"quick question: is it possible to remove everything from my google account except gmail\/contacts ?","662":"I'm not in a mood of reading code","663":"buldoze","664":"Guess it's fixed.\n\nAlthough a - 1 should return some results, looks like a try catch tbh","665":"Or at least, node does, easily doable in browsers with IIFE's too","666":"probably ios bug?","667":"since most people don't move that often","668":"lol","669":"Who cares","670":"To an infinite extent yes","671":"Not a joke","672":"ok that makes sense. so, clementine build system removes the options that'll invoke the features I commented in cmakelists. there is no way to invoke those features and everything keeps working...","673":"I plan to get one.","674":"Avatar ?","675":"Define gateway","676":"Hi !","677":"Guys wanna make something better than others","678":"It kinda __literally__ does so...","679":"hahah","680":"Not sure","681":"1. go to google\n2. search :D","682":"Hash","683":"Not enough to turn things around","684":"?","685":"Well, she's probably even more judgemental, so I'm just giving you the hard truth","686":"people discussing linux","687":"also less using of resources","688":"Thank you","689":"what's the best backend web environment programming language ?","690":"80s American Dream.","691":"Nope","692":"There's a difference.","693":"Well ye for channels it's way better","694":"even darker on a turned off screen","695":"krkrkr","696":"👍👍","697":"that's code style though","698":"Since when did nosql dbs started offering ACID properties","699":"Maybe, don't store >n items of history","700":"Well sorry, none of the children in my family were 😂","701":"Why do I need to learn bisection method, Newton raphson method, Lagrange interpolation 😞","702":"The primitive?\n```lambda```","703":"Serverside searching?","704":"Hah, Tim cooks was Steve's handpicked","705":"saw that too","706":"I think\/believe","707":"🤣","708":"","709":"","710":"!ban being a smartass :P","711":"disable read access but not write acces for everyone until they say a magic word","712":"uh where are your sources for this","713":"nice, did you succeed? :p","714":"lmfao","715":"nice userpic, btw., annoying IE?","716":"i want the compiler to compile every file in all subdirectories","717":"News_List?","718":"Nah, just trolling. Im 10","719":"duckduckgo ad in youtube 😐","720":"Hey ginger type fast","721":"@Opp3nh31m3r may I PM you please","722":"Created by [@GingerPlusPlus](http:\/\/t.me\/GingerPlusPlus), powered by rextester.com.","723":"Come join us","724":"@C0rn3j \nWhy he's putting on those socks?","725":"And I don't need to know it all the way down","726":"","727":"Is there any bot ?","728":"smart thinking","729":"ö","730":"now lets see","731":"not to bully you or smthn, but you should try","732":"lmao","733":"Which model is it ?","734":"Quote literally means a citation of some sort","735":"Please stop turning this room into deemix offtopic","736":"I stopped using Google search years ago","737":":))","738":"lol","739":"Just 1-2 minutes","740":"`> The hard cold fact of the matter is: CPU cycles are cheap. Developer hours are not.`\n\nOnly a Rails apologist would say this in 2019.","741":"@watzon","742":"and a lot of people who have guns","743":"Like how is a beginner supposed to keep up with that ?","744":"hi, when using docker compose, if I rebuild service B using \n```docker-compose up --build --force-recreate --no-deps -d B\n```and service A depends on B, what happens to service A while B is being rebuilt?","745":"","746":"Lowkey like over half of everything on The Bugs is just from Programming Humour 😂","747":"For those of you that Celsius, that's about 32 degrees","748":"codelens adds, lsp adds, vscode-vim adds a lot","749":"What the fuck, are you a bot or not?","750":"","751":"good language....","752":"so noice","753":"how can you forget the email?","754":"Do you have one in github ?","755":"and i won't fall for that again","756":"This is the thing they use to secure secret chats.","757":"I'm many other things besides that. One of them being winner of a trophy in a competition run by the gov","758":"🤷","759":"👀","760":"Stay right there I'm calling the military","761":"","762":"Oof","763":"Like norwegian ones","764":"Amount of stuff you have to do to just make a first push is huge","765":"bruh just quit","766":"wow dude tf?","767":"i am blong to dinosour age","768":"\"but still __expect__ it\"","769":"I'm not saying you are wrong, I just said show me the path to find the right answer, to be confident about this thing, as you are, and you keep atacking :D","770":"You can though","771":"M2 or Sata?","772":"Universe's halted. 😂","773":"There is less commits every day","774":"https:\/\/medium.com\/tensorflow\/amd-rocm-gpu-support-for-tensorflow-33c78cc6a6cf","775":"It only \"predicts\" what words would be most likely as an answer for the question. When we come back to the lawyer who used chatgpt for \"research\": it produced an number that had an high probability that would be correct and when the qhestion came \"is this true\" the most likely answer was yes, since this question is mostly answered with an confirmation.","776":"Fake chrome for example.","777":"nice snaplines on Minecraft","778":"I literally had only added debugging info","779":"android group","780":"wtf","781":"Via nodejs","782":"no idea why tf they chose helsinki","783":"I'm flattered","784":"\"maybe it's a trick to get people to move to GitLab and then they'll buy GitLab instead for much cheaper\"","785":"So are mine, just the other direction xD","786":"I don't judge people from YouTube Videos.\nThat are in quick overview style.","787":"`if platform == “Electron”\nBad()\nelse\nGood()`","788":"my own selfhosted","789":"waid which nancy is dis","790":"or just \"key stretching\"","791":"no. he said that it holds the paste","792":"Would be hundreds of lines","793":"oh okay. Phew for a moment i thought i banned someone without any reason lol","794":"","795":"Can anyone tell me that where I am getting wrong.I had tried to sort this problem by myself and Google but not able to solve it.Pls anyone who knows then help me","796":"Find out","797":"It's when encryption keys on two sides are different and not being sent","798":"Fact lmao I'm strong independent gay man","799":"I code as a hobby i never code for 10 hours but i would take a diclofenac instead of changing eclipse","800":"Because why not.","801":"Because they were written by non natives","802":"tbh i don't really see a difference haha, but if it works out for you 👍","803":"In this group\n\nWho have sim card from usa ?","804":"ohh god...","805":"We seek our desires.","806":"Fixed","807":"this is the india after high school existential crisis chat","808":"But you are using emojis. that's how it starts. next thing you know is u strt tlkin lyk dem","809":"I misread this for some reason","810":"but they are really difficult to answer","811":"it's getting warmer","812":"etc.","813":"aka PS1 modifications","814":"so r u Indian","815":"Why sometimes some UI parts of Chrome and Qt applications like Telegram's desktop client don't respond to mouse?\nWin32, FireMonkey, JavaFX and AWT ones are fine","816":"XD","817":"Happy birthday 🎂","818":"try `del`","819":"If it is true then I don't need to do anything\nJust use that money","820":"I should","821":"flutter framework","822":"Geocities lolol","823":"Bitcoin miners?","824":"Also that high salary means higher knowledge","825":"😂","826":"I booted windows now","827":"Venezuela, Russia and Iran","828":"Kogami Shinya 👌🏻","829":"but you can see how to proxy request to nodejs service","830":"I’ll do later","831":"Userbot?","832":"the only one dank enough","833":"Well that's not how it works in C. [citation needed]","834":"really no typescript group?","835":"looking sharp","836":"Write C++","837":"Yayyyy 😂😂😂😂😘","838":"lol some idiots don't learn","839":"and It seems NaN is not a constractor either","840":"why not move to base 1?","841":"do we?","842":"Arabs seem to have a high quote of homosexuals 🤔","843":"Once you have >200Mbits\/s the bottleneck becomes the servers you communicate with","844":"i can create infinite chrome profiles why would i need a vm","845":"$2,695 (USD)","846":"Assembly is abstract from hardware.","847":"Yes, bring him back.","848":"nvm","849":"`\/usr\/local\/Cellar\/go\/1.16\/bin\/go` `version`","850":"seriously though, top 10 results or so on google is just for the Transmission torrent client. XD","851":"My English isn't good enough to explain German right good enough. Sorry. German law isn't even easy to understand if you speak German.  XD","852":"Some programming langauges have kernels","853":"btw dont be shock","854":"😂","855":"hello","856":"Wat","857":"And what do you think about russian music?","858":"cool language, but I'm learning golang nowadays","859":"24% RAM being taken up","860":"I'll register on the site, please share the link","861":"Oh shit","862":"Windows(Default) and Rainwater iirc","863":"Merkel","864":"No backups :(","865":"What is the average for a python dev?","866":"idk","867":"Ok👍","868":"other examples include 0\/0, ∞\/∞ and 0^∞","869":"Yeah I can see what you're getting at","870":"when you compile java into a .class","871":"dude — when you kill yourself — please don't get brain matter on the wall","872":"What do you want to see as proof tell me","873":"BJs","874":"Why","875":"Today I learned Yahoo is still around","876":"kungfu panda, well technically yes but it is more a cartoon","877":"Like 12 or so","878":"","879":"*slaps cock*","880":"That's the point of Apple devices anyways lol","881":"Mostly on lists and trees","882":"\"No one would pay that much if they'd treat her badly\"","883":"I'm offended","884":"Didn't get you.. You mean if I commit to a month?","885":"Well you actually can code a kernel it html.","886":"Yeah, pretty much all of them","887":"Because they're bots","888":"websites on the other hand... just don't.","889":"the python interpreter command line is basically a REPL","890":"Not Balkan.","891":"Huh, there are no free drivers for modern WiFi chips?","892":"Attending doctor\/mufti\/senior programmer does nothing but supervising","893":"It is not agpl?","894":"what do you need?","895":"😵 Nobody knows anything correctly","896":"Is freezing for me XD","897":"o.O ok","898":"Conversion to furry : 15%complete","899":"Oh, interesting","900":"It spies you on telegram","901":"is raspi considered IoT?","902":"I can restrict the time I am on telegram","903":"https:\/\/store.steampowered.com\/app\/330020\/Children_of_Morta\/","904":"Yep.. but maybe there's some specific framework. or u have some advice","905":"post October he'll be spark again","906":"Can i change it to 64?","907":"Would have to be a lot of fucking messages in the queue to have this problem, and it SOUNDS rare... but for an OS that may have years of uptime, then it sounds not-so-rare","908":"Clearly MacOS Telegram hasn't jumped from 2.0 to 6.0","909":"vim is alright","910":"How do you want it to tell you?","911":"I think this is how drunk people see the world through their eyes. Lots of flashing and zooms","912":"Wheww","913":"you're a special one","914":"😂😂","915":"devs bot or devs writer bot?","916":"Any last words?","917":"yup","918":"shit","919":"","920":"Are you aware that folders exist?","921":"🤣🤣🤣","922":"Anyone see Rush Hour 2","923":"First one","924":"visualstudio is so fucking jank","925":"Ik","926":"did i ask if you're concerned or not?","927":"finds everything in microsecends","928":"I see a option at the top to search with a checkbox text with \"re\", I am thinking that you can do regular expression search with this option.\n\nHave you tried this?","929":"why use j-pake if you can feed a random password into pbkdf2 with a high number of iterations and use the resulting key for the encryption?\nsince the end-user always has to type that password in the other end","930":"Why can't u just go to 66656!","931":"Alright","932":"No😐\n\nI don't have corona","933":"I like her songs","934":"Which liberal values?","935":"lol","936":"My   laptop uses 99-100 percent of cpu when i use it while plugged in via power supply but reduces to 50 percent when on battery power with vm on.. Is this how its supposed to use cpu or something is wrong??","937":"Just because nature is of war, doesn't mean I want it that way.","938":"How can I run the single Node File from command line with DotEnv file\n\n\/\/Basically I use the following to run the javascript file\nnode MailTest.js\n\nBut how can I tell it to use DotEnv variable","939":"Any iOS developers group?","940":"It's a virtualisation technology native to Windows","941":"It's not about the code, I guess","942":"Do you mean directory traversal?","943":"The fact that you like it doesn't mean you need it","944":"Here are bigger and stable apps in php","945":"I prefer java because I'm proficient in java.","946":"or they are trying to improve the quality of their service by weeding out spam accounts and inactive users","947":"for programmer its fine maybe","948":"Got to the 2nd boss, and I'm like, eh","949":"It's easy","950":"Better than putting)","951":"Hopeless","952":"I'd say that it's effectively 2d, top down, with some perspective, but some elements have height as well","953":"It's supposed to do everything for you by just enabling it.","954":"^","955":"also I agree\n\nunless it's doing general damage","956":"Do all exercises of SICP and seriously you'll learn some math in between","957":"and I've got some people to ask translation to","958":"(╯°□°）╯︵ ┻━┻","959":"oh yeah ik that. we're pretty much engaged with them","960":"Money isn't everything, but a necessity","961":"Just say \"ONLY I HAVE THE RIGHTS TO USE THIS CODE\"","962":"+1","963":"It's almost the same in INR","964":"I assume there's some sort of obfuscation \/ compilation happening to hide source anyway?","965":"How can i get free .com domain ?","966":"It looks good,\nCould it be a font-weight problem?","967":"apl","968":"thats what come to my mind","969":"but i cant use elliptic curve for encryption, so whats the alternative?","970":"I can help you ... With street English 😉","971":"time-frame for what?","972":"The community edition is free and open source, what if i consider buying the full edition ? Is it open source ?","973":"cs 1.6😍😍😍","974":"Yeah so its only me 😑","975":"🤔\ni must buy VPS from US!\n\nthen upload from there 😐","976":"Yup like that","977":"sar fix your userbot kthnkx","978":"That's maybe better to leave","979":"She is 😒","980":"im on mobile on vacation in brittain right now","981":"I'm browsing it rn","982":"hi\nim trying to build a chat app i figured out the text messaging part but i have no idea how to make video and audio chat and ultimatly how to scale it\ncan anybody give me a hint?","983":"What. An. Odd. Resolution.","984":"thanks saved hah","985":"The official one for Android","986":"`--pedantic:` well, there are quotes, and strings.","987":"[Dj](tg:\/\/user?id=820251957)","988":"Wow how? 😮","989":"He can pm me and I'll gladly send him some pics","990":"Don't you live in an urban area? No electronic stores?","991":"no need to argue with mean solar time","992":"Wanna see somthing cool","993":"It depends on your field, are you developer that require heavy use of graphics?","994":"you're literally talking to one -_-","995":"Uhhhh","996":"do you do drugs ?  😆","997":"Closures in rust don't strictly require type annotation.","998":"How do you like my sunrise","999":"\"how to run gcam on Samsung a6+\""}}