{"text":{"0":"","1":"По очереди сверху вниз","2":"","3":"Привет) подскажите плиз - решил поучить вебпак, почему у меня не рендерится шаблон? И вообще вью не работает(","4":"пока рандомом генерирую 0.1321231, может поэтому?","5":"Тогда в чем вопрос?","6":"TS на больших проектах должен быть. На маленьких и стабильных сильно не меняющихся можно без него. Есть правило там где ты знаешь тип переменной на этапе компиляции - определи её с типом. Это логично и предотвратит кучу проблем в будущем.","7":"Приезжай","8":"чиво-чиво?  запросы к бд с ноды? это как вообще с нюкстом связано?","9":"бомба, молодец)","10":"ну да, имеется форма где он заполняет данные) там фио и так далее) и загружает фотку) и например фотка весит много) надо сжать) фронт это делает или на стороне бэка?)","11":"кажется речь о том чтобы текст менялся","12":"Ну если нет не сср компонентов, то почему бы и нет","13":"И спустился менеджер с небес и сказал: \"Нарекаю тебя сеньором\"","14":"если у тебя одностраничное приложение на вуе, то можно просто переходить по навигационным ссылкам, которые загружают контент без перезагрузки","15":"какую команду?","16":"Вахтёров завезли","17":"```email: [\n            { required: true, message: 'Please enter you email address', trigger: 'blur' },\n            { type: 'email', message: 'Please enter a valid email address', trigger: 'blur' },\n          ],```","18":"Вроде первым формируется виртуальный дом, а потом рисуется, а не наоборот","19":"Привет! Как реализовать такую задачу ?\nЕсть миникарта мест кинотеатра и есть панорамная карта.\nНужно их связать.\nПри выборе места на миникарте - места появляются и на панорамной карте. И наоборот соответственно.\nНужно ли стор заводить ?\nВо вью новичок.\nЕсли можно, по пунктам скажите, как две карты так связать ?","20":"Фу такой быть","21":"ну я нашёл другой способ решить эту проблемму. это исполльзовать swiper.slideNext()","22":"его можно добавить в проект или надо с нуля писать если используешь cordova","23":"да","24":"я бы в тебя кинул помидор","25":"в аське знакомиться с домохозяйками.","26":"спасибо, это уже нашел, затащил, кручу","27":"Я дико извиняюсь, но есть куча норм редакторов с вуем, от саблайма до интеледжи идеи","28":"в data","29":"Помню такое","30":"Ох много чего придеться  учить","31":"это сарказм?","32":"а еще выноси всё ищ этого компутеда в мапСтейт","33":"Почему неподдерживаемый?","34":"Что-то у меня сомнение что такое есть.","35":"На vue2 вите?","36":"модули под другую версию ноды, или переключи, либо снеси node-modules и поставь заново","37":"видимо не понял. спрашиваю как лучше организовать структуру:\n1) выбирать свойства через DOM\n2) хранить аналогичный массив, но тут уже вопрос как отображать массив реактивно","38":"ну а если мне нужны такие манипуляции как на jquery, что тогда делать?","39":"Ок. Так должно работать?\n\n```watch: {\n    templateField: (val) => {\n      this.renderedField = val.replace(\n        \/\\{\\{\\s?(\\w*)\\s?\\}\\}\/g,\n        (match, value) => this.tableItems[value]\n      )\n    }\n  },```","40":"Ну я как раз про это, что тестят на себе - работает, а у дригих нет","41":"проблема в том что я в силу своей законопослушности перетащил часть барахла на отечественный vscale","42":")) тут один челодой моловек утверждал что у него опыт во vue больше самого возраста vue","43":"Понятно","44":"Тогда да, это больно. Обычно всякий ужас ещё на этапе просмотра эйчара отваливается. А я представляю сколько откликов на условного джуна","45":"<my-checkbox\n  :checked=\"foo\"\n  @change=\"val => { foo = val }\"\n  value=\"some value\">\n<\/my-checkbox>","46":"Так и есть. Только без ssr, интеграции с дефтулсами, документации и плагинов.\n\nЕсли от глобального стейта особо ничего не нужен, кроме как условно данные юзера хранить, можно обойтись без доп либы","47":"короче, я хочу так сделать","48":"(как минимум в своих проектах так точно)","49":"например вот такое что бы можно было использовать везде на уровне пропсов компонента\n   \n mt0: {\n      type: Boolean,\n      default: false\n    }\n...\n classes () {\n      return {\n        [this.$style.WebTitle_mt0]: this.mt0\n      }\n    }\n...\n&_mt0 {\n    margin-top: 0;\n  }","50":"так им проще суциднуться кабель то и их тоже","51":"","52":"Чёт не соображу, вроде CORS блокирует:\nXMLHttpRequest cannot load http:\/\/localhost:8000\/api\/shop\/get-product-list. Redirect from 'http:\/\/localhost:8000\/api\/shop\/get-product-list' to 'http:\/\/localhost:8000\/api\/shop\/get-product-list\/' has been blocked by CORS policy: The value of the 'Access-Control-Allow-Origin' header in the response must not be the wildcard '*' when the request's credentials mode is 'include'. Origin 'http:\/\/localhost:8080' is therefore not allowed access. The credentials mode of requests initiated by the XMLHttpRequest is controlled by the withCredentials attribute.\n\n, но я ему всего подряд написал:\n\nCORS_ORIGIN_ALLOW_ALL = False\n\nCORS_ORIGIN_WHITELIST = (\n    'localhost:8080',\n    '127.0.0.1:8080',\n)\n\nCSRF_TRUSTED_ORIGINS = (\n    'localhost:8080',\n    '127.0.0.1:8080',\n    '127.0.0.1:8000',\n    'localhost:8000'\n)\n\nCORS_ALLOW_CREDENTIALS = True","53":"Алексей Александрович, забыл отписаться, всё получилось! Спасибо за помощь 👍😌","54":"ну не то чтобы прям часто но иногда вполне","55":"width зависит от значения ширины экрана или тебе нужно определенные брейкпоинты?\n\nПопробуй https:\/\/vueuse.org\/core\/useMediaQuery\/","56":"именно","57":"напиши геттер, попробуй геттером вывести","58":"Настрой сборку статики в папку сайта и ебош","59":"Можно, но vue здесь роли не играет","60":"Я могу например как-то стриггерить запуск функции в другом файле, через вуе и передать туда параметры?","61":"та не за что, я правда не знаю поможет ли, с таким просто не сталкивался)","62":"Спасибо👍","63":"methods:{\n  formatYear(e){\n     return String(e).substring(0,4);\n  }\n}","64":"storage недоступна извне по url,чтобы получить к ней доступ надо сделать символическую ссылку в public до storage","65":"да я тебе выше же написал, что мне кажется, когда ты используешь выражение в доме, то вью создает аналог компьтеда для этого выражения, если у тебя в нем участвует реативное свойство, скорее всего это так","66":"$emit('on')\n@on \n:}","67":"а, ну спасибо, попробую сделать по вашему","68":"Ага потом окажется что тебя послушал) Точно это нормальным считается?","69":"Другой вопрос, зачем","70":"@admins","71":"И хидер должен соответственно называться","72":"Ты понял вопрос? Оо","73":"делай грид и байнди что надо","74":"Ещё сбоку добавить и снизу рекламу на 20% экрана","75":"Впервые такое говорю - но ты аутист","76":"сброс","77":"Я точно помню, что есть, но в своём списочке либ что-то не нашёл быстрым взглядом)\nТут прям сильно надо завязываться ан vue? Вы искали просто либы, не под vue?","78":"Орм это мапа бд","79":"а где ловишь - покажи.","80":"Работаю с асинхронным приложением. при первом запуске вылезают ошибки потому что запрос не успевает прийти","81":"https:\/\/t.me\/vuejs_ru\/1285075","82":"для в модель есть статья в доке","83":"https:\/\/www.chromium.org\/Home\/chromium-security\/prefer-secure-origins-for-powerful-new-features\/","84":"Проект уже был с бутстрапом","85":"","86":"","87":"https:\/\/github.com\/nuxt\/nuxt.js\/issues\/2596","88":"Аудиокниги спасают","89":"в смысле отдельно?","90":"Насколько? )","91":"Миксин","92":"я на элемент вообще не могу нажать, даже сделав .native","93":"Поздравляю вас с 9 маем. Какая разница Русский , Украинец , Кавказец. Все наши продеды воевали против фашистов. С днем победы","94":"Еще вопрос - имеет ли смысл типизировать данные от от сервера?","95":"Сил не хватает. Самые интересные проекты просираю) целеустремленности не хватает если честно","96":"Предлагаю ознакомиться с документацией axios. Вопросы должны отпасть после этого)","97":"Это мегаупоротости","98":"Если геттеры у тебя прописаны в mapGetters,просто добавь this","99":"https:\/\/t.me\/vuejs_ru\/815632 было давно уже хДДД","100":"Не раскачивайте лодку!","101":"todoList берется из vuex стэйта, но почему-то не выполняется условие, вопрос почему?","102":"Как-то так","103":"Ну и что? А где вызывать экшен чтобы заставить его подгрузить данные?","104":"ну просто должно ли быть так что src должны лежать изображения? для чего просто папка assets там?) почему то же на старте иначе в конфиге прописано)","105":"Не сработало","106":"Неправда.","107":"А можно и без timezone средствами moment","108":"Старый запрос не отправляется....","109":"Думаешь скоро обгонит реакт ?","110":"thx , но у меня на элементы массива ,  watcher  на все элементы, количество элементов тоже могут  меняться","111":"понимаю","112":"Признайся сразу, это потому что Vue3 не будет","113":"у меня 3й вью","114":"","115":"не помогает","116":"не?","117":"ну вот вопрос, а вебсокет может меньше потребляет ресурса чем делать короткие запросы?","118":"кешируется как то","119":"Вакуку? И почему про реакт спрашиваете в сообществе Vue? )","120":"Странно","121":"чет не пойму, как получить c помощью $attrs fromDate","122":"Тем более","123":"да","124":"Вот именно, этим и плох провайд\/инжект","125":"ну и с ansi тоже проверьте конечно","126":"Да","127":"Понял, спасибо, попробую!","128":"К числу","129":"this.$refs.searchbar.$el.focus(); ?","130":"вообще так себе практика, что твой код изменяется не по твоему велению","131":"Ну что за негатив","132":"[0,0,0,0,0,0,0,0,0,0] - начальное состояние и 0 может меняться по индексу из предыдущего массива","133":"если самописный, то глянь на реализацию визивигов каки-нибдуь, там посмотри как они фолбэки для разных браузеров делают. Я когда свой визивинг делал вешался в некоторых моментах на разных браузерах","134":"А у меня будет на странице от 2 до 20 datepicker ов (фильтры для таблицы) и мне нужно получить и строки с датами и айдишник определенный, чтобы queryString составить для бэкендера","135":"можно и бесплатные попроходить + делать какой нибудь домашний проект","136":"по идее","137":"Окей. На firefox девтул чтот не определяет","138":"Добавь","139":"Ну а что мешает фильтры при v-model?","140":"Вообще зачисти общение людей","141":"На body случайно нет display flex ?","142":"Самое правильное конечно просто в options (в сам компонент) перенести как написал @muz_toxa","143":"та без проблем, я просто советую, наверное банальное подскажу, попробуй вместо этого сравнивать эти айди через innerText","144":"вот не знаю как это пишется. поможешь?","145":"он слишком умный","146":"Ладно, ребят, забейте, займусь этим на досуге сам.","147":"спасибо, заработало)","148":"ребята, хватит тыкать куда попало\nбот работает не так","149":"Может кто сталкивался, в модуле store у меня есть строка\nvueApp.$router.replace('\/')\n\nделаю юнит-тесты и ругается что vueApp is not defined\nхотя делаю и так даже...\nconst vueApp = { $router: { replace: jest.fn() } }}\nСпасибо","150":"чё не? можно 3д фигурки делать и на 2д выводить.","151":"а общее вот как раз в миксин :D","152":"в nuxt свой есть","153":"я вот теперь например вообще против открытия кода до начала бета-тестирования (но это личное мнение, не мнение команды)","154":"это default props value тогда уж)\nдолжно работать и просто :src=\"require(...)\"","155":"И так и через декораторы с классами","156":"есть задача по обновлению данных профиля, если была удалена нотификация из др стейта","157":"component (v-if=false) никогда не инициализируется","158":"Нужно меньше смотреть презентации","159":"Коллеги, кто подскажет может есть какие-то генераторы canvas анимации для создания абстрактных фонов по типу таких:","160":"зависит от того меняется ли пропс в процессе работы компонента. в простом случае spread или object.assign","161":"Как сделать такое если нету ES5+?","162":"только так ?","163":"в общем","164":"перед defineComponent","165":"names является реактивным в данном случае ?","166":"Ну у тебя же крутые сайтики которые ты можешь в одно рыло все оттестить, действительно о чем я","167":"А понял","168":"Вы пишете на JS с использованием Vue","169":"Проблема в неохоте осилить computed","170":"Ммм, странно, у меня вообще не показывало, даже с рутом","171":"","172":"ну авторизация с чатами все равно никак не связана, так что она должна жить совершенно в другом месте","173":"Её запрашивать будет браузер","174":"Там уже через v_html сделали)","175":"Ок, думал может как то можно через ref атрибут сделать","176":"напомните пожалуйста как отключить #","177":"ну вот тебе квест, пощупать и сказать как оно","178":"лол, необязательно. там ведь несколько значений","179":"а для пхп сервер какой то используется?","180":"\/ в начале пути добавь","181":"слушай, ну когда как, я не юзаю engine битры, юзал чистый вью+ битра, там проблема с роутингом начинается","182":"Думаю с дочерними","183":"fetch более низкоуровневый, с ним надо писать больше кода + больше бойлерплейтного","184":"И тогда будет","185":"Но он работает, console log из watch запускается, просто ререндера нету","186":"нужно просто научиться нормально кодить изначально","187":"Почему touch мутирует значение ?","188":"понял","189":"","190":"есть мега метод )","191":"поэтому и кривой архитектуры не может быть","192":"Chart js кидает ошибку length... скопировал код из примера, установив npm install эту либу","193":"Но зачем?","194":"когда надо все равно знать англ","195":"Всем привет! Подскажите пожалуйста причину проблемы:\nЕсли я вызываю action getSystemMode из App.vue или HeaderComponent, то в запросе домен подставляется локальный (неправильный). А если вызываю из компонента под роутером, то всё коррректно. В ApiService дополнительных манипуляций с доменом нет.","196":"приложение там маленькое, но есть желание разобраться в таких вещах","197":"","198":"уй","199":"async mounted() {\n const $ = (await import('jquery'));\n}","200":"не понял","201":"http:\/\/img.playground.ru\/images\/0\/9\/gate-without-fence.jpg  вот так сейчас выглядит роскомнадзор)","202":"Да это я туплю. Просто в доке у разраба по-другому написано, разобрался уже. Не слушайте джуна, там был вопрос, а не подсказка)","203":"в хуки не хочу класть, т.к. если ответ неверный, надо будет после проверки вызывать метод снова... или из хук можно вызвать его после mounted? просто давно на vue не писал, забыл кое что, сейчас читаю параллельно)","204":"В самом низу тень под окошком","205":"я понял.   ну я не знаю vite,  всё никак не добрался чтоб попробовать.  под вебпаком есть вариант в js писать ссылки так: ` <img src=\"require('@\/assets\/img\/myImg.png')\" >`  это работает в разметке и в js компонентов.  но этот синтаксис разруливает вебпак в связке с компиляторов vue-компонентов.   будет ли так же поступать vite - я не знаю.  попробуй, есть шанс.    отпишись потом,  чтоб я тоже знал","206":"хотя может это действительно экономия на спичках","207":"Лучше создать лет а потом переприсвоить,чем использовать один вар?","208":"Но ру сегмент точно такое себе","209":"Я же написал, как. Что за '1'","210":"Теперь вопрос номер два, в конце работы я получаю например такую строку\nSeregey <strong class=\"highlight\">Ste<\/strong>panov\nПосле работы v-html исчезает пробел, в чем проблема?","211":"Зазнайка прост","212":"Vue is not defined","213":"я исправил, там было перепутано ref и computed. С computed реактивно","214":"","215":"ты хочешь сказать, что FF может делать вывод в консоль?","216":"думаю, остановлюсь на варианте во мн числе","217":"Прям кучами","218":"Emit or vuex","219":"использую следующее","220":"я правда не увреен или его вынесет в вендор","221":"","222":"так-то, если будет просто строка, заменит на 0, вводимый текст, не ограничивает число форматом до дроби.","223":"🤔","224":"Какаято информация еще нужна? Если нужна скину","225":"да лень все посты читать)","226":"Смотрю у вас тут весело","227":"Где ты увидел что там нужно делать?","228":"@thatside Додай ще трохи бухла. І тікати не треба.","229":"Спасиб, но это вообще чет как-то стрёмно","230":"заставил меня проверять работоспособность","231":"я хз у меня не было конфликтов с бэком и ssr вырубил оно всегда продолжало это писать в девмоде","232":"я думаю, все ) ищите someVar.__vccOpts, вот someVar  у вас undefined","233":"https:\/\/www.google.com\/amp\/s\/webdevblog.ru\/ispolzovanie-vue-observable-v-kachestve-state-store\/amp\/ \nВот как пример","234":"Так вот же - https:\/\/t.me\/vuejs_ru\/1250855","235":"Дак там же во vuetify есть пример дропдауна, что конкретно не выходит?","236":"В реакт чате празднуют 6к","237":"вешаешь ref=\"refName\"\nи потом this.$refs.refName.someMethod()\nв доке все есть.","238":"а полностью ?","239":"Как то толерантненько","240":"Vue 3, почему div id=app имеет высоту не более 400 с чем то?  из этого верстка едет","241":"Первое","242":"да","243":"Зачем другие люди когда есть 2 руки","244":"?","245":"Тот же Drawer\/bottom-sheet, а еще какой-то базовой логики для пагинации","246":"я их не делаю давно.","247":"Добавьте к $emit('click') вторым аргументом $event","248":"Просто представь, что у тебя завтра добавляется третий компонент, который тоже может менять статус","249":"вуётрап","250":".","251":"А в чем сложность стартрнуть на основе оф доков?","252":".","253":"да и либа блин turn.js с дохренища зависимостей, в том числе jquery, а я когда стал манипулировать с тем, чтобы зациклить, типа бесконечно листаешь, у меня браузер завис на каких 20","254":"дык тут вероятно такие и есть","255":"watch: {\n  array() {\n    \/\/ логика\n  }\n}\n\nЭто если на сам массив","256":"Как нормально модуль к стору создавать(","257":"а нафига два зена ? почему 1 не используете","258":"Другой по другому","259":"Ты в одном компоненте эмитишь и слушаешь событие","260":"Это накст?","261":"А меня с фронт чата удалили","262":"Russian vue.js toxic community","263":"НИКАК","264":"мне кажется ты за сегодня переработал уже!!! отдохни!!!!","265":"а если это интернет магазин с динамическим каталогом и много ссылок оттуда на другие подстраницы?\nпререндер если правильно понимаю, больше для статических страниц подходит?\nтогда только ssr? получается надо ноду поднимать на серваке, и может TTFB просесть в зависимости от нагрузки","266":"да, с ssr результат будет одинаковый","267":"Только проснулся и улыбнулся, спасибо","268":"Давай","269":"У самой мозилы есть супер-блокировка трекера, которая старается удалить всё о твоем визите (могу врать, не использую). Зависит от версии браузераэ","270":"```default () {\n    return 'some value';\n}```","271":"Смотря что вы хотите. scripts вообще не обязательная часть","272":"\"typeerror: cannot read properties of null (reading 'slice')\" vue","273":"Я крайне поражен этим явлением","274":"Зачем вам массив делать объектом? Сразу делайте объект или оставляйте массив массивом","275":"интересная логика, получается можно и вот таким тогда заниматься","276":"не знаю, можно ли calculated сделать на вложенные проперти?","277":"тогда лучше обычными селекторами?","278":"звучит крайне непонятно, покажи остальной код и на его примере объясни, что ты хочешь получить в итоге","279":"есть какой то метод?) на примере express + mongoose ?","280":"Так это валидный HTML символ.\nНикакой не эмодзи))","281":"Как блеять заснуть","282":"это и был мой вариант. я хотел узнать может что другое есть","283":"app_{hash}.js","284":"А для чего нужна мышь в IDE часто?","285":"корневой есть да","286":"","287":"верно понял?)","288":"либо до этого воспользоваться mapGetters","289":"И как они связаны с фронтендом?","290":"и админить его, а не так,что загрузил html-ки и забил","291":"Да мне хотелось бы посмотреть реализацию виджетов","292":"cli = Command Line Interface","293":"Нельзя через рут передать атрибуты","294":"https:\/\/learn.javascript.ru\/","295":"v-for=item in items.slice(2,999)","296":"Может убрать scroplHeight из первой строки?","297":"https:\/\/www.maximonline.ru\/longreads\/odezhda-s-ananasami-i-drugie-sekretnye-znaki-svingerov-id670592\/","298":"О_о","299":"те что есть в данный момент","300":"ХЕЛП","301":"ну попробуйте))","302":"у всего есть причина даже у ветра","303":"res == [] всегда будет false, так как массивы сравниваются по ссылке","304":"Спасибо) у меня в проекте чуть сложнее компонент и там вот не работает. Решил похожее запилить в песочнице и тут спросить, но видимо проблема в другом)","305":"Есть боковое меню, есть контейнер","306":"всё что я там использую, это вью","307":"Всем привет, у меня такая задача, я хочу сделать универсальное модальное окно для разных страниц, и в каждой из этих страниц будет разное количество полей, как мне передавать реактивные переменные с полями чтобы они работали и отправлялись post запросы?","308":"primevue имеет свою встроенную логику компонентов, тебе лишь нужно дать ему данные с которыми надо работать","309":"если без vuex, то слать событие родителю, чтобы он его слушал и менял props у другого компонента","310":"","311":"А зачем? Что это дает и какую проблему решает?","312":"С чего ты взял что он бесполезный?","313":"парни, у кого-то было подобное?\n\nпри npm run dev, все собирается вроде бы, но при заходе на локальны адресс - просто вечная загрузка","314":"спасибо за наводку) исправил","315":"Потихоньку изучаю карту сайта и руководство","316":"Запустить Вью фронт на caddy сервере, он пишет, что я через http обращаюсь к серверу, но как вы видите на фото в vim я https указал в axios . Может он не понимаю что я хочу https и http отправляет?","317":"Ну вот да, то есть сравнивать и рендерить ему удобнее будет старую дату с новой","318":"очень легко случайно не сделать копию объекта, а начать менять исходный","319":"именно в конфиг туда)","320":"В шаблоне просто time без value","321":"","322":")))","323":"вы намекаете что это не вью проверяла, а сам браузер","324":"не корневой(","325":"","326":"это еще до однофайловых компонентов 🙂","327":"пхп?","328":"А изначальный вопрос как раз возник из-за незнания области. Поэтому и глубже копать в ответе смысла нет. Есть смысл дать правильно направление, куда автор вопроса уже начнет копать самостоятельно.","329":"Абсолютно верно\n\nКомпонент - отображение данных\nМодуль апишки - логика запросов\nСтор - хранение глобальных данных","330":"В 1х в then стрелку вместо function\nВ 2х \n`this.yourProp = data`","331":"у меня есть возможность подождать)","332":"<span id=\"auth_link_wrap\">\n    <a rel=\"nofollow\" v-if=\"authLink\" key=\"personal\" title=\"<?=Loc::getMessage('CABINET_LINK_MSG');?>\" class=\"personal-link dark-color\" href=\"<?=$arResult['CABINET_LINK_HREF']?> \">\n        <span class=\"wrap\"><span class=\"title\"><?=Loc::getMessage('CABINET_LINK_MSG');?><\/span><\/span>\n    <\/a>\n    <a rel=\"nofollow\" v-on:click.stop=\"showAuthForm\" v-else key=\"login\" id=\"header_auth_link\" title=\"<?=Loc::getMessage('LOGIN_LINK_MSG');?>\" class=\"personal-link dark-color\" data-param-backurl=\"<?=$arResult['BACK_URL_HREF']?>\" href=\"javascript:;\">\n        <span class=\"wrap\"><span class=\"title\"><?=Loc::getMessage('LOGIN_LINK_MSG');?><\/span><\/span>         \n    <\/a>\n<\/span>","333":"здравствуйте, подскажите что могло произойти, отвалилась кнопка, минут 15 назад была на месте","334":"надо через $set","335":"https:\/\/t.me\/vuejs","336":"Я бы тоже задал парочку вопросов, но я стесняюсь :D","337":"будущее за роботами","338":"Там есть Х и Y мои. Сейчас буду пробовать","339":"я так не говорил","340":"","341":"значит ты не экспоузнул функцию openModal из этого компонента","342":"Там есть такие примеры","343":"Всем привет! Возник один вопрос касательно lazy load: как реализовать lazy load во время загрузки страницы наподобие этого http:\/\/hilongjw.github.io\/vue-lazyload\/, но не с картинками, а со ссылками-картинками?\nКод: \n<div class=\"container\">\n    <div class=\"row\">\n        <div class=\"col-lg-4\">\n            <a data-fancybox=\"images\"\n               class=\"photo-video-item\"\n               href=\"\"\n               style=\"background-image: url('img.jpg')\">\n\n            <\/a>\n        <\/div>\n        <div class=\"col-lg-4\">\n            <a data-fancybox=\"images\"\n               class=\"photo-video-item\"\n               href=\"\"\n               style=\"background-image: url('img.jpg')\">\n            <\/a>\n        <\/div>\n    <\/div>\n<\/div>","344":"всем привет. запускаю эту команду\n```vue-cli-service build --mode windows```\nмогу ли я получить значение windows в vue.config.js?","345":"Поэтому надо length","346":"у меня вот один главный","347":"а, я видимо старую доку смотрел, мне вообще нужно текущую страницу ( номер её)\n\nтут есть евент какой надо","348":"пытаться понять его не видя его исходный код очень тяжело","349":"Я уже пишу так как ничего не нашел готового и с реактивным подходом и в бэке то не работал.","350":"Коллеги, вопрос:\nVue3 CompositionAPI режим SSR\nв роутере в событии beforeEnter вызываю action для записи данных в стор\nвсё пишется, но даже Vue Dev Tools в сторе показывают, что там пустота.\n\nЯ подозреваю, что запись в стор на сервере при рендере страницы не передаётся на хост. А вот как на сервере в роутере так писать в стор, чтобы оно потом на фронте нормально читалось?","351":"Выделывался значит?)","352":"Вьюкс 4, соответственно","353":"Разобрался, в чем проблема: Vue.use() был еще в одном месте. Код выше работает как и должен","354":"Крч, учить и учить нужно vue )","355":"Вот такая вот проблема с индексами в в вебшторме. Как решить? Ни один из пунктов не срабатывает","356":"Без роутера вьюкса и тд","357":"arr.at(-1)","358":"vue cli, решил использовать","359":"nometa.xyz","360":"нет, просто 2 строки для параметров ссылки по которой будет дергаться другая инфа из отдельного сервиса","361":"Только догадки","362":"что за блатная вакансия такая? есть ссылка?","363":"На маках можно стрелками с модификаторами. Cmd+Left - Home, Cmd+Right - End и т.д.","364":"У тебя пришли настройки - ты их куда то положил","365":"Он менеджер ~~по клинингу~~","366":"в том то и дело, что прописывал","367":"Через vue-router — нет","368":"1. нет роадмапа и плана \n2. цель привлечь внимание и скорее завлечь заплатить\n3. недоверчивый тип) имхо\n4. убогий дизайн\n5. русские курсы 🤢\n+ коменты накрученные видно)\n\nи чтобы идти в нукст тебе просто надо прочесть доку vue \nвью роутер знать глубоко желательно \nшарить за импорты реактивность и компоненты (все в доке есть)","369":"я думаю нужна передышка пару дней","370":"конкретно нужно позалипать на [этот файлик](https:\/\/github.com\/ElemeFE\/element\/blob\/655d89fe0e0d9c4c7c4ca2541f5cf90437690a76\/packages\/message-box\/src\/main.js), в котором лежит исходник $confirm'а, убедиться, что разрабы элемента не додумались, что попапы могут хотеть закрывать программно\nпосле этого можно создать ишью, где описать что и где надо","371":"по этому моментально скрывается. если смотреть дом- видно как мигают элементы","372":"как можно организовать взаимодействие vue приложения собираемого вебпаком и легаси jquery кода?","373":"Кровь, кишки...","374":"ну смари, в ларавел не принято говорить о паттерне репозиторий)\nа там всё во всей красе, слоистое","375":"```[\n{},\n{}\n]```","376":"rgba(#fff, 0.5) он не может","377":"Это настройка шаблона из коробки. Т.е в этом виде она работала с мок сервером.","378":"необязательно","379":"Что это за гадание на трех картах","380":"","381":"nuxt","382":"практическая задача в том чтобы проверять не скрыт ли элемент и если скрыт то прлучить элементт следующий не скрытый","383":"получается геттеры не нужны??","384":"@starkovsky жги, только не забудь, что в этом чате нужно цензурно, для маленьких.","385":"баги есть как и везде. но аг-грид самое взрослое решение","386":"PhpStorm","387":"просто почти нет причин использовать, если только надо что-то срочно портировать и нет времени рефакторить и выпиливать jquery","388":"Без вот этого tags-component?","389":"Конкретнее вопрос пожалуйста, что интересует?","390":"Благодарочка","391":"высоту вручную задам фиксированную","392":"0_0","393":"автоимпорты компонентов подключил, автоимпорты модулей подключил, говном обмазался и кайфуешь","394":"да","395":"как перерендерить приложение вью?","396":"ошибка в коде? стейт не оставляет последние вложенные в него данные после перезагрузки, он реактивен","397":"из таблицы эмитишь событие и в корне меняешь переменную по типу \"isModalVisible\". Она передается как пропс для модалки. И из модалки эмитишь закрытие","398":"хоть напрямую по адйишники искать, и на чистом жс управлять состоянием, хоть через в байнд в классе указываьб вычисляемую переменную, хоть через :class, хоть через :style","399":"Согласен, но строку не обязательно","400":"","401":"Так зачем мне его собирать","402":"Ага, спасибо!","403":"я наверное сегодня не успею, рефакторю старую перловую crm","404":"Тут такие не водятся)))","405":"header строит себя основываясь на существующих ссылках. Зачем их дважды дублировать, если можно просто оставить в state отдельного модуля prefs, куда я могу сохранить и их, и домен, и что угодно еще?","406":"Я собрал базу на 70 миллионов пользователей в 2014, социальный граф мейлру спарсил. Она состояла из пары id-id","407":"можно у географа спросить - чувак, а на какой широте и долготе находится город N с населением 20 человек.....","408":"сделать 1 модалку в которую будут прилетать знанения?","409":"Как вызывается клик?","410":"@dstrokov Приложение деливери клаб вконтакте)\nhttps:\/\/vk.com\/app5956276_-17700656","411":"Подскажите, как правильно вызвать метод дочернего компонента из родительского?","412":"Тут ещё такой момент:\nprovide and inject are primarily provided for advanced plugin \/ component library use cases. It is NOT recommended to use them in generic application code.","413":"учту, попробую переделать со сбросом, убрать persistent\nКак перепишу, напишу udp\nСпасибо","414":"Как-то сталкивались с таким кейсом, и решили взять Swiper и немного стили перебить и добились нужного.","415":"на ноду?)","416":"v-html","417":"Издеваешься","418":"вот так выглядит сам js для запроса базы","419":"```Failed to mount component: template or render function not defined.\n\nfound in\n\n---> <BProgress>\n       <ProgressOnline> at resources\/js\/components\/progress-online.vue\n         <BCollapse>\n           <Root>```\nмдаааааа......","420":"пойду так же сделаю =D","421":"естественно не слышал - его готового нет - надо писать самому)","422":"Народ, абсолютно нубский вопрос....я могу как то через роутер-линкк задавать :to={params:{someParam:value}} чтобы  параметры роута менялись, но самой навигации не происходило? тупо через роутерлинк обновлять параметры роута...?","423":"а по вебшторму?","424":"Вкусовщина и судя по тому что в гигантском проекте не применяются общие вычисляемые свойства в виде геттеров или модулей в пинии там уже лапша и каша","425":"юзаешь глобальный импорт: https:\/\/vuejs.org\/v2\/guide\/components-registration.html#Global-Registration","426":"верно же?","427":"Работает-работает. Заходим в доку и читаем раздел getting started","428":"Да я без геттеров брал, значение","429":"А если что-то надо стало использовать не в одном месте, а в двух?\nА если что-то потом поменялось?\nВ скольких местах надо будет сделать изменение.\n\nВ общем-то причины такие же, как и во всём остальном программировании","430":"а в чем проблема то","431":"шта?","432":"Права юзер узнает после логина. А компонентами рулит фронт на основе прав","433":"+","434":"http:\/\/learn.javascript.ru\/objects-more","435":"и всё?","436":"Вы будто тёплое с мягким сравниваете. Процесс нарисован, но лицезрение картинки не освобождает от чтения доков, чтобы сразу понимать что чем запускать.","437":"ну и :key конечно","438":"проблема решена, стили нужно добавлять в отдельные файлы scss","439":"бля ты вообще спиш?)","440":"И если думаешь, что проблема во мне, то просто поменяй тег table на div. Магия вне Хогвардса.","441":"X))\nКруто устроились (:\n\nНу, я сисдамин, так что.... ;)","442":"The QRCode content should be a Key Uri of the following format:\notpauth:\/\/{type}\/{app}:{accountName}?secret={secret}{query}","443":"всем привет. для вотчера обязательно иметь в объекте дата поле с таким же названием ? имею ввиду если вотчер называется someVaк , то в дата тоже нужно такое же поле ?","444":"я делал подобное, не совсем так","445":"Мне от этого модуля нужны разные baseUrl для SSR и браузера и другие вещи","446":"износ диска, траффик 🌚","447":"Есть ещё вариант построения архитектуры в виде загогулины, тогда условие упаковывается в функцию, которая передаётся через return по ссылке, а на том конце(где вызвали предыдущую функцию) идёт вызов.","448":"всем привет, есть ли возможность отследить аргументы функций в стеке(может как-то через firebug) \/ изменение переменной в js приложении через консоль без изменения самого приложения?","449":"Подскажите,  у меня есть API, данные из которого я хочу получить до того как у меня создастся  инстанс vue. Как лучше это сделать?","450":"внутри твоего компонента-обертки инциализировать в created\/mounted","451":"+","452":"те что загромождаю глобальную область этими событиями..","453":"Может кто то подсказать по vuetify v-select ?","454":"Свой UI кит делать — это тоже ведь работа большая. Ещё думать про разные устройства, браузеры, семантику, сверху скринридеры стучатся. \nДля коротких проектов совсем не вариант получается, если кит не используется постоянно один и тот же из проекта в проект","455":"Здравствуйтк","456":"А может ещё варики есть?","457":"в принципе, можно и просто vue подключить, но у меня там есть настроечки, есть форма с комментами. я думал можно как-то через vue, допустим, создать два компонента, settings.vue и comments.vue, и через build получить два файлика готовые для подключения.","458":"аккордион","459":"День добрый, может встречал кто pre-made шаблончик для bulma-vue или bulma, что-то по типу такого:\nhttps:\/\/demo.creativebulma.net\/hexalight\/\nили\nhttps:\/\/getbootstrap.com\/docs\/4.2\/examples\/dashboard\/#","460":"то что скинул lionstuff","461":"Пруф","462":"Не работает. Лог выдает {}\n\nАналогичный вызов в computed() делает свое дело","463":"...","464":"`Firefox 58+ has pipeline support behind the --enable-pipeline-operator compile flag`","465":"так вроде бы же юзаю","466":"где вызов getTags()?","467":"Именно","468":"Типо что его выделяет на рынке","469":"Всё ещё не понятно, что ты делаешь.\n\nНа скрине код, который никак не относится к Vue и в котором судя по типам нет ничего реактивного.\n\nКласс без конструктора, плохо понятно, что откуда там берётся. Как появляются экземпляры класса и с каким значением.\n\nТем более, как связаны компоненты, в которых это как-то используется","470":"Как я мог забыть)","471":"","472":"Конкуренции меньше","473":"скажите а что за анализ кода в шторме?","474":"всмысле ? он же вроде из коробки листается","475":"ну и да, согласен с Владом, что нужно поставить задачу и тогда в рамках нее и разбираться","476":"а ты пытаешься на тот же урл кидать запрос где и находится браузер?","477":"https:\/\/codesandbox.io\/s\/vue-template-znzf1","478":"Не важно :D","479":"понял, спасибо, переменные тоже пойдут, т. к используются в качестве аргументов","480":"что посоветуете?","481":"Интересный канал, спасибо","482":"пока что прям вообще походу кейсов таких не встречал","483":"плюс тормозит","484":"Всем привет!) Помогите, пожалуйста. Стоит задача сделать через POST запрос авторизацию по одной из двух ролей - админ и пользователь (логин и пароль известны). Предложено использовать либо json-server, либо node express. Порекомендуйте,  где можно ознакомиться с вариантами реализации. Спасибо!","485":"И в любом случае, эти фризы мелочь на фоне помощи в работе всем, что есть из коробки","486":"","487":"","488":"А transition убери тот что есть щас","489":"если есть ссылки на материалы буду очень благодарен)","490":"vue 3. как глубоковложенному элементу прицепить v-model на данные родителя?","491":"3 еще priview в cli","492":"Исходники, которые вы скинули - работающие, по крайне мере, имена планет оно выводит","493":"кек","494":"и я не рад","495":"Pixel perfect это вообще боль. Особенно когда есть не целые пиксели","496":"","497":"зачем и почему?","498":"","499":"Я вот иногда заново переустановаливал","500":"Маргарита hr?","501":"поэтому, естественно, нет","502":"да наверное иммено я","503":"Всем привет кто не спит.\nХочу иметь доступ к переменной isDesktop во всём приложении которая отражает соответствие window.width > 1024\nкак и где прописать ресайз события\nили может есть уже готовый плагин?\nпока что только одна идея - в маунтед хуке главного App проинициализировать ресайз-евент и там же и сохранить переменную и обращаться через this.$root.isDesktop","504":"просто я использую аполло а в нём пробовал подключить обработку ошибок но получилось такая фигня что я два дня не мог разобрать, и теперь хз как через этот плагин сделать какой то мидлваре или словить ошибку jwt. Сам функционал токенов уже готов, ну типа есть и аксес и рефреш и обновление по запросу на сервак","505":"step","506":"Элемент указывает что именно мы меняем","507":"getter: state => param => state.x + param","508":"лол","509":"","510":"Привет, помогите, пожалуйста. Делаю пост запрос через axios - бьет cors. То же самое делаю через fetch - все ок. Возможно в том, что неверно задаю referrer-policy? Потому что как будто он отправляет по-другому.","511":"Всем привет, что нужно сделать чтобы отрендерить PDF? Использую https:\/\/github.com\/arkokoley\/pdfvuer. В src вставлю и ссылку на пдф файл и кидаю блоб файл и тишина","512":"Отписывает типа убивает?","513":"На первом у них с эйчар собес, во втором тех скрининг где общие вопросы и не сложных задачек, на третьем уже сложные задачки и более глубокие вопросы. Я тоже на миддла собеседовался. И несколько знакомых друзей-коллег.","514":"и сам увидишь подводные все камни, подходит или нет","515":"по запросу С3 мне предлагает Ситроен С3=)","516":"Читай ошибки, их для этого и выдает","517":"и затем export default объект всего что нужно калькулятору..","518":"😂😂😂","519":"к примеру, решили в корни поменять диз сайта, а какие-то базовые компоненты оставить. я могу ошибаться, конечно. не совсем хорошо разбираюсь в этом","520":"Ребята, это случилось!\nВышел релиз **Quasar Framework**.\nhttps:\/\/quasar.dev\nЕсли кому интересно готов ответить на все вопросы, так как сам на нём разрабтываю и слежу за процессом разработки.","521":"такое ощущение что ты просто не открывал ее","522":"В Стейт пути заносить надо ._.","523":"но и до сервисе не доходит","524":"Ребят, шалом. Не подскажите, почему не отрабатывает именно v-enter-active?","525":"используй то, что больше нравится и с чем удобнее, про плюсы и минусы подходов можно глянуть в доке","526":"правила чатика запрещают, я просто тлею медленно ;)","527":"это уже про чистые паттерны, а не про реализацию во вью","528":"","529":"Пох","530":"Это да) уже смотрю)","531":"моё решение предполагает замену одной строки в стилях и создание спец. функции","532":"думаю ни чего тебе базу не помешает перекинуть базу  на Лару, там все на щелчек делается","533":"в защиту скажу я бэкэндер мне в фронте наврятли что то светит нормально это чисто для души","534":"или даже на filter поменять","535":"","536":"типа такого сделано но смотри на stor.token который при инициализации пуст","537":"я ща чот плохо соображаю что бы объяснить это","538":"Вот именно","539":"А зачем оно","540":"ну так если к 100 тегам применить директиву, все 100 будут переписывать одну переменную?","541":"Ответы к комментарию","542":"Всем привет, обновил vue с 2.6.11 на 2.6.14 перестали работать слоты в #footer, в чем может быть проблема?","543":"а так можно было?","544":"🤗🤗🤗","545":"Ну, отрисовка у меня внутри компонентов, стор подключается как база данных только, пока у меня реализация только CRUD в проекте, если я правильно понял под логикой рендеринга отрисовку данных в компонентах...","546":"ок, почитаю еще раз доку\n\nСпасибо большое!","547":"Ну я же делаю запрос и заношу данные","548":"всем привет, подскажите пакет как vuelidate(для 2) только чтоб можно было встраивать ошибки сервера в поля формы","549":"В доке для вью есть уже готовый код для того, чтобы прикрутить директиву v-scroll","550":"у меня не тривиальная задача. \nЕсть спсиок объектов с названиями методов, которые нужно вызвать при итерации v-for","551":"просто я нередко сталкивался с тем, что приходилось костылять вокруг бутстрапа, перебивая его стили другими и это бесило только","552":"А если сделать по простому? \nбез spy","553":"еще бы гугл не писал про ангуляр, своё детище)","554":"npm?","555":"аа, сочуствую что ты не понял var это если я просто имя такое дал","556":"Посмотри нативные html 5 dragndrop","557":"в корне проекта.","558":"А надо в хост прописывать \"127.0.0.1 redis\" ?","559":"по ссылке выше перейди","560":"\"Использовать дружелюбный и толерантный язык общения;\"","561":"это не саас","562":"вуй отображает это все безобразие.","563":"вот эта прикол а как это сделать типа доп метод надо","564":"То есть, нужно циклом пробегать по каждому индексу и присваивать все что получено с аксиоса?","565":"ООООО","566":"selected[0].name","567":"шо то не так отслеживаешь\/делаешь","568":"<template>\n    <div id=\"product\">\n        <HeadPage \/>\n        <AdminPanel\n            @create=\"createProduct\"\n        \/>\n        <CardProduct \n            :products=\"products\" \n        \/>\n    <\/div>\n<\/template>\n<script>\nimport HeadPage from '@\/components\/headPage.vue';\nimport AdminPanel from '@\/components\/adminPanel.vue';\nimport CardProduct from '@\/components\/CardProduct.vue'; \n\n\n    export default{\n        name:\"productPage\",\n        components:{\n            HeadPage,\n            AdminPanel,\n            CardProduct\n        },\n        data(){\n            return {\n                products: [\n                    {id: 1, img:'http:\/\/www.rosphoto.com\/images\/u\/articles\/1510\/4_8.jpg', title: 'adadad', description:'Описание продукта', price:'2300'}\n                ],\n\n            }\n        },\n        methods: {\n            createProduct(product){\n                this.products.unshift(product);\n            }\n        }\n        \n        \n    }\n<\/script>","569":"Не нужно усложнять)","570":"Немного не ясно. Сделала на левом меню mouseleft при котором переменная отвечающая за подменю если true то остается true, и а правом меню mouseover то же самое, и даже с margin-left: -10px меню пропадает","571":"так обычно бывает когда умеешь в фреймворки но не понимаешь язык на котором он написан =)","572":"Это зависит уже от конкретных данных (структуры) и конкретных стоящих задач\nКакие-то данные можно разделить на 10 меньших массивов с построением индексов и использовать по индесам\nКакие-то можно проходить по надобности SAX парсером (например поиск статьи в энциклопедии)\nНужны детали для определения реализации\n\nЭто не биг дата\nЯ уже написал пример - приложение должно работать оффлайн\nПростая программа для заметок, например, при большом количестве заметок","573":"предполагаемый ответ заранее","574":"this не нужен","575":"Код в студию","576":"опять эти сложные слова(((","577":"Есть дочерний компонент UploadFile\nВ ней в форме пишу\n<input type=\"hidden\" name=\"model\" v-model=model>\nХочу менять значение model (модели) в родителе\nДля этого в этом же компоненте пишу\nprops: {\n      model:{\n          type: String,\n          default: 'album'\n      }\n    },\nА теперь в родителе пытаюсь как раз изменить значение модели\n<upload-file @addFileClick=\"addFileClick\" :model=\"portfolio\" \/>\nНо мне пишет ошибку что я должен еще определить переменную portfolio\nНе могу понять, я же описал что это строковый тип и просто хочу передать значение. Как здесь быть?","578":"Но ведь не всегда удасться создать уникальный ключ","579":"И что оно именно делает? Сохранят стэйт страницы? Просто Html page?","580":"каво","581":"вот передача","582":"Вот asyncData и заполняет стор и в компонент данные добавляет. Мне нужно также","583":"Ребят, нужно сделать не большой календарик на Vue^  бек я написал, кому инетерсно пишите в личку","584":"а модалка отдельный компонент?","585":"да","586":"Ребят, а вот подскажите такой момент, при работе с данными из store vuex не могу с ними работать например в computed потому что они еще не подгружены а computed расчёты уже проводятся, в результате полно ошибок и т.д., какой тут бест практис?","587":"При попытке перетащить элемент kitchen, в этот раз, тащится картинка, которая охватывает и верхний тулбар и нижний элемент","588":"Надо чтобы evan you запилил обрезанную версию для новичков, где нет подобных возможностей","589":"","590":"https:\/\/sass-lang.com\/documentation\/at-rules\/mixin\n\nПо моему тут ответ","591":"Развиваются медленнее, чем vuetify","592":"я бы подождал наверное вью-кли на 4м вебпаке","593":"В main.js мы как обычно маунтим наш компонент, а вот в wc.js, который лежит рядом, мы делаем так\n```import '.\/vue'\nimport MainBlock from '.\/components\/MainBlock'\n\nexport default MainBlock```","594":"да такие тяжелые операции лучше на сервак вынести, клиент то мб и справился ну браузер js сам по себе тормазнутный","595":"Фу иметь такие куки","596":"Версия Vue какая?","597":"nometa.xyz","598":"Друг 😏","599":"","600":"вау","601":"пусть выстреливает))","602":"😅 да в стартап) скорее миддл+\/сеньор с небольшим опытом руководства. я уже не знаю, где его найти))) сейчас кину в группу, можно там посмотреть, чтоб тут не флудить","603":"Имеешь ввиду лучше так и делать?\n`( 'object.key' () => {} )`","604":"А вопрос в чём?","605":"Не заметил в документалке","606":"гайз, а как так может быть - \n```    onSelect() {\n      console.log(this.$refs)\n    },```\nмне показывает пустрой объект\nпочему?","607":"либо использовать EventBus\/vuex","608":"Не )","609":"Надо корвырять в vue-devtools","610":"Присмотрись к vue-multiselect","611":"А можно не вносить это в логику вуя 😁","612":"Запроси её с сервера","613":"а хде же ты ловишь ошибки?)","614":"пошел курить доку)","615":"Я рад","616":"как это будет работать если это совсем отдельный компонент? Вот структура:","617":"как будто login и не видит в объекте","618":"Как вариант, но это совсем не лаконично","619":"чо бы нет. может в vue написано, что если individual, то забить болт )))","620":"ставлю https дает ошибку падла","621":"Он их генерит и отдает среднему компоненту.","622":"Идеа в коробке хорошо работает, а вскоде с дополнительными плагинами работает на ура и саблайн тоже тема для простой верстки","623":"😅 не понял","624":"Там просто цифра должна выводиться","625":"храню рефреш в куки, аксес в локалке)","626":"Дебаг это язык программирования или фреймворк?","627":"я не с index.html делаю ссылку же","628":"(шутка - щас так не модно)","629":"Line 18 in the big picture groups link Any relationship in the second picture to the appearance of the content","630":"Должно работать. Сделай пример в песочнице","631":"Да.\nТы написал \"стор для информации которая много где\", а \"шина для действий\". + пример.\nТолько у нас почти всегда действия связаны с информацией. Те же нотификейшины — это добавление информации об уведомлениях.\n\nПод определением я понимаю что-то, что действительно им является, с соблюдением требований к определению","632":"физически файлы хранятся под теми же именами","633":"myRef это что?)_","634":"[ Album ]\nВсем привет. Учу vue и пытаюсь что-то делать на практике. Возникла проблема с ошибками, которые можно увидеть на первом скрине. Атрибут :to у router-link воспринимается как не валидный(?) пропс. Помимо прочему жалуется что _normalize не определен. Нагугливаются только баг репорты в гитхабе. Кто знает в чем моя ошибка? Спасибо заранее.","635":"юзай computed. Не надо программировать в шаблонах","636":"функцию","637":"Угу. Поняла, хорошо, спасибо","638":"Если сайт сам по себе содержит ценную инфу имеет ца не требовательную к дизайну, то зачем там замороченный дизайн уникальные шрифты итд","639":"можно.","640":"Ток в ноде есть nextTick, в браузере его нет","641":"И так тоже пробовал, вообще ни как не сработало, сделал через модификатор, и  в доках искал и не понял поэтому спросил может на инпуты нет еммита","642":"Вообще полный таск такой: есть изначально пустая форма (this.form = {}). В зависимости от действия пользователя, нужно те или иные поля записать в стейт и v-model'ить их.","643":"Прикольный, приятно слушать","644":"а к кукам он не получит?","645":"прям в индекс хтмл который стиль всунут","646":"в любом случае спасибо за информацию, наверняка в будущем будем полезна","647":"в том то  дело у ли должен быть модель или у а?","648":"Ты этй функцией как-то можешь управлять? Значение возвращаемое сохранить?","649":"лишним не будет, а свободу, в случае чего поможет","650":"обьявлена до","651":"=) думал просто может есть что-то более интересное, что я упустил","652":"Делай его динамически через for. Сперва высчитываешь года, а потом множишь их на 4 квартала, склеиваешь и получаешь список квартал + год. Затем отправляй это в select","653":"спасибо, пока на нем остановился, а еще дешевле бывает?)","654":"Тип да в джс ничо делать не надо","655":"Сначала один миксинчик, потом второй, это как СТМ и наркотики :)\n\nhttps:\/\/github.com\/bootstrap-vue\/bootstrap-vue\/blob\/dev\/src\/components\/table\/table.js#L62-L85","656":"нечего не происходит кроме смены адреса","657":"явно это как?","658":"И добавьте async перед именем функции из actions","659":"интересно просто","660":"Привет всем! Ситуация такая есть виджет sfc на vue , вставляю на сайт на Битриксе","661":"","662":"Как при `table-layout:fixed` сделать что-бы колонки выравнивались по левому краю?\n\nhttps:\/\/stackblitz.com\/edit\/vitejs-vite-l4ep2n?file=src%2FApp.vue","663":"ну тогда я ничего не знаю","664":"прсото както кнопочки сделаны так незаметно","665":"ошибок нет","666":"Всем привет.\nВот есть у меня чат, с несколькими комнатами, хочу сделать звуковые увеомления при появлении новых сообщений.\nСообщения приходят по вебсокету потом обновляются vuex\nСейчас сижу и думаю где идеологически правильней повесить хендлер на новые сообщения и проигрывание звука, ваше имхо?","667":"Шо за браузер?","668":"Там старый стандарт у них","669":"Создай какой-нибудь layout с ошибкой, вставь туда эту конструкцию. В дочерних компонентах при ошибке пуш ошибку в этот layout, и как-то её отображай","670":"Да","671":"Если я хочу хранить информацию о логине пользователя при перезагрузке мне нужно делать так?","672":"Чего описано ? Этот код вместо твоего\n```element1 = document.getElementById(id);\nelement1.removeEventListener(\"click\", this.changeStatus);```","673":"тип типов =)","674":"да, попробуйте другое имя метода","675":"&& linting","676":"","677":"надо вызвать js метод на странице из vue","678":"тогда да тебе нужно контекст передать)","679":"как я помню раньше все пихали в script.js и не дробили на чанки потому что не умели :(","680":"или отключить интернет для тестирования","681":"Если тебе экспресс \"маловат\", съезжай с ноды","682":"ну я передал квери параметры через урл строку.как мне их потом обработать и вызывать ивенты на другой странице,где селекты,вотчером?","683":"Всем привет","684":"https:\/\/vuex.vuejs.org\/","685":"й","686":"но это костыль)","687":"Ну вот тут можно глянуть","688":"даже если не импорчу и не вызываю, зачем он её запускает сам?","689":"да и с вебпаком я тоже уже это сделал ))","690":"Алгоритмы там, основное в реактивности, будет искаропки. Все эти ваши биндинги, скопы","691":"https:\/\/vee-validate.logaretm.com\/v4\/","692":"Зачем он нужен только","693":"вобщем никак. Ты можешь получить данные Vue внутри компонента, а ты хочешь получить их в html","694":"откуда предубеждение что забанили","695":"А как это называется?","696":"а тут уже были холивары на тему \"тем ли путём идёт vuejs 3\"? ))","697":"Вместо else","698":"Ща скину свой компонент","699":"Мб это я был","700":"1) проверить val\n2) вычислить width на основе val","701":"rtr","702":"Или все таки есть зависимость от количества запросов и сложности операций","703":"Нет, получаю (canceled)","704":"includes там тоже можно использовать","705":"тогда отдавай данные с редиса так же как все остальное и все","706":"или это мегазатратно держать черновик в бд?","707":"все остальные это какие? в реакте или ноде такой же движ","708":"Ну в смысле не дудос, а инфу на сайте изменить просто","709":"Спасибо сработало)))","710":"привет!\nпоскажите плиз, как обработать условие, если api возвращает true или false.\nДопустим, если пользователь подтвержден.\n    {\n        \"id\": \"51\",\n        \"name\": \"alex\",\n        \"is_confirmed\": false\n}\n\nВо вью:\n<span v-if='user.is_confirmed'>\n\nЭто верно?","711":"в него будет приходить e.target.value","712":"Покажи код","713":"странный у тебя продакшен","714":"ага)))","715":"если да, то \n`this.myChart = new Chart(this.ctx, { ...this.chartData } );` может поможет =))","716":"Так как в итоге правильно будет то ?","717":"Нормас","718":"я про тот, что в начале блока try","719":"Админки в традиционном представлении, когда есть \"менюшки для CRUD операций\" я как раз не делал никогда почти","720":"Прям как мем звучит","721":"","722":"и правильно, хром в ios работает на webview сафари","723":"Богдан богдана послал хд","724":"Ахахах","725":"Так же, как во Vue 2 - используя сборщик на commonjs модулях","726":"любой сложности","727":"Это меня особенно порадовало в этой картинке, учитывая мои 20 лет опыта в перле 8)","728":"как ты это понял за 30 мин? или хайпуешь","729":"не сработало((( буду искать другие варианты","730":"ахахахаххахахахахахахахаха","731":"Начал бубнту обновлять и понял что мог бы ещё месяц потерпеть до 18.4","732":"как быть ?","733":"Есть геттер стора, её я передаю пропсом к ребёнку, оттуда это дело провайдится","734":"https:\/\/www.loginradius.com\/blog\/engineering\/implementing-authentication-on-vuejs-using-jwt\/","735":"Он вроде написал что он не рабочий","736":"Не надо манкипатчить","737":"Я помню что компьютеды кешируются, а насчет геттеров не видел такого в доке","738":"\"indent\": [\"error\", 2,  { \"SwitchCase\": 1 }], - куда вот здесь вставить “tab” по доке?","739":"меня еще и по ts, и по flow смущает недостаточное колво инфы","740":"было 4+4\nодну заменил на 16","741":"Каких коллег. У нас тут бизнес мышление. Попользовались, выкинули 😁","742":"надо использовать transition-group","743":"ты скрин покажи с ошибкой","744":"потому что нужно, чтобы каждый компонент эмитил событие, я же 2 раза уже это написал","745":"та идея с ручным вызовом самая оптимальная","746":"Изучить, вот прям совсем с нуля","747":"вот на неделе кто-то из админов называл такое токсичным, когда человеку без троллинга, токсичности и всего, посоветовали прочитать доку","748":"иначе это очередная scum галера","749":"4 года назад впервые прочитал этот ответ, до сих пор никак забыть не могу и вспоминаю каждый раз, когда регулярками паршу html","750":"ну я был не один такой оригинальный, тебе еще 3 человек это писали","751":"чем больше js тем медленнее на мобильных платформах","752":"хотя если у тебя всего лишь один id то можешь способом из доки","753":"$event === data?","754":"1. Можно, но не обязательно \n2. Не обязательно, но работа с большей вероятностью будет на нём\n3. Можно, это не что-то сложное","755":"всем доброго дня!\nкто нибудь в курсе, как программно записать значение в v-select (vuetify)\nТо есть при создании нового адреса (это объект), мне нужно сразу добавлять этот новый элемент в список адресов (это я уже сделал) или делать этот новый элемент выбранным в v-select\n\nв методе @change selectedShippingAddress (который :value) = null, почему то","756":"сафари 13","757":"чем это не серьезно?","758":"господа инженеры","759":"как компонент, или просто как button?","760":"Не понял вопроса","761":"ну получай","762":"спасибо большое","763":"localStorage \/ sessionStorage \/ cookies","764":"Про что они? Как это сделать? : ```(для этого требуется наличие корневой ссылки на хранилище $store)``` - из док по vuex","765":"как поменять контент кнопки если $event.target выводит такое?","766":"Нет такого свойства","767":"https:\/\/specialistoff.net\/page\/418","768":"нет реактивности в роутах","769":"Потому что это непосредственно зависимость проекта, установленная через npm install, а не транзитивная зависимость (зависимость другой зависимости) :)\n\n(это нормальный цвет папки)","770":"Кто знает что это за ошибки?","771":"сам объект то я менять не буду, просто когда маршрут меняется, надо узнать поменялся ли сам объект на другой или это тот же","772":"помню await null делал, когда надо чтобы следующий кусок кода отработал в новой итерации евентлупа","773":"а с этого я начал хД","774":"😃😃😃","775":"Начни с того, нужны ли тебе эти поля в сторе","776":"как вариант v-for по объекту, а внутри v-if","777":"в чем вообще может быть причина7","778":"там 4 версия же","779":"оно по сути из коробки должно работать, у тебя всего скорее что-то где-то отключено просто","780":"А зачем?","781":"нет-модальное окно","782":"у меня лично такого нихера не было","783":"разница кстати в контенте всплывающего окна. технически разницы нет","784":"если честно то не до конца понял","785":"Работает, но я потом этот html должен вставлять в поле, которое ограничено по символам","786":"и под каждый микросервис своя Симфони с докером?","787":"Всё прекрасно","788":"Привет всем.\nНарод, как на vue проще сделать спиннер, который крутился бы пока висит fetch в экшене?","789":"Так не","790":"Так и ложите туда календарь а не массив календарей","791":"кто мешает напрямую работать с либой для виртуал дома и рендерить как хочешь?","792":"да не, стоит 18 (была 12 всегда)\nно тот пакет хочет 17","793":"overflow","794":"установи v-model на deployTiming.\nи меняй его когда что то меняется в функции\nnextStep","795":"ну так svg картинку хранить.. зачем компонент","796":"result is this !","797":"если нет this то его не использовать для обмена сообщениями","798":"Сори","799":"","800":"засунь в модель єто значение, чтобі оно по-умолчанию біло изначально","801":"not toxic enough","802":"🔥","803":"","804":"oh god","805":"Да если поискать хорошо, то можно будет найти. Тут по сути не главное - вью, самое главное уловить суть и понимать как делать, а под фрейм подстроиться можно","806":"вроде ж до 2000 фсе)","807":"Всем доброго дня.  Подскажите пожалуйста, как в composition api \nзамапить props. Что я делаю не так?","808":"Как вернуть undefined Для item если его нет, ставлю знак перед ним и Ide ругается","809":"хранить токен в Localstorage это полное айайай с точки зрения безопасности","810":"ребят, подскажите пожалуйста про vuex.\nя может как-то не так гуглил, но так и не смог найти нормальное решение\nситуация такая: нужно получить что-то по API. в vuex у меня есть action, который через axios получает что нужно. когда в компоненте мне нужно что-то получить от бэка, я делаю dispatch, жду окончания и потом забираю то что нужно из state.\nпроблема в том, что при повторном открытии этой страницы опять будет произведён запрос, а работа с данными будет невозможна, пока бэк не даст ответ. поэтому я пока делаю проверку: если  state.users === null, то делаю dispatch и жду пока action запустит мутацию и положит ответ бэка в state.users, если нет - то сразу получаю что нужно из state.users.\nэто, честно говоря, раздражает - можно ли как-то эту часть с проверкой state автоматизировать?","811":"Это две разные вещи","812":"создай св-во в data. Будет служить идентификатором","813":"ну она адвокатила NativeScript-Vue, потому что работала в компании-разработчике NS. О нем же рассказывала на конференциях, а теперь ушла в Майкрософт и рассказывать не о чем на Вью-ивентах","814":"Как предотвратить выполнения функции по кнопке в форме, если поля не прошли проверку ?","815":"извиняюсь , store 2й день пользуюсб","816":"bus factor?","817":"можете пример показать в функции как можно исользовать два класса","818":"нафиг бреак ?","819":"Тогда нужно спрашивать про второе в чатах по vue😜","820":"всем привет, если  консоль в хроме выдает warn vue то будет опасным для проекта их оставить?","821":"https:\/\/vuex.vuejs.org\/ru\/guide\/actions.html","822":"на что он ругается то? сходу не скажешь","823":"https:\/\/lingualeo.com\/ru\/ref\/9bp0aj","824":"toasts","825":"если погуглить эту ошибку, то можно найти развернутый ответ по первым ссылкам","826":"В API есть метод для получения количества строк в таблице?","827":"watch: { \n          initial: function(newValue, oldValue) { \/\/ watch it\n          console.log('Prop has been changed: ', newValue, ' | was: ', oldValue)\n        }\n      }\n\nсейчас вот так затестирую","828":"который к задачам на практике отношения не имеет","829":"Все сломалось и ничего не работает 🌚","830":"ты уверен что это так должно работать?","831":"подскажите, на какие вещи надо обращать внимание, используя готовые компоненты с библиотек, пакуя их в свой web component внутри shadow dom? пока что понял что нельзя обращаться к элементам внутри по id, они не видны извне. А как насчет того, что компонент изнутри делает document.addeventlistener() - события на документ можно изнутри вешать?","832":"что обьект загружается в стор по нажатию кнопки","833":"изначально elem.value === \"\"","834":"из сетапа возвращается все подряд, что ты там объявил, но есть еще анализатор импортов и шаблонов, который потом может вырезать лишнее, если оно нигде не используется","835":"что бесплатно найдёшь в сети, они есть","836":"Ты уверен, что метод, где находится эта строка, выполняется?","837":"Да черт знает. Сообщество юзает, значит норм","838":"А надо было читать про ES Import :)","839":"computed","840":"А этот? https:\/\/www.youtube.com\/playlist?list=PL4cUxeGkcC9gQcYgjhBoeQH7wiAyZNrYa","841":"Коллеги, всем привет. Я к сожалению совсем недавно перешел на Vue с ангуляр, поэтому немного не понимаю тонкостей работы с таблицей. Подскажите пожалуйста, как мне поменять checkBox стандартный для VueTable на кастомный ? В массиве у меня есть закоменнтированый кусок, он отрабатывает, но в header он не меняется к сожалению, так как нужно указать title поле. Может быть кто-то сталкивался с таким.","842":"хотя это тоже не выход reject не откатывает транзакции надо ошибку выкидывать","843":"Да, так долго работать. Ошибки есть?","844":"Юзер  - я, кликать руками мне лень, автоматом хочу. У меня 100 кошельков, например и  руками долго подписывать транзакции. Может правда туплю, но мне кажется, что автоматизация браузера типа Puppeteer  и тп изначально исходит из того, что вместо юзера работает скрипт, который запускает юзер, понимающий, что он делает. \nСайты, которые не любят хедлесс хром есть, но это уже совсем другой вопрос, могут детектить и бороться, здесь не такой кейс опять же)","845":"ух каша","846":"потому и ругается","847":"просто у меня там двумерный массив получится, и поэтому я хотел сразу через html вызвать функцию. Если через return возвращать без axios любое слово он работает","848":"в чем заключается ошибка?","849":"гляди форм-парамс, должен быть таргет","850":"Но почему?? Неужели не понимают?","851":"эх а я думал, что тройка только из-за композишена и получила такую мажорную версию :D","852":"Меняешь в либе, запускаешь patch-package, он создаёт патч  и кладёт папку patches.\nв postinstall прописываешь запуск и он каждый раз накатывает его","853":"оберни строку в require вот на этом скрине и все заработает","854":"Просто если `.css`, то мне тоже интересно ответ будет услышать, т.к. у меня такая же проблема нерешённая есть)","855":"ну к тому и был вопрос-намек, что неплохо было бы доку открыть)","856":"@Silantiy ты первый раз что вью пользуешься? это в исходники вставить надо","857":"Что-то не понимаю суть проблемы. \nЕсть данные, ты их лоадишь, складываешь, вероятно, в стор, локалстор или куки. Далее при срабатывании экшена проверяешь их наличие по последовательности: стор -> локалстор -> сервер. При первом тру на наличие, прерываешь цепочку запросов","858":"","859":"😀однозначно полезное сообщество в котором я точно не всрал весь свой день в пустую","860":"Layout использывать","861":"вот совершенно левый файл допустим other.ts","862":"Всем привет, не могли бы помочь , у меня тут одна проблема , отправляю форму(инпут) потом я показываю на сайте но там на блоке выходит underfined","863":"Т.е. если файл не соответствует требованиям.","864":"Я ничего не понимаю в жизни!","865":"Вообще не вижу смысла хранить в LS всех пользователей. Для чего мне в браузере знать про других пользователей?","866":"Это \"миграционный\" билд, который позволит начать частичную миграцию больших проектов","867":"У нас в компании недавно внедрили ларавельку. Один человек ее знает и пошла разработка. Я когда узнал такой \"шомлять?\". Все на одиназаднице и питоне, пытаююсь за явку(котлин) перетащить. И такое выдал один зи проектов. Вот смешно и грустно","868":"ну круто же уметь как можно больше","869":"Там иногда компонент пропадает,стили scss слетают и вообще стили компонента слетают,хз,хз","870":"И покажи, как собственно отправляешь запрос","871":"в jQuery это делается просто ${el} обращением, а во Vue я не совсем понял как","872":"Ребят, такая проблема,  иногда бывает задержка со стороны API, т.е. данные прилетают после того как компонент отрендерился. Эти данные должны быть выведены на UI. но т.к. компонент их получает позже до перезагрузки страницы, приложение падает со стандартной ошибкой cant get value of undefined","873":"Прям детство вспомнил.. 😄","874":"вот в чем прикол","875":"Почему?","876":"Или индекс","877":"Не, вряд ли","878":"потому что воспоминания так себе) пришлось потом всё переделывать считай с нуля.","879":"нет, не работает","880":"Доброй ночи! Как мне достучаться до players.name??? Помогите пожалуйста.\nhttps:\/\/codepen.io\/devastator\/pen\/abopGJb","881":"возможно есть более крутые, удобные решения, но из неплохих вариантов могу предложить это:\nhttps:\/\/www.draw.io\/","882":"человек только привык писать там переменные, функции, ивенты, а ему говорят \"функции теперь у тебя должны быть в методах, переменные в дате, вычисления в computed\". я лично по началу путался и иногда не мог понять как мне реализовать что-то с нативного джс на вью 2","883":"В пинии можно импортить один стор в другой и в компонент достать только 1 стор в котором уже импортирован еще один, таким образом можно будет в компоненте достать все из одного стора","884":"если переходить со страницы которая доступна конкретному юзеру, то нет, доступ все еще есть до тех страниц, которые запрещены этому юзеру","885":"Функция может принимать параметры, функция будет создавать новое описание, защищая от мутации пакета при использовании пакета","886":"рассказать как работают промисы?)","887":"По твоей логике, были ДОБАВЛЕНЫ многочисленные неявные преобразования вместо простого \"я упал\" потому, что надо было быстрее сделать?","888":"Да нет. всё работает","889":"есть подозрение что vue использует v-model для input.radio на верное с v-dom","890":"не катит, счетчик не может быть ключом","891":"своя модалка что ли","892":"пасиб, попробую","893":"страна достаточно нищая","894":"ахаха )))","895":"При входе на мой сайт с сафари ( на хроме все окей) происходит следующая ошибка. В чем может быть проблема? Данная ошибка приходит от гет запроса. Использую nuxt.js с ssr: false. В fetch делаю гет запрос. Также у меня есть мидлвара, которая при помощи location.href = \"http:\/\/сервис авторизации и аунтификации\"делает редирект. Думаю, что мидлвара прерывает гет запрос, поэтому от него приходит ошибка. Как такое исправить?","896":"когда будет из которых 3 все станет на места","897":"А, не","898":"или задротство?","899":"Я не использовал особо миксины, но вроде они ведь для вынесения общей логики которая содержит в себе состояние. А defineExpose - не общая логика. Это что-то вроде публичного интерфейса компонента (как props\/events).","900":"есть код","901":"vue-kinetic недавно вышла","902":")) \nМожно подумать, что вы её так часто избегаете (я про двойную работу)\nДвойная работа в жини программиста сплошь и рядом","903":"**Why Not Bundle with esbuild?** \nVite's current plugin API isn't compatible with using esbuild as a bundler. In spite of esbuild being faster, Vite's adoption of Rollup's flexible plugin API and infrastructure heavily contributed to its success in the ecosystem. For the time being, we believe that Rollup offers a better performance-vs-flexibility tradeoff.\n\nhttps:\/\/vitejs.dev\/guide\/why.html#why-not-bundle-with-esbuild","904":"смотрю на это все и понимаю как много времени я не потерял","905":"ну если формочки то это в реакт 😏","906":"Я не про, но код стрёмно выглядит в таком виде","907":"Разницы нету я же метод прописываю","908":"Неа","909":"Есть только один и только один кейс где она нужна. Все остальные это неправильно написанный код.","910":"Обязательно ли использовать в твоём случае enter? Или просто эксперименты проводишь?)","911":"звучит как неплохое применение для websockets","912":"На десктопе по ховеру, на мобилке по клику, наверное?","913":"Ну просто все оказалось проще чем я думал)","914":"может кто то другой знает такие плагины","915":"asyncfetch","916":"то есть смысла делать child-роут в этой ситуации нет ?","917":"Да, чёт не подумал так загуглить","918":"ЛОльчто?","919":"это в методе писать?","920":"На этом этапе","921":"если закоментировать history() то по пути \/documents начинает работать роутер и express возвращается json","922":"","923":"Да, похоже","924":"Promise.resolve().then(..) работает\na если async await нет. Я пытаюсь вызвать vue-clipboard после завершения работы get Запроса","925":"+, го чуть-чуть меньше флуда","926":"Дорогое и жирное","927":"Да не, норм он всё сказал. Зачем Eventbus если это прямой потомок","928":"Всем привет!\nЧерез interceptors к axios добавил обработку ошибки, если возникает необходимость логина - показывается форма, полтзователь логинится.\nНо есть беда, как заставить компонент vue выполнить последнее действие (метод, в котором axios, который отработал с ошибкой) ?","929":"","930":"","931":"Потому что его нельзя инвалидировать.\n\nЕсли не микросервисы, то можно юзать самую простую сессию на самом простом токене. Просто сохраняется идентификатор сессии в куку, сам отправляется с запросами, сразу напрямую доступен в SSR, хранится в БД, инвалидируется удалением в любой момент","932":"блин, поскорее бы знатоки проснулись) меня это ппц как дизморалит)","933":"Да я и не против. Сами будем быстро писать эффективные приложения. А вы пишите на джаве","934":"сапожник без сапог","935":"","936":"Хотя да, куда спать... враги качаются )))","937":"И курсами говняными","938":"","939":"невнимательность(","940":"```router.beforeEach((from, to, next) => {\n\n  next({path: '\/login'});\n\n});```\nПочему это выдаёт ошибку?","941":"Oracle 😇, а так в чем вопрос? JS база нужна","942":"кнопки как \"меню\" и кнопки как действие","943":"таким же образом он мог бы и шаблоны vue не собирать, т.к. vue имеет свой парсер шаблонов прямо в браузере","944":"Смневаюсь! Ты же можешь что-то удалить, как это решит библиотека?","945":"после рендеринга?","946":"Но не более","947":"И вот третий модуль, где сама ошибка пробрасывается","948":"есть вуе-рх, в офф орге, но я хз че там","949":"Это фото для поверхностей карты","950":"да давайте проведем голосование на канале по vue, что хуже реакт или вью","951":"nah","952":"https:\/\/linux.die.net\/man\/3\/localtime","953":"в каком экспорте?","954":"","955":"а это плохо?","956":"Не-а","957":"Метод handleInit сейчас true, если будет false - метод в экземпляре должен это отслеживать","958":"Обычные подсказки","959":"Привет! import(\/* webpackChunkName: \"about\" *\/ '.\/views\/About.vue'),","960":"🌚","961":"ты где такой импорт нашел вообще","962":"каждый раз это триггерит. покажите место в доке, в котором написано, что нельзя делать commit из компонентов?)","963":"ваще JS был сделан для написания костылей к тому что не сделать на css и html не больше","964":"и зп далека от 1200$)","965":"бл..","966":"Добрый вечер всем)\nПодскажите пожалуйста, делаю модальное окно и мне надо сделать так, чтобы при клике на esc оно закрывалось, есть вариант через EventListener, но хочется верить, что во вью есть способ для упрощения такой задачи, можете что-то посоветовать ?","967":"Хотя лучше бэк исправлю","968":"vitest, cypress or playwright","969":"Он не может понравиться - он не решает главной задачи - разделение стека технологий, плюс ни в каком виде не поддерживает SSR, плюс ещё куча всего. Это просто маркетинговый ход что у них есть vue, по факту его там нет )","970":"Чем переходишь, как компоненты объявлены.","971":"Надо короче простенькую хрень написать с flask + vue,  но во втором ваапще не ориентируюсь. Брать гетом данные (массив) с вебсервера и показывать их красивенько. Но какие темплейты где менять, что куда пихать... Направьте плз.","972":"Или в плагине поменяй,","973":"хотя мб и нет","974":"Я тоже на это грешу, а как пофиксить можно?","975":"vue я вижу что пропса установлена","976":"он форматирует мне через жопу","977":"не не, эти импорты напрямую к файлам это и есть single source of truth","978":"И что?","979":"Бог недал некоторым свойство уметь гуглить","980":"$props, v-bind тебе помогут. По сути тебе нужно написать компонент, имеющий пропсы обертываемого и проставленными в шаблоне нужными пропсами","981":"А для чего ты console.log написал?","982":"А ну это понятно, это не проблема яваскрипта, а вычислений с плавающий точкой и оно процесорозависимо.\nИ может разный результат быть.","983":"умный не копит, умный инвестирует","984":"Вон, уже реакт дернули, большие совсем","985":"А все  вью  как vue нормально воспринимают ? \n\nЯ читаю как Парни, только начал изучать view","986":"А что ты предлагаешь, делать запрос через интервал? Это еще более ущербно","987":"Работает. Спс.","988":"Нужны были тесты!","989":"в личку дам","990":"Скорее всего говорится,  что axios наиболее распространен. Использовать можно всё что угодно.","991":"на сервере определяй спайдер бота и выдавай ему сгенерированную страницу","992":"Спасибо большое. Прошу прощения заранее - я нуб.","993":"нормальная ide скажет что блок if  лишни","994":"Да это не важно","995":"Да и во vuex никто не отменял модули и плагины","996":"я потому и развел все по сводным таблицам","997":"Медиазапрос мб?","998":"+","999":"Привет! \nВопрос про vuetify. \nПодскажите, как выровнить все объекты по левому краю, как на фото.\nВерстка тут https:\/\/codepen.io\/anon\/pen\/YjjgXx"}}